/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = unsafe {
            *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize)
        };
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {

    pub fn Memento_reference(blk: *mut ::core::ffi::c_void) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn Memento_checkPointerOrNull(blk: *mut ::core::ffi::c_void) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn Memento_checkBytePointerOrNull(blk: *mut ::core::ffi::c_void) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn Memento_checkShortPointerOrNull(blk: *mut ::core::ffi::c_void) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn Memento_checkIntPointerOrNull(blk: *mut ::core::ffi::c_void) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn Memento_startLeaking();
}
unsafe extern "C" {
    pub fn Memento_stopLeaking();
}
unsafe extern "C" {
    pub fn Memento_sequence() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn Memento_squeezing() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn Memento_fin();
}
unsafe extern "C" {
    pub fn Memento_bt();
}
unsafe extern "C" {
    pub fn Memento_cpp_new(size: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn Memento_cpp_delete(pointer: *mut ::core::ffi::c_void);
}
unsafe extern "C" {
    pub fn Memento_cpp_new_array(size: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn Memento_cpp_delete_array(pointer: *mut ::core::ffi::c_void);
}
unsafe extern "C" {
    pub fn Memento_showHash(hash: ::core::ffi::c_uint);
}
unsafe extern "C" {
    pub fn fz_fopen_utf8(
        name: *const ::core::ffi::c_char,
        mode: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn fz_remove_utf8(name: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_argv_from_wargv(
        argc: ::core::ffi::c_int,
        wargv: *mut *mut wchar_t,
    ) -> *mut *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn fz_free_argv(argc: ::core::ffi::c_int, argv: *mut *mut ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn fz_stat_ctime(path: *const ::core::ffi::c_char) -> i64;
}
unsafe extern "C" {
    pub fn fz_stat_mtime(path: *const ::core::ffi::c_char) -> i64;
}
unsafe extern "C" {
    pub fn fz_mkdir(path: *mut ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Range checking atof"]
    pub fn fz_atof(s: *const ::core::ffi::c_char) -> f32;
}
unsafe extern "C" {
    #[doc = "atoi that copes with `NULL`"]
    pub fn fz_atoi(s: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "64bit atoi that copes with `NULL`"]
    pub fn fz_atoi64(s: *const ::core::ffi::c_char) -> i64;
}
unsafe extern "C" {
    #[doc = "size_t atoi that copes with `NULL`.\n\n`NOTE`: limited to 63bits. Negative numbers<br>are returned as 0."]
    pub fn fz_atoz(s: *const ::core::ffi::c_char) -> usize;
}
#[doc = "[`fz_point`] is a point in a two-dimensional space."]
#[repr(C)]
#[derive(
    Debug, Copy, Clone, zerocopy :: FromBytes, zerocopy :: IntoBytes, zerocopy :: Immutable,
)]
pub struct fz_point {
    pub x: f32,
    pub y: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_point"][::core::mem::size_of::<fz_point>() - 8usize];
    ["Alignment of fz_point"][::core::mem::align_of::<fz_point>() - 4usize];
    ["Offset of field: fz_point::x"][::core::mem::offset_of!(fz_point, x) - 0usize];
    ["Offset of field: fz_point::y"][::core::mem::offset_of!(fz_point, y) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_rect {
    pub x0: f32,
    pub y0: f32,
    pub x1: f32,
    pub y1: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_rect"][::core::mem::size_of::<fz_rect>() - 16usize];
    ["Alignment of fz_rect"][::core::mem::align_of::<fz_rect>() - 4usize];
    ["Offset of field: fz_rect::x0"][::core::mem::offset_of!(fz_rect, x0) - 0usize];
    ["Offset of field: fz_rect::y0"][::core::mem::offset_of!(fz_rect, y0) - 4usize];
    ["Offset of field: fz_rect::x1"][::core::mem::offset_of!(fz_rect, x1) - 8usize];
    ["Offset of field: fz_rect::y1"][::core::mem::offset_of!(fz_rect, y1) - 12usize];
};
#[doc = "[`fz_irect`] is a rectangle using integers instead of floats.\n\nIt's used in the draw device and for pixmap dimensions."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_irect {
    pub x0: ::core::ffi::c_int,
    pub y0: ::core::ffi::c_int,
    pub x1: ::core::ffi::c_int,
    pub y1: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_irect"][::core::mem::size_of::<fz_irect>() - 16usize];
    ["Alignment of fz_irect"][::core::mem::align_of::<fz_irect>() - 4usize];
    ["Offset of field: fz_irect::x0"][::core::mem::offset_of!(fz_irect, x0) - 0usize];
    ["Offset of field: fz_irect::y0"][::core::mem::offset_of!(fz_irect, y0) - 4usize];
    ["Offset of field: fz_irect::x1"][::core::mem::offset_of!(fz_irect, x1) - 8usize];
    ["Offset of field: fz_irect::y1"][::core::mem::offset_of!(fz_irect, y1) - 12usize];
};
unsafe extern "C" {
    #[doc = "A rectangle with sides of length one.\n\nThe bottom left corner is at \\(0, 0\\) and the top right corner<br>is at \\(1, 1\\)."]
    pub static fz_unit_rect: fz_rect;
}
unsafe extern "C" {
    #[doc = "An empty rectangle with an area equal to zero."]
    pub static fz_empty_rect: fz_rect;
}
unsafe extern "C" {
    pub static fz_empty_irect: fz_irect;
}
unsafe extern "C" {
    #[doc = "An infinite rectangle."]
    pub static fz_infinite_rect: fz_rect;
}
unsafe extern "C" {
    pub static fz_infinite_irect: fz_irect;
}
unsafe extern "C" {
    #[doc = "An invalid rectangle."]
    pub static fz_invalid_rect: fz_rect;
}
unsafe extern "C" {
    pub static fz_invalid_irect: fz_irect;
}
#[doc = "[`fz_matrix`] is a row-major 3x3 matrix used for representing<br>transformations of coordinates throughout MuPDF.\n\nSince all points reside in a two-dimensional space, one vector<br>is always a constant unit vector; hence only some elements may<br>vary in a matrix. Below is how the elements map between<br>different representations.\n\n/ a b 0 \\<br>| c d 0 | normally represented as \\[ a b c d e f \\].<br>\\ e f 1 /"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_matrix {
    pub a: f32,
    pub b: f32,
    pub c: f32,
    pub d: f32,
    pub e: f32,
    pub f: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_matrix"][::core::mem::size_of::<fz_matrix>() - 24usize];
    ["Alignment of fz_matrix"][::core::mem::align_of::<fz_matrix>() - 4usize];
    ["Offset of field: fz_matrix::a"][::core::mem::offset_of!(fz_matrix, a) - 0usize];
    ["Offset of field: fz_matrix::b"][::core::mem::offset_of!(fz_matrix, b) - 4usize];
    ["Offset of field: fz_matrix::c"][::core::mem::offset_of!(fz_matrix, c) - 8usize];
    ["Offset of field: fz_matrix::d"][::core::mem::offset_of!(fz_matrix, d) - 12usize];
    ["Offset of field: fz_matrix::e"][::core::mem::offset_of!(fz_matrix, e) - 16usize];
    ["Offset of field: fz_matrix::f"][::core::mem::offset_of!(fz_matrix, f) - 20usize];
};
unsafe extern "C" {
    #[doc = "Identity transform matrix."]
    pub static fz_identity: fz_matrix;
}
unsafe extern "C" {
    #[doc = "Multiply two matrices.\n\nThe order of the two matrices are important since matrix<br>multiplication is not commutative.\n\nReturns result."]
    pub fn fz_concat(left: fz_matrix, right: fz_matrix) -> fz_matrix;
}
unsafe extern "C" {
    #[doc = "Create a scaling matrix.\n\nThe returned matrix is of the form \\[ sx 0 0 sy 0 0 \\].\n\n`m`: Pointer to the matrix to populate\n\n`sx`, `sy`: Scaling factors along the X- and Y-axes. A scaling<br>factor of 1.0 will not cause any scaling along the relevant<br>axis.\n\nReturns m."]
    pub fn fz_scale(sx: f32, sy: f32) -> fz_matrix;
}
unsafe extern "C" {
    #[doc = "Scale a matrix by premultiplication.\n\n`m`: Pointer to the matrix to scale\n\n`sx`, `sy`: Scaling factors along the X- and Y-axes. A scaling<br>factor of 1.0 will not cause any scaling along the relevant<br>axis.\n\nReturns m \\(updated\\)."]
    pub fn fz_pre_scale(m: fz_matrix, sx: f32, sy: f32) -> fz_matrix;
}
unsafe extern "C" {
    #[doc = "Scale a matrix by postmultiplication.\n\n`m`: Pointer to the matrix to scale\n\n`sx`, `sy`: Scaling factors along the X- and Y-axes. A scaling<br>factor of 1.0 will not cause any scaling along the relevant<br>axis.\n\nReturns m \\(updated\\)."]
    pub fn fz_post_scale(m: fz_matrix, sx: f32, sy: f32) -> fz_matrix;
}
unsafe extern "C" {
    #[doc = "Create a shearing matrix.\n\nThe returned matrix is of the form \\[ 1 sy sx 1 0 0 \\].\n\n`m`: pointer to place to store returned matrix\n\n`sx`, `sy`: Shearing factors. A shearing factor of 0.0 will not<br>cause any shearing along the relevant axis.\n\nReturns m."]
    pub fn fz_shear(sx: f32, sy: f32) -> fz_matrix;
}
unsafe extern "C" {
    #[doc = "Premultiply a matrix with a shearing matrix.\n\nThe shearing matrix is of the form \\[ 1 sy sx 1 0 0 \\].\n\n`m`: pointer to matrix to premultiply\n\n`sx`, `sy`: Shearing factors. A shearing factor of 0.0 will not<br>cause any shearing along the relevant axis.\n\nReturns m \\(updated\\)."]
    pub fn fz_pre_shear(m: fz_matrix, sx: f32, sy: f32) -> fz_matrix;
}
unsafe extern "C" {
    #[doc = "Create a rotation matrix.\n\nThe returned matrix is of the form<br>\\[ cos\\(deg\\) sin\\(deg\\) -sin\\(deg\\) cos\\(deg\\) 0 0 \\].\n\n`m`: Pointer to place to store matrix\n\n`degrees`: Degrees of counter clockwise rotation. Values less<br>than zero and greater than 360 are handled as expected.\n\nReturns m."]
    pub fn fz_rotate(degrees: f32) -> fz_matrix;
}
unsafe extern "C" {
    #[doc = "Rotate a transformation by premultiplying.\n\nThe premultiplied matrix is of the form<br>\\[ cos\\(deg\\) sin\\(deg\\) -sin\\(deg\\) cos\\(deg\\) 0 0 \\].\n\n`m`: Pointer to matrix to premultiply.\n\n`degrees`: Degrees of counter clockwise rotation. Values less<br>than zero and greater than 360 are handled as expected.\n\nReturns m \\(updated\\)."]
    pub fn fz_pre_rotate(m: fz_matrix, degrees: f32) -> fz_matrix;
}
unsafe extern "C" {
    #[doc = "Create a translation matrix.\n\nThe returned matrix is of the form \\[ 1 0 0 1 tx ty \\].\n\n`m`: A place to store the created matrix.\n\n`tx`, `ty`: Translation distances along the X- and Y-axes. A<br>translation of 0 will not cause any translation along the<br>relevant axis.\n\nReturns m."]
    pub fn fz_translate(tx: f32, ty: f32) -> fz_matrix;
}
unsafe extern "C" {
    #[doc = "Translate a matrix by premultiplication.\n\n`m`: The matrix to translate\n\n`tx`, `ty`: Translation distances along the X- and Y-axes. A<br>translation of 0 will not cause any translation along the<br>relevant axis.\n\nReturns m."]
    pub fn fz_pre_translate(m: fz_matrix, tx: f32, ty: f32) -> fz_matrix;
}
unsafe extern "C" {
    #[doc = "Create transform matrix to draw page<br>at a given resolution and rotation. Adjusts the scaling<br>factors so that the page covers whole number of<br>pixels and adjust the page origin to be at 0,0."]
    pub fn fz_transform_page(mediabox: fz_rect, resolution: f32, rotate: f32) -> fz_matrix;
}
unsafe extern "C" {
    #[doc = "Create an inverse matrix.\n\n`matrix`: Matrix to invert. A degenerate matrix, where the<br>determinant is equal to zero, can not be inverted and the<br>original matrix is returned instead.\n\nReturns inverse."]
    pub fn fz_invert_matrix(matrix: fz_matrix) -> fz_matrix;
}
unsafe extern "C" {
    #[doc = "Attempt to create an inverse matrix.\n\n`inv`: Place to store inverse matrix.\n\n`src`: Matrix to invert. A degenerate matrix, where the<br>determinant is equal to zero, can not be inverted.\n\nReturns 1 if matrix is degenerate \\(singular\\), or 0 otherwise."]
    pub fn fz_try_invert_matrix(inv: *mut fz_matrix, src: fz_matrix) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Check if a transformation is rectilinear.\n\nRectilinear means that no shearing is present and that any<br>rotations present are a multiple of 90 degrees. Usually this<br>is used to make sure that axis-aligned rectangles before the<br>transformation are still axis-aligned rectangles afterwards."]
    pub fn fz_is_rectilinear(m: fz_matrix) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Calculate average scaling factor of matrix."]
    pub fn fz_matrix_expansion(m: fz_matrix) -> f32;
}
unsafe extern "C" {
    #[doc = "Compute intersection of two rectangles.\n\nGiven two rectangles, update the first to be the smallest<br>axis-aligned rectangle that covers the area covered by both<br>given rectangles. If either rectangle is empty then the<br>intersection is also empty. If either rectangle is infinite<br>then the intersection is simply the non-infinite rectangle.<br>Should both rectangles be infinite, then the intersection is<br>also infinite."]
    pub fn fz_intersect_rect(a: fz_rect, b: fz_rect) -> fz_rect;
}
unsafe extern "C" {
    #[doc = "Compute intersection of two bounding boxes.\n\nSimilar to [`fz_intersect_rect`] but operates on two bounding<br>boxes instead of two rectangles."]
    pub fn fz_intersect_irect(a: fz_irect, b: fz_irect) -> fz_irect;
}
unsafe extern "C" {
    #[doc = "Compute union of two rectangles.\n\nGiven two rectangles, update the first to be the smallest<br>axis-aligned rectangle that encompasses both given rectangles.<br>If either rectangle is infinite then the union is also infinite.<br>If either rectangle is empty then the union is simply the<br>non-empty rectangle. Should both rectangles be empty, then the<br>union is also empty."]
    pub fn fz_union_rect(a: fz_rect, b: fz_rect) -> fz_rect;
}
unsafe extern "C" {
    #[doc = "Convert a rect into the minimal bounding box<br>that covers the rectangle.\n\nCoordinates in a bounding box are integers, so rounding of the<br>rects coordinates takes place. The top left corner is rounded<br>upwards and left while the bottom right corner is rounded<br>downwards and to the right."]
    pub fn fz_irect_from_rect(rect: fz_rect) -> fz_irect;
}
unsafe extern "C" {
    #[doc = "Round rectangle coordinates.\n\nCoordinates in a bounding box are integers, so rounding of the<br>rects coordinates takes place. The top left corner is rounded<br>upwards and left while the bottom right corner is rounded<br>downwards and to the right.\n\nThis differs from [`fz_irect_from_rect`], in that [`fz_irect_from_rect`]<br>slavishly follows the numbers \\(i.e any slight over/under<br>calculations can cause whole extra pixels to be added\\).<br>[`fz_round_rect`] allows for a small amount of rounding error when<br>calculating the bbox."]
    pub fn fz_round_rect(rect: fz_rect) -> fz_irect;
}
unsafe extern "C" {
    #[doc = "Convert a bbox into a rect.\n\nFor our purposes, a rect can represent all the values we meet in<br>a bbox, so nothing can go wrong.\n\n`rect`: A place to store the generated rectangle.\n\n`bbox`: The bbox to convert.\n\nReturns rect \\(updated\\)."]
    pub fn fz_rect_from_irect(bbox: fz_irect) -> fz_rect;
}
unsafe extern "C" {
    #[doc = "Expand a bbox by a given amount in all directions."]
    pub fn fz_expand_rect(b: fz_rect, expand: f32) -> fz_rect;
}
unsafe extern "C" {
    pub fn fz_expand_irect(a: fz_irect, expand: ::core::ffi::c_int) -> fz_irect;
}
unsafe extern "C" {
    #[doc = "Expand a bbox to include a given point.<br>To create a rectangle that encompasses a sequence of points, the<br>rectangle must first be set to be the empty rectangle at one of<br>the points before including the others."]
    pub fn fz_include_point_in_rect(r: fz_rect, p: fz_point) -> fz_rect;
}
unsafe extern "C" {
    #[doc = "Translate bounding box.\n\nTranslate a bbox by a given x and y offset. Allows for overflow."]
    pub fn fz_translate_rect(a: fz_rect, xoff: f32, yoff: f32) -> fz_rect;
}
unsafe extern "C" {
    pub fn fz_translate_irect(
        a: fz_irect,
        xoff: ::core::ffi::c_int,
        yoff: ::core::ffi::c_int,
    ) -> fz_irect;
}
unsafe extern "C" {
    #[doc = "Test rectangle inclusion.\n\nReturn true if a entirely contains b."]
    pub fn fz_contains_rect(a: fz_rect, b: fz_rect) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Test rectangle overlap.\n\nReturns true if the area of the overlap is<br>non zero."]
    pub fn fz_overlaps_rect(a: fz_rect, b: fz_rect) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Apply a transformation to a point.\n\n`transform`: Transformation matrix to apply. See [`fz_concat`],<br>[`fz_scale`], [`fz_rotate`] and [`fz_translate`] for how to create a<br>matrix.\n\n`point`: Pointer to point to update.\n\nReturns transform \\(unchanged\\)."]
    pub fn fz_transform_point(point: fz_point, m: fz_matrix) -> fz_point;
}
unsafe extern "C" {
    pub fn fz_transform_point_xy(x: f32, y: f32, m: fz_matrix) -> fz_point;
}
unsafe extern "C" {
    #[doc = "Apply a transformation to a vector.\n\n`transform`: Transformation matrix to apply. See [`fz_concat`],<br>[`fz_scale`] and [`fz_rotate`] for how to create a matrix. Any<br>translation will be ignored.\n\n`vector`: Pointer to vector to update."]
    pub fn fz_transform_vector(vector: fz_point, m: fz_matrix) -> fz_point;
}
unsafe extern "C" {
    #[doc = "Apply a transform to a rectangle.\n\nAfter the four corner points of the axis-aligned rectangle<br>have been transformed it may not longer be axis-aligned. So a<br>new axis-aligned rectangle is created covering at least the<br>area of the transformed rectangle.\n\n`transform`: Transformation matrix to apply. See [`fz_concat`],<br>[`fz_scale`] and [`fz_rotate`] for how to create a matrix.\n\n`rect`: Rectangle to be transformed. The two special cases<br>[`fz_empty_rect`] and [`fz_infinite_rect`], may be used but are<br>returned unchanged as expected."]
    pub fn fz_transform_rect(rect: fz_rect, m: fz_matrix) -> fz_rect;
}
unsafe extern "C" {
    #[doc = "Normalize a vector to length one."]
    pub fn fz_normalize_vector(p: fz_point) -> fz_point;
}
unsafe extern "C" {
    #[doc = "Grid fit a matrix.\n\nas_tiled = 0 =\\> adjust the matrix so that the image of the unit<br>square completely covers any pixel that was touched by the<br>image of the unit square under the original matrix.\n\nas_tiled = 1 =\\> adjust the matrix so that the corners of the<br>image of the unit square align with the closest integer corner<br>of the image of the unit square under the original matrix."]
    pub fn fz_gridfit_matrix(as_tiled: ::core::ffi::c_int, m: fz_matrix) -> fz_matrix;
}
unsafe extern "C" {
    #[doc = "Find the largest expansion performed by this matrix.<br>\\(i.e. max\\(abs\\(m.a\\),abs\\(m.b\\),abs\\(m.c\\),abs\\(m.d\\)\\)"]
    pub fn fz_matrix_max_expansion(m: fz_matrix) -> f32;
}
#[doc = "A representation for a region defined by 4 points.\n\nThe significant difference between quads and rects is that<br>the edges of quads are not axis aligned."]
#[repr(C)]
#[derive(
    Debug, Copy, Clone, zerocopy :: FromBytes, zerocopy :: IntoBytes, zerocopy :: Immutable,
)]
pub struct fz_quad {
    pub ul: fz_point,
    pub ur: fz_point,
    pub ll: fz_point,
    pub lr: fz_point,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_quad"][::core::mem::size_of::<fz_quad>() - 32usize];
    ["Alignment of fz_quad"][::core::mem::align_of::<fz_quad>() - 4usize];
    ["Offset of field: fz_quad::ul"][::core::mem::offset_of!(fz_quad, ul) - 0usize];
    ["Offset of field: fz_quad::ur"][::core::mem::offset_of!(fz_quad, ur) - 8usize];
    ["Offset of field: fz_quad::ll"][::core::mem::offset_of!(fz_quad, ll) - 16usize];
    ["Offset of field: fz_quad::lr"][::core::mem::offset_of!(fz_quad, lr) - 24usize];
};
unsafe extern "C" {
    pub static fz_invalid_quad: fz_quad;
}
unsafe extern "C" {
    pub static fz_infinite_quad: fz_quad;
}
unsafe extern "C" {
    #[doc = "Is a quad valid?"]
    pub fn fz_is_valid_quad(q: fz_quad) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Is a quad empty?"]
    pub fn fz_is_empty_quad(q: fz_quad) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Is a quad infinite?"]
    pub fn fz_is_infinite_quad(q: fz_quad) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Convert a rect to a quad \\(losslessly\\)."]
    pub fn fz_quad_from_rect(r: fz_rect) -> fz_quad;
}
unsafe extern "C" {
    #[doc = "Convert a quad to the smallest rect that covers it."]
    pub fn fz_rect_from_quad(q: fz_quad) -> fz_rect;
}
unsafe extern "C" {
    #[doc = "Transform a quad by a matrix."]
    pub fn fz_transform_quad(q: fz_quad, m: fz_matrix) -> fz_quad;
}
unsafe extern "C" {
    #[doc = "Inclusion test for quads."]
    pub fn fz_is_point_inside_quad(p: fz_point, q: fz_quad) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Inclusion test for rects. \\(Rect is assumed to be open, i.e.<br>top right corner is not included\\)."]
    pub fn fz_is_point_inside_rect(p: fz_point, r: fz_rect) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Inclusion test for irects. \\(Rect is assumed to be open, i.e.<br>top right corner is not included\\)."]
    pub fn fz_is_point_inside_irect(
        x: ::core::ffi::c_int,
        y: ::core::ffi::c_int,
        r: fz_irect,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Inclusion test for rects.\n\nrects are assumed to be both open or both closed.\n\nNo invalid rect can include any other rect.<br>No invalid rect can be included by any rect.<br>Empty \\(point\\) rects can include themselves.<br>Empty \\(line\\) rects can include many \\(subline\\) rects."]
    pub fn fz_is_rect_inside_rect(inner: fz_rect, outer: fz_rect) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Inclusion test for irects.\n\nrects are assumed to be both open or both closed.\n\nNo invalid rect can include any other rect.<br>No invalid rect can be included by any rect.<br>Empty \\(point\\) rects can include themselves.<br>Empty \\(line\\) rects can include many \\(subline\\) rects."]
    pub fn fz_is_irect_inside_irect(inner: fz_irect, outer: fz_irect) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Inclusion test for quad in quad.\n\nThis may break down if quads are not 'well formed'."]
    pub fn fz_is_quad_inside_quad(needle: fz_quad, haystack: fz_quad) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Intersection test for quads.\n\nThis may break down if quads are not 'well formed'."]
    pub fn fz_is_quad_intersecting_quad(a: fz_quad, b: fz_quad) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_font_context {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_hyph_context {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_colorspace_context {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_style_context {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_tuning_context {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_store {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_glyph_cache {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_document_handler_context {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_archive_handler_context {
    _unused: [u8; 0],
}
#[doc = "Allocator structure; holds callbacks and private data pointer."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_alloc_context {
    pub user: *mut ::core::ffi::c_void,
    pub malloc: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::core::ffi::c_void,
            arg2: usize,
        ) -> *mut ::core::ffi::c_void,
    >,
    pub realloc: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::core::ffi::c_void,
            arg2: *mut ::core::ffi::c_void,
            arg3: usize,
        ) -> *mut ::core::ffi::c_void,
    >,
    pub free: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void, arg2: *mut ::core::ffi::c_void),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_alloc_context"][::core::mem::size_of::<fz_alloc_context>() - 32usize];
    ["Alignment of fz_alloc_context"][::core::mem::align_of::<fz_alloc_context>() - 8usize];
    ["Offset of field: fz_alloc_context::user"]
        [::core::mem::offset_of!(fz_alloc_context, user) - 0usize];
    ["Offset of field: fz_alloc_context::malloc"]
        [::core::mem::offset_of!(fz_alloc_context, malloc) - 8usize];
    ["Offset of field: fz_alloc_context::realloc"]
        [::core::mem::offset_of!(fz_alloc_context, realloc) - 16usize];
    ["Offset of field: fz_alloc_context::free"]
        [::core::mem::offset_of!(fz_alloc_context, free) - 24usize];
};
unsafe extern "C" {
    pub fn fz_throw(
        ctx: *mut fz_context,
        errcode: ::core::ffi::c_int,
        arg1: *const ::core::ffi::c_char,
        ...
    ) -> !;
}
unsafe extern "C" {
    pub fn fz_rethrow(ctx: *mut fz_context) -> !;
}
unsafe extern "C" {
    #[doc = "Called within a catch block this modifies the current<br>exception's code. If it's of type 'fromcode' it is<br>modified to 'tocode'. Typically used for 'downgrading'<br>exception severity."]
    pub fn fz_morph_error(
        ctx: *mut fz_context,
        fromcode: ::core::ffi::c_int,
        tocode: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn fz_warn(ctx: *mut fz_context, fmt: *const ::core::ffi::c_char, ...);
}
unsafe extern "C" {
    #[doc = "Within an [`fz_catch`]\\(\\) block, retrieve the formatted message<br>string for the current exception.\n\nThis assumes no intervening use of [`fz_try`]/[`fz_catch`]."]
    pub fn fz_caught_message(ctx: *mut fz_context) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Within an [`fz_catch`]\\(\\) block, retrieve the error code for<br>the current exception.\n\nThis assumes no intervening use of [`fz_try`]/[`fz_catch`]."]
    pub fn fz_caught(ctx: *mut fz_context) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_caught_errno(ctx: *mut fz_context) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Within an [`fz_catch`]\\(\\) block, rethrow the current exception<br>if the errcode of the current exception matches.\n\nThis assumes no intervening use of [`fz_try`]/[`fz_catch`]."]
    pub fn fz_rethrow_if(ctx: *mut fz_context, errcode: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn fz_rethrow_unless(ctx: *mut fz_context, errcode: ::core::ffi::c_int);
}
unsafe extern "C" {
    #[doc = "Format an error message, and log it to the registered<br>error stream \\(stderr by default\\)."]
    pub fn fz_log_error_printf(ctx: *mut fz_context, fmt: *const ::core::ffi::c_char, ...);
}
unsafe extern "C" {
    #[doc = "Log a \\(preformatted\\) string to the registered<br>error stream \\(stderr by default\\)."]
    pub fn fz_log_error(ctx: *mut fz_context, str_: *const ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn fz_start_throw_on_repair(ctx: *mut fz_context);
}
unsafe extern "C" {
    pub fn fz_end_throw_on_repair(ctx: *mut fz_context);
}
unsafe extern "C" {
    pub fn fz_report_error(ctx: *mut fz_context);
}
unsafe extern "C" {
    pub fn fz_ignore_error(ctx: *mut fz_context);
}
unsafe extern "C" {
    pub fn fz_convert_error(
        ctx: *mut fz_context,
        code: *mut ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_char;
}
pub const FZ_ERROR_NONE: fz_error_type = 0;
pub const FZ_ERROR_GENERIC: fz_error_type = 1;
pub const FZ_ERROR_SYSTEM: fz_error_type = 2;
pub const FZ_ERROR_LIBRARY: fz_error_type = 3;
pub const FZ_ERROR_ARGUMENT: fz_error_type = 4;
pub const FZ_ERROR_LIMIT: fz_error_type = 5;
pub const FZ_ERROR_UNSUPPORTED: fz_error_type = 6;
pub const FZ_ERROR_FORMAT: fz_error_type = 7;
pub const FZ_ERROR_SYNTAX: fz_error_type = 8;
pub const FZ_ERROR_TRYLATER: fz_error_type = 9;
pub const FZ_ERROR_ABORT: fz_error_type = 10;
pub const FZ_ERROR_REPAIRED: fz_error_type = 11;
pub type fz_error_type = ::core::ffi::c_int;
unsafe extern "C" {
    #[doc = "Flush any repeated warnings.\n\nRepeated warnings are buffered, counted and eventually printed<br>along with the number of repetitions. Call [`fz_flush_warnings`]<br>to force printing of the latest buffered warning and the<br>number of repetitions, for example to make sure that all<br>warnings are printed before exiting an application."]
    pub fn fz_flush_warnings(ctx: *mut fz_context);
}
#[doc = "Locking functions\n\nMuPDF is kept deliberately free of any knowledge of particular<br>threading systems. As such, in order for safe multi-threaded<br>operation, we rely on callbacks to client provided functions.\n\nA client is expected to provide [`FZ_LOCK_MAX`] number of mutexes,<br>and a function to lock/unlock each of them. These may be<br>recursive mutexes, but do not have to be.\n\nIf a client does not intend to use multiple threads, then it<br>may pass `NULL` instead of a lock structure.\n\nIn order to avoid deadlocks, we have one simple rule<br>internally as to how we use locks: We can never take lock n<br>when we already hold any lock i, where 0 \\<= i \\<= n. In order<br>to verify this, we have some debugging code, that can be<br>enabled by defining FITZ_DEBUG_LOCKING."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_locks_context {
    pub user: *mut ::core::ffi::c_void,
    pub lock: ::core::option::Option<
        unsafe extern "C" fn(user: *mut ::core::ffi::c_void, lock: ::core::ffi::c_int),
    >,
    pub unlock: ::core::option::Option<
        unsafe extern "C" fn(user: *mut ::core::ffi::c_void, lock: ::core::ffi::c_int),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_locks_context"][::core::mem::size_of::<fz_locks_context>() - 24usize];
    ["Alignment of fz_locks_context"][::core::mem::align_of::<fz_locks_context>() - 8usize];
    ["Offset of field: fz_locks_context::user"]
        [::core::mem::offset_of!(fz_locks_context, user) - 0usize];
    ["Offset of field: fz_locks_context::lock"]
        [::core::mem::offset_of!(fz_locks_context, lock) - 8usize];
    ["Offset of field: fz_locks_context::unlock"]
        [::core::mem::offset_of!(fz_locks_context, unlock) - 16usize];
};
pub const FZ_LOCK_ALLOC: _bindgen_ty_1 = 0;
pub const FZ_LOCK_FREETYPE: _bindgen_ty_1 = 1;
pub const FZ_LOCK_GLYPHCACHE: _bindgen_ty_1 = 2;
pub const FZ_LOCK_MAX: _bindgen_ty_1 = 3;
pub type _bindgen_ty_1 = ::core::ffi::c_int;
unsafe extern "C" {
    pub fn fz_assert_lock_held(ctx: *mut fz_context, lock: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn fz_assert_lock_not_held(ctx: *mut fz_context, lock: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn fz_lock_debug_lock(ctx: *mut fz_context, lock: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn fz_lock_debug_unlock(ctx: *mut fz_context, lock: ::core::ffi::c_int);
}
pub const FZ_STORE_UNLIMITED: _bindgen_ty_2 = 0;
pub const FZ_STORE_DEFAULT: _bindgen_ty_2 = 268435456;
#[doc = "Specifies the maximum size in bytes of the resource store in<br>[`fz_context`]. Given as argument to [`fz_new_context`].\n\n[`FZ_STORE_UNLIMITED`]: Let resource store grow unbounded.\n\n[`FZ_STORE_DEFAULT`]: A reasonable upper bound on the size, for<br>devices that are not memory constrained."]
pub type _bindgen_ty_2 = ::core::ffi::c_int;
unsafe extern "C" {
    #[doc = "Make a clone of an existing context.\n\nThis function is meant to be used in multi-threaded<br>applications where each thread requires its own context, yet<br>parts of the global state, for example caching, are shared.\n\n`ctx`: Context obtained from [`fz_new_context`] to make a copy of.<br>ctx must have had locks and lock/functions setup when created.<br>The two contexts will share the memory allocator, resource<br>store, locks and lock/unlock functions. They will each have<br>their own exception stacks though.\n\nMay return `NULL`."]
    pub fn fz_clone_context(ctx: *mut fz_context) -> *mut fz_context;
}
unsafe extern "C" {
    #[doc = "Free a context and its global state.\n\nThe context and all of its global state is freed, and any<br>buffered warnings are flushed \\(see [`fz_flush_warnings`]\\). If `NULL`<br>is passed in nothing will happen.\n\nMust not be called for a context that is being used in an active<br>[`fz_try`]\\(\\), [`fz_alway`](fz_alway)s\\(\\) or [`fz_catch`]\\(\\) block."]
    pub fn fz_drop_context(ctx: *mut fz_context);
}
unsafe extern "C" {
    #[doc = "Set the user field in the context.\n\n`NULL` initially, this field can be set to any opaque value<br>required by the user. It is copied on clones."]
    pub fn fz_set_user_context(ctx: *mut fz_context, user: *mut ::core::ffi::c_void);
}
unsafe extern "C" {
    #[doc = "Read the user field from the context."]
    pub fn fz_user_context(ctx: *mut fz_context) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = "`FIXME`: Better not to expose [`fz_default_error_callback`], and<br>[`fz_default_warning`] callback and to allow '`NULL`' to be used<br>int [`fz_set_xxxx_callback`] to mean \"defaults\".\n\n`FIXME`: Do we need/want functions like<br>[`fz_error_callback`]\\(ctx, message\\) to allow callers to inject<br>stuff into the error/warning streams?<br>/<br>/**<br>The default error callback. Declared publicly just so that the<br>error callback can be set back to this after it has been<br>overridden."]
    pub fn fz_default_error_callback(
        user: *mut ::core::ffi::c_void,
        message: *const ::core::ffi::c_char,
    );
}
unsafe extern "C" {
    #[doc = "The default warning callback. Declared publicly just so that<br>the warning callback can be set back to this after it has been<br>overridden."]
    pub fn fz_default_warning_callback(
        user: *mut ::core::ffi::c_void,
        message: *const ::core::ffi::c_char,
    );
}
#[doc = "A callback called whenever an error message is generated.<br>The user pointer passed to [`fz_set_error_callback`]\\(\\) is passed<br>along with the error message."]
pub type fz_error_cb = ::core::option::Option<
    unsafe extern "C" fn(user: *mut ::core::ffi::c_void, message: *const ::core::ffi::c_char),
>;
#[doc = "A callback called whenever a warning message is generated.<br>The user pointer passed to [`fz_set_warning_callback`]\\(\\) is<br>passed along with the warning message."]
pub type fz_warning_cb = ::core::option::Option<
    unsafe extern "C" fn(user: *mut ::core::ffi::c_void, message: *const ::core::ffi::c_char),
>;
unsafe extern "C" {
    #[doc = "Set the error callback. This will be called as part of the<br>exception handling.\n\nThe callback must not throw exceptions!"]
    pub fn fz_set_error_callback(
        ctx: *mut fz_context,
        error_cb: fz_error_cb,
        user: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    #[doc = "Retrieve the currently set error callback, or `NULL` if none<br>has been set. Optionally, if user is non-`NULL`, the user pointer<br>given when the warning callback was set is also passed back to<br>the caller."]
    pub fn fz_error_callback(
        ctx: *mut fz_context,
        user: *mut *mut ::core::ffi::c_void,
    ) -> fz_error_cb;
}
unsafe extern "C" {
    #[doc = "Set the warning callback. This will be called as part of the<br>exception handling.\n\nThe callback must not throw exceptions!"]
    pub fn fz_set_warning_callback(
        ctx: *mut fz_context,
        warning_cb: fz_warning_cb,
        user: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    #[doc = "Retrieve the currently set warning callback, or `NULL` if none<br>has been set. Optionally, if user is non-`NULL`, the user pointer<br>given when the warning callback was set is also passed back to<br>the caller."]
    pub fn fz_warning_callback(
        ctx: *mut fz_context,
        user: *mut *mut ::core::ffi::c_void,
    ) -> fz_warning_cb;
}
#[doc = "Given the width and height of an image,<br>the subsample factor, and the subarea of the image actually<br>required, the caller can decide whether to decode the whole<br>image or just a subarea.\n\n`arg`: The caller supplied opaque argument.\n\n`w`, `h`: The width/height of the complete image.\n\n`l2factor`: The log2 factor for subsampling \\(i.e. image will be<br>decoded to \\(w\\>\\>l2factor, h\\>\\>l2factor\\)\\).\n\n`subarea`: The actual subarea required for the current operation.<br>The tuning function is allowed to increase this in size if<br>required."]
pub type fz_tune_image_decode_fn = ::core::option::Option<
    unsafe extern "C" fn(
        arg: *mut ::core::ffi::c_void,
        w: ::core::ffi::c_int,
        h: ::core::ffi::c_int,
        l2factor: ::core::ffi::c_int,
        subarea: *mut fz_irect,
    ),
>;
#[doc = "Given the source width and height of<br>image, together with the actual required width and height,<br>decide whether we should use mitchell scaling.\n\n`arg`: The caller supplied opaque argument.\n\n`dst_w`, `dst_h`: The actual width/height required on the target<br>device.\n\n`src_w`, `src_h`: The source width/height of the image.\n\nReturn 0 not to use the Mitchell scaler, 1 to use the Mitchell<br>scaler. All other values reserved."]
pub type fz_tune_image_scale_fn = ::core::option::Option<
    unsafe extern "C" fn(
        arg: *mut ::core::ffi::c_void,
        dst_w: ::core::ffi::c_int,
        dst_h: ::core::ffi::c_int,
        src_w: ::core::ffi::c_int,
        src_h: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int,
>;
unsafe extern "C" {
    #[doc = "Set the tuning function to use for<br>image decode.\n\n`image_decode`: Function to use.\n\n`arg`: Opaque argument to be passed to tuning function."]
    pub fn fz_tune_image_decode(
        ctx: *mut fz_context,
        image_decode: fz_tune_image_decode_fn,
        arg: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    #[doc = "Set the tuning function to use for<br>image scaling.\n\n`image_scale`: Function to use.\n\n`arg`: Opaque argument to be passed to tuning function."]
    pub fn fz_tune_image_scale(
        ctx: *mut fz_context,
        image_scale: fz_tune_image_scale_fn,
        arg: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    #[doc = "Get the number of bits of antialiasing we are<br>using \\(for graphics\\). Between 0 and 8."]
    pub fn fz_aa_level(ctx: *mut fz_context) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Set the number of bits of antialiasing we should<br>use \\(for both text and graphics\\).\n\n`bits`: The number of bits of antialiasing to use \\(values are<br>clamped to within the 0 to 8 range\\)."]
    pub fn fz_set_aa_level(ctx: *mut fz_context, bits: ::core::ffi::c_int);
}
unsafe extern "C" {
    #[doc = "Get the number of bits of antialiasing we are<br>using for text. Between 0 and 8."]
    pub fn fz_text_aa_level(ctx: *mut fz_context) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Set the number of bits of antialiasing we<br>should use for text.\n\n`bits`: The number of bits of antialiasing to use \\(values are<br>clamped to within the 0 to 8 range\\)."]
    pub fn fz_set_text_aa_level(ctx: *mut fz_context, bits: ::core::ffi::c_int);
}
unsafe extern "C" {
    #[doc = "Get the number of bits of antialiasing we are<br>using for graphics. Between 0 and 8."]
    pub fn fz_graphics_aa_level(ctx: *mut fz_context) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Set the number of bits of antialiasing we<br>should use for graphics.\n\n`bits`: The number of bits of antialiasing to use \\(values are<br>clamped to within the 0 to 8 range\\)."]
    pub fn fz_set_graphics_aa_level(ctx: *mut fz_context, bits: ::core::ffi::c_int);
}
unsafe extern "C" {
    #[doc = "Get the minimum line width to be<br>used for stroked lines.\n\n`min_line_width`: The minimum line width to use \\(in pixels\\)."]
    pub fn fz_graphics_min_line_width(ctx: *mut fz_context) -> f32;
}
unsafe extern "C" {
    #[doc = "Set the minimum line width to be<br>used for stroked lines.\n\n`min_line_width`: The minimum line width to use \\(in pixels\\)."]
    pub fn fz_set_graphics_min_line_width(ctx: *mut fz_context, min_line_width: f32);
}
unsafe extern "C" {
    #[doc = "Get the user stylesheet source text."]
    pub fn fz_user_css(ctx: *mut fz_context) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Set the user stylesheet source text for use with HTML and EPUB."]
    pub fn fz_set_user_css(ctx: *mut fz_context, text: *const ::core::ffi::c_char);
}
unsafe extern "C" {
    #[doc = "Set the user stylesheet by loading the source from a file.<br>If the file is missing, do nothing."]
    pub fn fz_load_user_css(ctx: *mut fz_context, filename: *const ::core::ffi::c_char);
}
unsafe extern "C" {
    #[doc = "Return whether to respect document styles in HTML and EPUB."]
    pub fn fz_use_document_css(ctx: *mut fz_context) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Toggle whether to respect document styles in HTML and EPUB."]
    pub fn fz_set_use_document_css(ctx: *mut fz_context, use_: ::core::ffi::c_int);
}
unsafe extern "C" {
    #[doc = "Enable icc profile based operation."]
    pub fn fz_enable_icc(ctx: *mut fz_context);
}
unsafe extern "C" {
    #[doc = "Disable icc profile based operation."]
    pub fn fz_disable_icc(ctx: *mut fz_context);
}
unsafe extern "C" {
    #[doc = "Allocate uninitialized memory of a given size.<br>Does NOT clear the memory!\n\nMay return `NULL` for size = 0.\n\nThrows exception in the event of failure to allocate."]
    pub fn fz_malloc(ctx: *mut fz_context, size: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = "Allocate array of memory of count entries of size bytes.<br>Clears the memory to zero.\n\nThrows exception in the event of failure to allocate."]
    pub fn fz_calloc(ctx: *mut fz_context, count: usize, size: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = "Reallocates a block of memory to given size. Existing contents<br>up to min\\(old_size,new_size\\) are maintained. The rest of the<br>block is uninitialised.\n\n[`fz_realloc`]\\(ctx, `NULL`, size\\) behaves like [`fz_malloc`]\\(ctx, size\\).\n\n[`fz_realloc`]\\(ctx, p, 0\\); behaves like [`fz_free`]\\(ctx, p\\).\n\nThrows exception in the event of failure to allocate."]
    pub fn fz_realloc(
        ctx: *mut fz_context,
        p: *mut ::core::ffi::c_void,
        size: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = "Free a previously allocated block of memory.\n\n[`fz_free`]\\(ctx, `NULL`\\) does nothing.\n\nNever throws exceptions."]
    pub fn fz_free(ctx: *mut fz_context, p: *mut ::core::ffi::c_void);
}
unsafe extern "C" {
    #[doc = "[`fz_malloc`] equivalent that returns `NULL` rather than throwing<br>exceptions."]
    pub fn fz_malloc_no_throw(ctx: *mut fz_context, size: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = "[`fz_calloc`] equivalent that returns `NULL` rather than throwing<br>exceptions."]
    pub fn fz_calloc_no_throw(
        ctx: *mut fz_context,
        count: usize,
        size: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = "[`fz_realloc`] equivalent that returns `NULL` rather than throwing<br>exceptions."]
    pub fn fz_realloc_no_throw(
        ctx: *mut fz_context,
        p: *mut ::core::ffi::c_void,
        size: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = "[`fz_malloc`] equivalent, except that the block is guaranteed aligned.<br>Block must be freed later using [`fz_free_align`](fz_free_align)ed."]
    pub fn fz_malloc_aligned(
        ctx: *mut fz_context,
        size: usize,
        align: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = "[`fz_free`] equivalent, for blocks allocated via [`fz_malloc_aligned`]."]
    pub fn fz_free_aligned(ctx: *mut fz_context, p: *mut ::core::ffi::c_void);
}
unsafe extern "C" {
    #[doc = "Portable strdup implementation, using fz allocators."]
    pub fn fz_strdup(
        ctx: *mut fz_context,
        s: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Fill block with len bytes of pseudo-randomness."]
    pub fn fz_memrnd(ctx: *mut fz_context, block: *mut u8, len: ::core::ffi::c_int);
}
#[repr(C)]
#[derive(Debug)]
pub struct fz_string {
    pub refs: ::core::ffi::c_int,
    pub str_: __IncompleteArrayField<::core::ffi::c_char>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_string"][::core::mem::size_of::<fz_string>() - 4usize];
    ["Alignment of fz_string"][::core::mem::align_of::<fz_string>() - 4usize];
    ["Offset of field: fz_string::refs"][::core::mem::offset_of!(fz_string, refs) - 0usize];
    ["Offset of field: fz_string::str_"][::core::mem::offset_of!(fz_string, str_) - 4usize];
};
unsafe extern "C" {
    pub fn fz_new_string(ctx: *mut fz_context, str_: *const ::core::ffi::c_char) -> *mut fz_string;
}
unsafe extern "C" {
    pub fn fz_keep_string(ctx: *mut fz_context, str_: *mut fz_string) -> *mut fz_string;
}
unsafe extern "C" {
    pub fn fz_drop_string(ctx: *mut fz_context, str_: *mut fz_string);
}
#[repr(C)]
#[repr(align(16))]
pub struct fz_context {
    pub _bindgen_opaque_blob: [u128; 4677usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_context"][::core::mem::size_of::<fz_context>() - 74832usize];
    ["Alignment of fz_context"][::core::mem::align_of::<fz_context>() - 16usize];
};
unsafe extern "C" {
    pub fn fz_new_context_imp(
        alloc: *const fz_alloc_context,
        locks: *const fz_locks_context,
        max_store: usize,
        version: *const ::core::ffi::c_char,
    ) -> *mut fz_context;
}
#[doc = "[`fz_buffer`] is a wrapper around a dynamically allocated array of<br>bytes.\n\nBuffers have a capacity \\(the number of bytes storage immediately<br>available\\) and a current size.\n\nThe contents of the structure are considered implementation<br>details and are subject to change. Users should use the accessor<br>functions in preference."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_buffer {
    pub refs: ::core::ffi::c_int,
    pub data: *mut ::core::ffi::c_uchar,
    pub cap: usize,
    pub len: usize,
    pub unused_bits: ::core::ffi::c_int,
    pub shared: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_buffer"][::core::mem::size_of::<fz_buffer>() - 40usize];
    ["Alignment of fz_buffer"][::core::mem::align_of::<fz_buffer>() - 8usize];
    ["Offset of field: fz_buffer::refs"][::core::mem::offset_of!(fz_buffer, refs) - 0usize];
    ["Offset of field: fz_buffer::data"][::core::mem::offset_of!(fz_buffer, data) - 8usize];
    ["Offset of field: fz_buffer::cap"][::core::mem::offset_of!(fz_buffer, cap) - 16usize];
    ["Offset of field: fz_buffer::len"][::core::mem::offset_of!(fz_buffer, len) - 24usize];
    ["Offset of field: fz_buffer::unused_bits"]
        [::core::mem::offset_of!(fz_buffer, unused_bits) - 32usize];
    ["Offset of field: fz_buffer::shared"][::core::mem::offset_of!(fz_buffer, shared) - 36usize];
};
unsafe extern "C" {
    #[doc = "Take an additional reference to the buffer. The same pointer<br>is returned.\n\nNever throws exceptions."]
    pub fn fz_keep_buffer(ctx: *mut fz_context, buf: *mut fz_buffer) -> *mut fz_buffer;
}
unsafe extern "C" {
    #[doc = "Drop a reference to the buffer. When the reference count reaches<br>zero, the buffer is destroyed.\n\nNever throws exceptions."]
    pub fn fz_drop_buffer(ctx: *mut fz_context, buf: *mut fz_buffer);
}
unsafe extern "C" {
    #[doc = "Retrieve internal memory of buffer.\n\n`datap`: Output parameter that will be pointed to the data.\n\nReturns the current size of the data in bytes."]
    pub fn fz_buffer_storage(
        ctx: *mut fz_context,
        buf: *mut fz_buffer,
        datap: *mut *mut ::core::ffi::c_uchar,
    ) -> usize;
}
unsafe extern "C" {
    #[doc = "Ensure that a buffer's data ends in a<br>0 byte, and return a pointer to it."]
    pub fn fz_string_from_buffer(
        ctx: *mut fz_context,
        buf: *mut fz_buffer,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn fz_new_buffer(ctx: *mut fz_context, capacity: usize) -> *mut fz_buffer;
}
unsafe extern "C" {
    #[doc = "Create a new buffer with existing data.\n\n`data`: Pointer to existing data.<br>`size`: Size of existing data.\n\nTakes ownership of data. Does not make a copy. Calls [`fz_free`] on<br>the data when the buffer is deallocated. Do not use 'data' after<br>passing to this function.\n\nReturns pointer to new buffer. Throws exception on allocation<br>failure."]
    pub fn fz_new_buffer_from_data(
        ctx: *mut fz_context,
        data: *mut ::core::ffi::c_uchar,
        size: usize,
    ) -> *mut fz_buffer;
}
unsafe extern "C" {
    #[doc = "Like [`fz_new_buffer`], but does not take ownership."]
    pub fn fz_new_buffer_from_shared_data(
        ctx: *mut fz_context,
        data: *const ::core::ffi::c_uchar,
        size: usize,
    ) -> *mut fz_buffer;
}
unsafe extern "C" {
    #[doc = "Create a new buffer containing a copy of the passed data."]
    pub fn fz_new_buffer_from_copied_data(
        ctx: *mut fz_context,
        data: *const ::core::ffi::c_uchar,
        size: usize,
    ) -> *mut fz_buffer;
}
unsafe extern "C" {
    #[doc = "Create a new buffer with printf formatted data."]
    pub fn fz_new_buffer_from_printf(
        ctx: *mut fz_context,
        fmt: *const ::core::ffi::c_char,
        ...
    ) -> *mut fz_buffer;
}
unsafe extern "C" {
    #[doc = "Make a new buffer, containing a copy of the data used in<br>the original."]
    pub fn fz_clone_buffer(ctx: *mut fz_context, buf: *mut fz_buffer) -> *mut fz_buffer;
}
unsafe extern "C" {
    #[doc = "Create a new buffer with data decoded from a base64 input string."]
    pub fn fz_new_buffer_from_base64(
        ctx: *mut fz_context,
        data: *const ::core::ffi::c_char,
        size: usize,
    ) -> *mut fz_buffer;
}
unsafe extern "C" {
    #[doc = "Ensure that a buffer has a given capacity,<br>truncating data if required.\n\n`capacity`: The desired capacity for the buffer. If the current<br>size of the buffer contents is smaller than capacity, it is<br>truncated."]
    pub fn fz_resize_buffer(ctx: *mut fz_context, buf: *mut fz_buffer, capacity: usize);
}
unsafe extern "C" {
    #[doc = "Make some space within a buffer \\(i.e. ensure that<br>capacity \\> size\\)."]
    pub fn fz_grow_buffer(ctx: *mut fz_context, buf: *mut fz_buffer);
}
unsafe extern "C" {
    #[doc = "Trim wasted capacity from a buffer by resizing internal memory."]
    pub fn fz_trim_buffer(ctx: *mut fz_context, buf: *mut fz_buffer);
}
unsafe extern "C" {
    #[doc = "Empties the buffer. Storage is not freed, but is held ready<br>to be reused as the buffer is refilled.\n\nNever throws exceptions."]
    pub fn fz_clear_buffer(ctx: *mut fz_context, buf: *mut fz_buffer);
}
unsafe extern "C" {
    #[doc = "Create a new buffer with a \\(subset of\\) the data from the buffer.\n\n`start`: if \\>= 0, offset from start of buffer, if \\< 0 offset from end of buffer.\n\n`end`: if \\>= 0, offset from start of buffer, if \\< 0 offset from end of buffer."]
    pub fn fz_slice_buffer(
        ctx: *mut fz_context,
        buf: *mut fz_buffer,
        start: i64,
        end: i64,
    ) -> *mut fz_buffer;
}
unsafe extern "C" {
    #[doc = "Append the contents of the source buffer onto the end of the<br>destination buffer, extending automatically as required.\n\nOwnership of buffers does not change."]
    pub fn fz_append_buffer(
        ctx: *mut fz_context,
        destination: *mut fz_buffer,
        source: *mut fz_buffer,
    );
}
unsafe extern "C" {
    #[doc = "Write a base64 encoded data block, optionally with periodic newlines."]
    pub fn fz_append_base64(
        ctx: *mut fz_context,
        out: *mut fz_buffer,
        data: *const ::core::ffi::c_uchar,
        size: usize,
        newline: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    #[doc = "Append a base64 encoded [`fz_buffer`], optionally with periodic newlines."]
    pub fn fz_append_base64_buffer(
        ctx: *mut fz_context,
        out: *mut fz_buffer,
        data: *mut fz_buffer,
        newline: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    #[doc = "`fz_append_*`: Append data to a buffer.\n\nThe buffer will automatically grow as required."]
    pub fn fz_append_data(
        ctx: *mut fz_context,
        buf: *mut fz_buffer,
        data: *const ::core::ffi::c_void,
        len: usize,
    );
}
unsafe extern "C" {
    pub fn fz_append_string(
        ctx: *mut fz_context,
        buf: *mut fz_buffer,
        data: *const ::core::ffi::c_char,
    );
}
unsafe extern "C" {
    pub fn fz_append_byte(ctx: *mut fz_context, buf: *mut fz_buffer, c: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn fz_append_rune(ctx: *mut fz_context, buf: *mut fz_buffer, c: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn fz_append_int32_le(ctx: *mut fz_context, buf: *mut fz_buffer, x: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn fz_append_int16_le(ctx: *mut fz_context, buf: *mut fz_buffer, x: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn fz_append_int32_be(ctx: *mut fz_context, buf: *mut fz_buffer, x: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn fz_append_int16_be(ctx: *mut fz_context, buf: *mut fz_buffer, x: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn fz_append_bits(
        ctx: *mut fz_context,
        buf: *mut fz_buffer,
        value: ::core::ffi::c_int,
        count: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn fz_append_bits_pad(ctx: *mut fz_context, buf: *mut fz_buffer);
}
unsafe extern "C" {
    #[doc = "[`fz_append_pdf_string`]: Append a string with PDF syntax quotes and<br>escapes.\n\nThe buffer will automatically grow as required."]
    pub fn fz_append_pdf_string(
        ctx: *mut fz_context,
        buffer: *mut fz_buffer,
        text: *const ::core::ffi::c_char,
    );
}
unsafe extern "C" {
    #[doc = "[`fz_append_printf`]: Format and append data to buffer using<br>printf-like formatting \\(see [`fz_vsnprintf`]\\).\n\nThe buffer will automatically grow as required."]
    pub fn fz_append_printf(
        ctx: *mut fz_context,
        buffer: *mut fz_buffer,
        fmt: *const ::core::ffi::c_char,
        ...
    );
}
unsafe extern "C" {
    #[doc = "Zero-terminate buffer in order to use as a C string.\n\nThis byte is invisible and does not affect the length of the<br>buffer as returned by [`fz_buffer_storage`]. The zero byte is<br>written *after* the data, and subsequent writes will overwrite<br>the terminating byte.\n\nSubsequent changes to the size of the buffer \\(such as by<br>[`fz_buffer_trim`], [`fz_buffer_grow`], [`fz_resize_buffer`], etc\\) may<br>invalidate this."]
    pub fn fz_terminate_buffer(ctx: *mut fz_context, buf: *mut fz_buffer);
}
unsafe extern "C" {
    #[doc = "Create an MD5 digest from buffer contents.\n\nNever throws exceptions."]
    pub fn fz_md5_buffer(
        ctx: *mut fz_context,
        buffer: *mut fz_buffer,
        digest: *mut ::core::ffi::c_uchar,
    );
}
unsafe extern "C" {
    #[doc = "Take ownership of buffer contents.\n\nPerforms the same task as [`fz_buffer_storage`], but ownership of<br>the data buffer returns with this call. The buffer is left<br>empty.\n\n`Note`: Bad things may happen if this is called on a buffer with<br>multiple references that is being used from multiple threads.\n\n`data`: Pointer to place to retrieve data pointer.\n\nReturns length of stream."]
    pub fn fz_buffer_extract(
        ctx: *mut fz_context,
        buf: *mut fz_buffer,
        data: *mut *mut ::core::ffi::c_uchar,
    ) -> usize;
}
unsafe extern "C" {
    #[doc = "Return strlen\\(s\\), if that is less than maxlen, or maxlen if<br>there is no null byte \\('\\0'\\) among the first maxlen bytes."]
    pub fn fz_strnlen(s: *const ::core::ffi::c_char, maxlen: usize) -> usize;
}
unsafe extern "C" {
    #[doc = "Given a pointer to a C string \\(or a pointer to `NULL`\\) break<br>it at the first occurrence of a delimiter char \\(from a given<br>set\\).\n\n`stringp`: Pointer to a C string pointer \\(or `NULL`\\). Updated on<br>exit to point to the first char of the string after the<br>delimiter that was found. The string pointed to by stringp will<br>be corrupted by this call \\(as the found delimiter will be<br>overwritten by 0\\).\n\n`delim`: A C string of acceptable delimiter characters.\n\nReturns a pointer to a C string containing the chars of stringp<br>up to the first delimiter char \\(or the end of the string\\), or<br>`NULL`."]
    pub fn fz_strsep(
        stringp: *mut *mut ::core::ffi::c_char,
        delim: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Copy at most n-1 chars of a string into a destination<br>buffer with null termination, returning the real length of the<br>initial string \\(excluding terminator\\).\n\n`dst`: Destination buffer, at least n bytes long.\n\n`src`: C string \\(non-`NULL`\\).\n\n`n`: Size of dst buffer in bytes.\n\nReturns the length \\(excluding terminator\\) of src."]
    pub fn fz_strlcpy(
        dst: *mut ::core::ffi::c_char,
        src: *const ::core::ffi::c_char,
        n: usize,
    ) -> usize;
}
unsafe extern "C" {
    #[doc = "Concatenate 2 strings, with a maximum length.\n\n`dst`: pointer to first string in a buffer of n bytes.\n\n`src`: pointer to string to concatenate.\n\n`n`: Size \\(in bytes\\) of buffer that dst is in.\n\nReturns the real length that a concatenated dst + src would have<br>been \\(not including terminator\\)."]
    pub fn fz_strlcat(
        dst: *mut ::core::ffi::c_char,
        src: *const ::core::ffi::c_char,
        n: usize,
    ) -> usize;
}
unsafe extern "C" {
    #[doc = "Safe strstr function.\n\n`haystack`: Where to look \\(may be `NULL`\\).\n\n`needled`: What to look for.\n\nReturns `NULL` if unmatched, or pointer to start of match."]
    pub fn fz_strstr(
        haystack: *const ::core::ffi::c_char,
        needle: *const ::core::ffi::c_char,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Safe case-insensitive strstr function. \\(Accepts UTF-8\\).\n\n`haystack`: Where to look \\(may be `NULL`\\).\n\n`needled`: What to look for.\n\nReturns `NULL` if unmatched, or pointer to start of match."]
    pub fn fz_strstrcase(
        haystack: *const ::core::ffi::c_char,
        needle: *const ::core::ffi::c_char,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Find the start of the first occurrence of the substring needle in haystack."]
    pub fn fz_memmem(
        haystack: *const ::core::ffi::c_void,
        haystacklen: usize,
        needle: *const ::core::ffi::c_void,
        needlelen: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = "extract the directory component from a path."]
    pub fn fz_dirname(
        dir: *mut ::core::ffi::c_char,
        path: *const ::core::ffi::c_char,
        dirsize: usize,
    );
}
unsafe extern "C" {
    #[doc = "Find the filename component in a path."]
    pub fn fz_basename(path: *const ::core::ffi::c_char) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "portable strverscmp\\(3\\) function"]
    pub fn fz_strverscmp(
        s1: *const ::core::ffi::c_char,
        s2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Like [`fz_decode_uri_component`] but in-place."]
    pub fn fz_urldecode(url: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Return a new string representing the unencoded version of the given URI.<br>This decodes all escape sequences except those that would result in a reserved<br>character that are part of the URI syntax \\(; / ? : @ & = + $ , #\\)."]
    pub fn fz_decode_uri(
        ctx: *mut fz_context,
        s: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Return a new string representing the unencoded version of the given URI component.<br>This decodes all escape sequences!"]
    pub fn fz_decode_uri_component(
        ctx: *mut fz_context,
        s: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Return a new string representing the provided string encoded as a URI."]
    pub fn fz_encode_uri(
        ctx: *mut fz_context,
        s: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Return a new string representing the provided string encoded as an URI component.<br>This also encodes the special reserved characters \\(; / ? : @ & = + $ , #\\)."]
    pub fn fz_encode_uri_component(
        ctx: *mut fz_context,
        s: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Return a new string representing the provided string encoded as an URI path name.<br>This also encodes the special reserved characters except /."]
    pub fn fz_encode_uri_pathname(
        ctx: *mut fz_context,
        s: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "create output file name using a template.\n\nIf the path contains %\\[0-9\\]*d, the first such pattern will be<br>replaced with the page number. If the template does not contain<br>such a pattern, the page number will be inserted before the<br>filename extension. If the template does not have a filename<br>extension, the page number will be added to the end."]
    pub fn fz_format_output_path(
        ctx: *mut fz_context,
        path: *mut ::core::ffi::c_char,
        size: usize,
        fmt: *const ::core::ffi::c_char,
        page: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    #[doc = "rewrite path to the shortest string that names the same path.\n\nEliminates multiple and trailing slashes, interprets \".\" and<br>\"..\". Overwrites the string in place."]
    pub fn fz_cleanname(name: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "rewrite path to the shortest string that names the same path.\n\nEliminates multiple and trailing slashes, interprets \".\" and<br>\"..\". Allocates a new string that the caller must free."]
    pub fn fz_cleanname_strdup(
        ctx: *mut fz_context,
        name: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Resolve a path to an absolute file name.<br>The resolved path buffer must be of at least PATH_MAX size."]
    pub fn fz_realpath(
        path: *const ::core::ffi::c_char,
        resolved_path: *mut ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Case insensitive \\(UTF8\\) string comparison."]
    pub fn fz_strcasecmp(
        a: *const ::core::ffi::c_char,
        b: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Case insensitive \\(UTF8\\) string comparison.\n\nn = maximum number of bytes to read from either a or b."]
    pub fn fz_strncasecmp(
        a: *const ::core::ffi::c_char,
        b: *const ::core::ffi::c_char,
        n: usize,
    ) -> ::core::ffi::c_int;
}
pub const FZ_UTFMAX: _bindgen_ty_3 = 4;
#[doc = "[`FZ_UTFMAX`]: Maximum number of bytes in a decoded rune \\(maximum<br>length returned by [`fz_chartorune`]\\)."]
pub type _bindgen_ty_3 = ::core::ffi::c_int;
unsafe extern "C" {
    #[doc = "UTF8 decode a single rune from a sequence of chars.\n\n`rune`: Pointer to an int to assign the decoded 'rune' to.<br>\\(0xFFFD on error\\).\n\n`str`: Pointer to a UTF8 encoded string.\n\nReturns the number of bytes consumed."]
    pub fn fz_chartorune(
        rune: *mut ::core::ffi::c_int,
        str_: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "UTF8 decode a single rune from a sequence of chars<br>of given length.\n\n`rune`: Pointer to an int to assign the decoded 'rune' to.<br>\\(0xFFFD on error\\).\n\n`str`: Pointer to a UTF8 encoded string.\n\n`n`: The number of bytes available at str.\n\nReturns the number of bytes consumed."]
    pub fn fz_chartorunen(
        rune: *mut ::core::ffi::c_int,
        str_: *const ::core::ffi::c_char,
        n: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "UTF8 encode a rune to a sequence of chars.\n\n`str`: Pointer to a place to put the UTF8 encoded character.\n\n`rune`: Pointer to a 'rune'.\n\nReturns the number of bytes the rune took to output."]
    pub fn fz_runetochar(
        str_: *mut ::core::ffi::c_char,
        rune: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Count how many chars are required to represent a rune.\n\n`rune`: The rune to encode.\n\nReturns the number of bytes required to represent this run in<br>UTF8."]
    pub fn fz_runelen(rune: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Compute the index of a rune in a string.\n\n`str`: Pointer to beginning of a string.\n\n`p`: Pointer to a char in str.\n\nReturns the index of the rune pointed to by p in str."]
    pub fn fz_runeidx(
        str_: *const ::core::ffi::c_char,
        p: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Obtain a pointer to the char representing the rune<br>at a given index.\n\n`str`: Pointer to beginning of a string.\n\n`idx`: Index of a rune to return a char pointer to.\n\nReturns a pointer to the char where the desired rune starts,<br>or `NULL` if the string ends before the index is reached."]
    pub fn fz_runeptr(
        str_: *const ::core::ffi::c_char,
        idx: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Count how many runes the UTF-8 encoded string<br>consists of.\n\n`s`: The UTF-8 encoded, NUL-terminated text string.\n\nReturns the number of runes in the string."]
    pub fn fz_utflen(s: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_utf8_from_wchar(ctx: *mut fz_context, s: *const wchar_t) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn fz_wchar_from_utf8(
        ctx: *mut fz_context,
        path: *const ::core::ffi::c_char,
    ) -> *mut wchar_t;
}
unsafe extern "C" {
    #[doc = "Locale-independent decimal to binary conversion. On overflow<br>return \\(-\\)INFINITY and set errno to ERANGE. On underflow return<br>0 and set errno to ERANGE. Special inputs \\(case insensitive\\):<br>\"NAN\", \"INF\" or \"INFINITY\"."]
    pub fn fz_strtof(s: *const ::core::ffi::c_char, es: *mut *mut ::core::ffi::c_char) -> f32;
}
unsafe extern "C" {
    pub fn fz_grisu(
        f: f32,
        s: *mut ::core::ffi::c_char,
        exp: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Check and parse string into page ranges:<br>/,?\\(-?\\d+|N\\)\\(-\\(-?\\d+|N\\)\\)?/"]
    pub fn fz_is_page_range(
        ctx: *mut fz_context,
        s: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_parse_page_range(
        ctx: *mut fz_context,
        s: *const ::core::ffi::c_char,
        a: *mut ::core::ffi::c_int,
        b: *mut ::core::ffi::c_int,
        n: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Unicode aware tolower and toupper functions."]
    pub fn fz_tolower(c: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_toupper(c: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Return true if the named file exists and is readable."]
    pub fn fz_file_exists(
        ctx: *mut fz_context,
        path: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Open the named file and wrap it in a stream.\n\n`filename`: Path to a file. On non-Windows machines the filename<br>should be exactly as it would be passed to fopen\\(2\\). On Windows<br>machines, the path should be UTF-8 encoded so that non-ASCII<br>characters can be represented. Other platforms do the encoding<br>as standard anyway \\(and in most cases, particularly for MacOS<br>and Linux, the encoding they use is UTF-8 anyway\\)."]
    pub fn fz_open_file(
        ctx: *mut fz_context,
        filename: *const ::core::ffi::c_char,
    ) -> *mut fz_stream;
}
unsafe extern "C" {
    #[doc = "Do the same as [`fz_open_file`], but delete the file upon close."]
    pub fn fz_open_file_autodelete(
        ctx: *mut fz_context,
        filename: *const ::core::ffi::c_char,
    ) -> *mut fz_stream;
}
unsafe extern "C" {
    #[doc = "Open the named file and wrap it in a stream.\n\nDoes the same as [`fz_open_file`], but in the event the file<br>does not open, it will return `NULL` rather than throw an<br>exception."]
    pub fn fz_try_open_file(
        ctx: *mut fz_context,
        name: *const ::core::ffi::c_char,
    ) -> *mut fz_stream;
}
unsafe extern "C" {
    #[doc = "Open the named file and wrap it in a stream.\n\nThis function is only available when compiling for Win32.\n\n`filename`: Wide character path to the file as it would be given<br>to _wfopen\\(\\)."]
    pub fn fz_open_file_w(ctx: *mut fz_context, filename: *const wchar_t) -> *mut fz_stream;
}
unsafe extern "C" {
    #[doc = "Return the filename \\(UTF-8 encoded\\) from which a stream was opened.\n\nReturns `NULL` if the filename is not available \\(or the stream was<br>opened from a source other than a file\\)."]
    pub fn fz_stream_filename(
        ctx: *mut fz_context,
        stm: *mut fz_stream,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Open a block of memory as a stream.\n\n`data`: Pointer to start of data block. Ownership of the data<br>block is NOT passed in.\n\n`len`: Number of bytes in data block.\n\nReturns pointer to newly created stream. May throw exceptions on<br>failure to allocate."]
    pub fn fz_open_memory(
        ctx: *mut fz_context,
        data: *const ::core::ffi::c_uchar,
        len: usize,
    ) -> *mut fz_stream;
}
unsafe extern "C" {
    #[doc = "Open a buffer as a stream.\n\n`buf`: The buffer to open. Ownership of the buffer is NOT passed<br>in \\(this function takes its own reference\\).\n\nReturns pointer to newly created stream. May throw exceptions on<br>failure to allocate."]
    pub fn fz_open_buffer(ctx: *mut fz_context, buf: *mut fz_buffer) -> *mut fz_stream;
}
unsafe extern "C" {
    #[doc = "Attach a filter to a stream that will store any<br>characters read from the stream into the supplied buffer.\n\n`chain`: The underlying stream to leech from.\n\n`buf`: The buffer into which the read data should be appended.<br>The buffer will be resized as required.\n\nReturns pointer to newly created stream. May throw exceptions on<br>failure to allocate."]
    pub fn fz_open_leecher(
        ctx: *mut fz_context,
        chain: *mut fz_stream,
        buf: *mut fz_buffer,
    ) -> *mut fz_stream;
}
unsafe extern "C" {
    #[doc = "Increments the reference count for a stream. Returns the same<br>pointer.\n\nNever throws exceptions."]
    pub fn fz_keep_stream(ctx: *mut fz_context, stm: *mut fz_stream) -> *mut fz_stream;
}
unsafe extern "C" {
    #[doc = "Decrements the reference count for a stream.\n\nWhen the reference count for the stream hits zero, frees the<br>storage used for the [`fz_stream`] itself, and \\(usually\\)<br>releases the underlying resources that the stream is based upon<br>\\(depends on the method used to open the stream initially\\)."]
    pub fn fz_drop_stream(ctx: *mut fz_context, stm: *mut fz_stream);
}
unsafe extern "C" {
    #[doc = "return the current reading position within a stream"]
    pub fn fz_tell(ctx: *mut fz_context, stm: *mut fz_stream) -> i64;
}
unsafe extern "C" {
    #[doc = "Seek within a stream.\n\n`stm`: The stream to seek within.\n\n`offset`: The offset to seek to.\n\n`whence`: From where the offset is measured \\(see fseek\\).<br>SEEK_SET - start of stream.<br>SEEK_CUR - current position.<br>SEEK_END - end of stream."]
    pub fn fz_seek(
        ctx: *mut fz_context,
        stm: *mut fz_stream,
        offset: i64,
        whence: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    #[doc = "Read from a stream into a given data block.\n\n`stm`: The stream to read from.\n\n`data`: The data block to read into.\n\n`len`: The length of the data block \\(in bytes\\).\n\nReturns the number of bytes read. May throw exceptions."]
    pub fn fz_read(
        ctx: *mut fz_context,
        stm: *mut fz_stream,
        data: *mut ::core::ffi::c_uchar,
        len: usize,
    ) -> usize;
}
unsafe extern "C" {
    #[doc = "Read from a stream discarding data.\n\n`stm`: The stream to read from.\n\n`len`: The number of bytes to read.\n\nReturns the number of bytes read. May throw exceptions."]
    pub fn fz_skip(ctx: *mut fz_context, stm: *mut fz_stream, len: usize) -> usize;
}
unsafe extern "C" {
    #[doc = "Read all of a stream into a buffer.\n\n`stm`: The stream to read from\n\n`initial`: Suggested initial size for the buffer.\n\nReturns a buffer created from reading from the stream. May throw<br>exceptions on failure to allocate."]
    pub fn fz_read_all(ctx: *mut fz_context, stm: *mut fz_stream, initial: usize)
    -> *mut fz_buffer;
}
unsafe extern "C" {
    #[doc = "Read all the contents of a file into a buffer."]
    pub fn fz_read_file(
        ctx: *mut fz_context,
        filename: *const ::core::ffi::c_char,
    ) -> *mut fz_buffer;
}
unsafe extern "C" {
    #[doc = "Read all the contents of a file into a buffer.\n\nReturns `NULL` if the file does not exist, otherwise<br>behaves exactly as [`fz_read_file`]."]
    pub fn fz_try_read_file(
        ctx: *mut fz_context,
        filename: *const ::core::ffi::c_char,
    ) -> *mut fz_buffer;
}
unsafe extern "C" {
    #[doc = "[`fz_read_`]\\[u\\]int\\(16|24|32|64\\)\\(_le\\)?\n\nRead a 16/32/64 bit signed/unsigned integer from stream,<br>in big or little-endian byte orders.\n\nThrows an exception if EOF is encountered."]
    pub fn fz_read_uint16(ctx: *mut fz_context, stm: *mut fz_stream) -> u16;
}
unsafe extern "C" {
    pub fn fz_read_uint24(ctx: *mut fz_context, stm: *mut fz_stream) -> u32;
}
unsafe extern "C" {
    pub fn fz_read_uint32(ctx: *mut fz_context, stm: *mut fz_stream) -> u32;
}
unsafe extern "C" {
    pub fn fz_read_uint64(ctx: *mut fz_context, stm: *mut fz_stream) -> u64;
}
unsafe extern "C" {
    pub fn fz_read_uint16_le(ctx: *mut fz_context, stm: *mut fz_stream) -> u16;
}
unsafe extern "C" {
    pub fn fz_read_uint24_le(ctx: *mut fz_context, stm: *mut fz_stream) -> u32;
}
unsafe extern "C" {
    pub fn fz_read_uint32_le(ctx: *mut fz_context, stm: *mut fz_stream) -> u32;
}
unsafe extern "C" {
    pub fn fz_read_uint64_le(ctx: *mut fz_context, stm: *mut fz_stream) -> u64;
}
unsafe extern "C" {
    pub fn fz_read_int16(ctx: *mut fz_context, stm: *mut fz_stream) -> i16;
}
unsafe extern "C" {
    pub fn fz_read_int32(ctx: *mut fz_context, stm: *mut fz_stream) -> i32;
}
unsafe extern "C" {
    pub fn fz_read_int64(ctx: *mut fz_context, stm: *mut fz_stream) -> i64;
}
unsafe extern "C" {
    pub fn fz_read_int16_le(ctx: *mut fz_context, stm: *mut fz_stream) -> i16;
}
unsafe extern "C" {
    pub fn fz_read_int32_le(ctx: *mut fz_context, stm: *mut fz_stream) -> i32;
}
unsafe extern "C" {
    pub fn fz_read_int64_le(ctx: *mut fz_context, stm: *mut fz_stream) -> i64;
}
unsafe extern "C" {
    pub fn fz_read_float_le(ctx: *mut fz_context, stm: *mut fz_stream) -> f32;
}
unsafe extern "C" {
    pub fn fz_read_float(ctx: *mut fz_context, stm: *mut fz_stream) -> f32;
}
unsafe extern "C" {
    #[doc = "Read a null terminated string from the stream into<br>a buffer of a given length. The buffer will be null terminated.<br>Throws on failure \\(including the failure to fit the entire<br>string including the terminator into the buffer\\)."]
    pub fn fz_read_string(
        ctx: *mut fz_context,
        stm: *mut fz_stream,
        buffer: *mut ::core::ffi::c_char,
        len: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    #[doc = "Read a utf-8 rune from a stream.\n\nIn the event of encountering badly formatted utf-8 codes<br>\\(such as a leading code with an unexpected number of following<br>codes\\) no error/exception is given, but undefined values may be<br>returned."]
    pub fn fz_read_rune(ctx: *mut fz_context, in_: *mut fz_stream) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Read a utf-16 rune from a stream. \\(little endian and<br>big endian respectively\\).\n\nIn the event of encountering badly formatted utf-16 codes<br>\\(mismatched surrogates\\) no error/exception is given, but<br>undefined values may be returned."]
    pub fn fz_read_utf16_le(ctx: *mut fz_context, stm: *mut fz_stream) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_read_utf16_be(ctx: *mut fz_context, stm: *mut fz_stream) -> ::core::ffi::c_int;
}
#[doc = "A function type for use when implementing<br>[`fz_stream`](fz_stream)s. The supplied function of this type is called<br>whenever data is required, and the current buffer is empty.\n\n`stm`: The stream to operate on.\n\n`max`: a hint as to the maximum number of bytes that the caller<br>needs to be ready immediately. Can safely be ignored.\n\nReturns -1 if there is no more data in the stream. Otherwise,<br>the function should find its internal state using stm-\\>state,<br>refill its buffer, update stm-\\>rp and stm-\\>wp to point to the<br>start and end of the new data respectively, and then<br>\"return *stm-\\>rp++\"."]
pub type fz_stream_next_fn = ::core::option::Option<
    unsafe extern "C" fn(
        ctx: *mut fz_context,
        stm: *mut fz_stream,
        max: usize,
    ) -> ::core::ffi::c_int,
>;
#[doc = "A function type for use when implementing<br>[`fz_stream`](fz_stream)s. The supplied function of this type is called<br>when the stream is dropped, to release the stream specific<br>state information.\n\n`state`: The stream state to release."]
pub type fz_stream_drop_fn = ::core::option::Option<
    unsafe extern "C" fn(ctx: *mut fz_context, state: *mut ::core::ffi::c_void),
>;
#[doc = "A function type for use when implementing<br>[`fz_stream`](fz_stream)s. The supplied function of this type is called when<br>[`fz_seek`] is requested, and the arguments are as defined for<br>[`fz_seek`].\n\nThe stream can find it's private state in stm-\\>state."]
pub type fz_stream_seek_fn = ::core::option::Option<
    unsafe extern "C" fn(
        ctx: *mut fz_context,
        stm: *mut fz_stream,
        offset: i64,
        whence: ::core::ffi::c_int,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_stream {
    pub refs: ::core::ffi::c_int,
    pub error: ::core::ffi::c_int,
    pub eof: ::core::ffi::c_int,
    pub progressive: ::core::ffi::c_int,
    pub pos: i64,
    pub avail: ::core::ffi::c_int,
    pub bits: ::core::ffi::c_int,
    pub rp: *mut ::core::ffi::c_uchar,
    pub wp: *mut ::core::ffi::c_uchar,
    pub state: *mut ::core::ffi::c_void,
    pub next: fz_stream_next_fn,
    pub drop: fz_stream_drop_fn,
    pub seek: fz_stream_seek_fn,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_stream"][::core::mem::size_of::<fz_stream>() - 80usize];
    ["Alignment of fz_stream"][::core::mem::align_of::<fz_stream>() - 8usize];
    ["Offset of field: fz_stream::refs"][::core::mem::offset_of!(fz_stream, refs) - 0usize];
    ["Offset of field: fz_stream::error"][::core::mem::offset_of!(fz_stream, error) - 4usize];
    ["Offset of field: fz_stream::eof"][::core::mem::offset_of!(fz_stream, eof) - 8usize];
    ["Offset of field: fz_stream::progressive"]
        [::core::mem::offset_of!(fz_stream, progressive) - 12usize];
    ["Offset of field: fz_stream::pos"][::core::mem::offset_of!(fz_stream, pos) - 16usize];
    ["Offset of field: fz_stream::avail"][::core::mem::offset_of!(fz_stream, avail) - 24usize];
    ["Offset of field: fz_stream::bits"][::core::mem::offset_of!(fz_stream, bits) - 28usize];
    ["Offset of field: fz_stream::rp"][::core::mem::offset_of!(fz_stream, rp) - 32usize];
    ["Offset of field: fz_stream::wp"][::core::mem::offset_of!(fz_stream, wp) - 40usize];
    ["Offset of field: fz_stream::state"][::core::mem::offset_of!(fz_stream, state) - 48usize];
    ["Offset of field: fz_stream::next"][::core::mem::offset_of!(fz_stream, next) - 56usize];
    ["Offset of field: fz_stream::drop"][::core::mem::offset_of!(fz_stream, drop) - 64usize];
    ["Offset of field: fz_stream::seek"][::core::mem::offset_of!(fz_stream, seek) - 72usize];
};
unsafe extern "C" {
    #[doc = "Create a new stream object with the given<br>internal state and function pointers.\n\n`state`: Internal state \\(opaque to everything but implementation\\).\n\n`next`: Should provide the next set of bytes \\(up to max\\) of stream<br>data. Return the number of bytes read, or EOF when there is no<br>more data.\n\n`drop`: Should clean up and free the internal state. May not<br>throw exceptions."]
    pub fn fz_new_stream(
        ctx: *mut fz_context,
        state: *mut ::core::ffi::c_void,
        next: fz_stream_next_fn,
        drop: fz_stream_drop_fn,
    ) -> *mut fz_stream;
}
unsafe extern "C" {
    #[doc = "Attempt to read a stream into a buffer. If truncated<br>is `NULL` behaves as [`fz_read_all`], sets a truncated flag in case of<br>error.\n\n`stm`: The stream to read from.\n\n`initial`: Suggested initial size for the buffer.\n\n`truncated`: Flag to store success/failure indication in.\n\n`worst_case`: 0 for unknown, otherwise an upper bound for the<br>size of the stream.\n\nReturns a buffer created from reading from the stream."]
    pub fn fz_read_best(
        ctx: *mut fz_context,
        stm: *mut fz_stream,
        initial: usize,
        truncated: *mut ::core::ffi::c_int,
        worst_case: usize,
    ) -> *mut fz_buffer;
}
unsafe extern "C" {
    #[doc = "Read a line from stream into the buffer until either a<br>terminating newline or EOF, which it replaces with a null byte<br>\\('\\0'\\).\n\nReturns buf on success, and `NULL` when end of file occurs while<br>no characters have been read."]
    pub fn fz_read_line(
        ctx: *mut fz_context,
        stm: *mut fz_stream,
        buf: *mut ::core::ffi::c_char,
        max: usize,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Skip over a given string in a stream. Return 0 if successfully<br>skipped, non-zero otherwise. As many characters will be skipped<br>over as matched in the string."]
    pub fn fz_skip_string(
        ctx: *mut fz_context,
        stm: *mut fz_stream,
        str_: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Skip over whitespace \\(bytes \\<= 32\\) in a stream."]
    pub fn fz_skip_space(ctx: *mut fz_context, stm: *mut fz_stream);
}
unsafe extern "C" {
    #[doc = "Create a stream from a FILE * that will not be closed<br>when the stream is dropped."]
    pub fn fz_open_file_ptr_no_close(ctx: *mut fz_context, file: *mut FILE) -> *mut fz_stream;
}
#[doc = "A function type for use when implementing<br>[`fz_output`](fz_output)s. The supplied function of this type is called<br>whenever data is written to the output.\n\n`state`: The state for the output stream.\n\n`data`: a pointer to a buffer of data to write.\n\n`n`: The number of bytes of data to write."]
pub type fz_output_write_fn = ::core::option::Option<
    unsafe extern "C" fn(
        ctx: *mut fz_context,
        state: *mut ::core::ffi::c_void,
        data: *const ::core::ffi::c_void,
        n: usize,
    ),
>;
#[doc = "A function type for use when implementing<br>[`fz_output`](fz_output)s. The supplied function of this type is called when<br>[`fz_seek_output`] is requested.\n\n`state`: The output stream state to seek within.\n\n`offset`, `whence`: as defined for [`fz_seek`]\\(\\)."]
pub type fz_output_seek_fn = ::core::option::Option<
    unsafe extern "C" fn(
        ctx: *mut fz_context,
        state: *mut ::core::ffi::c_void,
        offset: i64,
        whence: ::core::ffi::c_int,
    ),
>;
#[doc = "A function type for use when implementing<br>[`fz_output`](fz_output)s. The supplied function of this type is called when<br>[`fz_tell_output`] is requested.\n\n`state`: The output stream state to report on.\n\nReturns the offset within the output stream."]
pub type fz_output_tell_fn = ::core::option::Option<
    unsafe extern "C" fn(ctx: *mut fz_context, state: *mut ::core::ffi::c_void) -> i64,
>;
#[doc = "A function type for use when implementing<br>[`fz_output`](fz_output)s. The supplied function of this type is called<br>when the output stream is closed, to flush any pending writes."]
pub type fz_output_close_fn = ::core::option::Option<
    unsafe extern "C" fn(ctx: *mut fz_context, state: *mut ::core::ffi::c_void),
>;
#[doc = "A function type for use when implementing<br>[`fz_output`](fz_output)s. The supplied function of this type is called<br>when the output stream is reset, and resets the state<br>to that when it was first initialised."]
pub type fz_output_reset_fn = ::core::option::Option<
    unsafe extern "C" fn(ctx: *mut fz_context, state: *mut ::core::ffi::c_void),
>;
#[doc = "A function type for use when implementing<br>[`fz_output`](fz_output)s. The supplied function of this type is called<br>when the output stream is dropped, to release the stream<br>specific state information."]
pub type fz_output_drop_fn = ::core::option::Option<
    unsafe extern "C" fn(ctx: *mut fz_context, state: *mut ::core::ffi::c_void),
>;
#[doc = "A function type for use when implementing<br>[`fz_output`](fz_output)s. The supplied function of this type is called<br>when the [`fz_stream_from_output`] is called."]
pub type fz_stream_from_output_fn = ::core::option::Option<
    unsafe extern "C" fn(ctx: *mut fz_context, state: *mut ::core::ffi::c_void) -> *mut fz_stream,
>;
#[doc = "A function type for use when implementing<br>[`fz_output`](fz_output)s. The supplied function of this type is called<br>when [`fz_truncate_output`] is called to truncate the file<br>at that point."]
pub type fz_truncate_fn = ::core::option::Option<
    unsafe extern "C" fn(ctx: *mut fz_context, state: *mut ::core::ffi::c_void),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_output {
    pub state: *mut ::core::ffi::c_void,
    pub write: fz_output_write_fn,
    pub seek: fz_output_seek_fn,
    pub tell: fz_output_tell_fn,
    pub close: fz_output_close_fn,
    pub drop: fz_output_drop_fn,
    pub reset: fz_output_reset_fn,
    pub as_stream: fz_stream_from_output_fn,
    pub truncate: fz_truncate_fn,
    pub closed: ::core::ffi::c_int,
    pub bp: *mut ::core::ffi::c_char,
    pub wp: *mut ::core::ffi::c_char,
    pub ep: *mut ::core::ffi::c_char,
    pub buffered: ::core::ffi::c_int,
    pub bits: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_output"][::core::mem::size_of::<fz_output>() - 112usize];
    ["Alignment of fz_output"][::core::mem::align_of::<fz_output>() - 8usize];
    ["Offset of field: fz_output::state"][::core::mem::offset_of!(fz_output, state) - 0usize];
    ["Offset of field: fz_output::write"][::core::mem::offset_of!(fz_output, write) - 8usize];
    ["Offset of field: fz_output::seek"][::core::mem::offset_of!(fz_output, seek) - 16usize];
    ["Offset of field: fz_output::tell"][::core::mem::offset_of!(fz_output, tell) - 24usize];
    ["Offset of field: fz_output::close"][::core::mem::offset_of!(fz_output, close) - 32usize];
    ["Offset of field: fz_output::drop"][::core::mem::offset_of!(fz_output, drop) - 40usize];
    ["Offset of field: fz_output::reset"][::core::mem::offset_of!(fz_output, reset) - 48usize];
    ["Offset of field: fz_output::as_stream"]
        [::core::mem::offset_of!(fz_output, as_stream) - 56usize];
    ["Offset of field: fz_output::truncate"]
        [::core::mem::offset_of!(fz_output, truncate) - 64usize];
    ["Offset of field: fz_output::closed"][::core::mem::offset_of!(fz_output, closed) - 72usize];
    ["Offset of field: fz_output::bp"][::core::mem::offset_of!(fz_output, bp) - 80usize];
    ["Offset of field: fz_output::wp"][::core::mem::offset_of!(fz_output, wp) - 88usize];
    ["Offset of field: fz_output::ep"][::core::mem::offset_of!(fz_output, ep) - 96usize];
    ["Offset of field: fz_output::buffered"]
        [::core::mem::offset_of!(fz_output, buffered) - 104usize];
    ["Offset of field: fz_output::bits"][::core::mem::offset_of!(fz_output, bits) - 108usize];
};
unsafe extern "C" {
    #[doc = "Create a new output object with the given<br>internal state and function pointers.\n\n`state`: Internal state \\(opaque to everything but implementation\\).\n\n`write`: Function to output a given buffer.\n\n`close`: Cleanup function to destroy state when output closed.<br>May permissibly be null."]
    pub fn fz_new_output(
        ctx: *mut fz_context,
        bufsiz: ::core::ffi::c_int,
        state: *mut ::core::ffi::c_void,
        write: fz_output_write_fn,
        close: fz_output_close_fn,
        drop: fz_output_drop_fn,
    ) -> *mut fz_output;
}
unsafe extern "C" {
    #[doc = "Open an output stream that writes to a<br>given path. This stream will always be a binary stream.\n\nOn Windows, if this stream is stdout or stderr, these will<br>be set to binary.\n\n`filename`: The filename to write to \\(specified in UTF-8\\).\n\n`append`: non-zero if we should append to the file, rather than<br>overwriting it."]
    pub fn fz_new_output_with_path(
        arg1: *mut fz_context,
        filename: *const ::core::ffi::c_char,
        append: ::core::ffi::c_int,
    ) -> *mut fz_output;
}
unsafe extern "C" {
    #[doc = "Open an output stream that writes to a<br>given FILE *.\n\n`file`: The file pointers to write to. `NULL` is interpreted as effectively<br>meaning /dev/null or similar."]
    pub fn fz_new_output_with_file_ptr(ctx: *mut fz_context, file: *mut FILE) -> *mut fz_output;
}
unsafe extern "C" {
    #[doc = "Open an output stream that appends<br>to a buffer.\n\n`buf`: The buffer to append to."]
    pub fn fz_new_output_with_buffer(ctx: *mut fz_context, buf: *mut fz_buffer) -> *mut fz_output;
}
unsafe extern "C" {
    #[doc = "Retrieve an [`fz_output`] that directs to stdout.\n\nOptionally may be [`fz_dropp`](fz_dropp)ed when finished with."]
    pub fn fz_stdout(ctx: *mut fz_context) -> *mut fz_output;
}
unsafe extern "C" {
    #[doc = "Retrieve an [`fz_output`] that directs to stdout.\n\nOptionally may be [`fz_dropp`](fz_dropp)ed when finished with."]
    pub fn fz_stderr(ctx: *mut fz_context) -> *mut fz_output;
}
unsafe extern "C" {
    #[doc = "Retrieve an [`fz_output`] that directs to OutputDebugString.\n\nOptionally may be [`fz_dropp`](fz_dropp)ed when finished with."]
    pub fn fz_stdods(ctx: *mut fz_context) -> *mut fz_output;
}
unsafe extern "C" {
    #[doc = "Set the output stream to be used for [`fz_stddbg`]. Set to `NULL` to<br>reset to default \\(stderr\\)."]
    pub fn fz_set_stddbg(ctx: *mut fz_context, out: *mut fz_output);
}
unsafe extern "C" {
    #[doc = "Retrieve an [`fz_output`] for the default debugging stream. On<br>Windows this will be OutputDebugString for non-console apps.<br>Otherwise, it is always [`fz_stderr`].\n\nOptionally may be [`fz_dropp`](fz_dropp)ed when finished with."]
    pub fn fz_stddbg(ctx: *mut fz_context) -> *mut fz_output;
}
unsafe extern "C" {
    #[doc = "Format and write data to an output stream.<br>See [`fz_format_string`] for formatting details."]
    pub fn fz_write_printf(
        ctx: *mut fz_context,
        out: *mut fz_output,
        fmt: *const ::core::ffi::c_char,
        ...
    );
}
unsafe extern "C" {
    #[doc = "Seek to the specified file position.<br>See fseek for arguments.\n\nThrow an error on unseekable outputs."]
    pub fn fz_seek_output(
        ctx: *mut fz_context,
        out: *mut fz_output,
        off: i64,
        whence: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    #[doc = "Return the current file position.\n\nThrow an error on untellable outputs."]
    pub fn fz_tell_output(ctx: *mut fz_context, out: *mut fz_output) -> i64;
}
unsafe extern "C" {
    #[doc = "Flush unwritten data."]
    pub fn fz_flush_output(ctx: *mut fz_context, out: *mut fz_output);
}
unsafe extern "C" {
    #[doc = "Flush pending output and close an output stream."]
    pub fn fz_close_output(arg1: *mut fz_context, arg2: *mut fz_output);
}
unsafe extern "C" {
    #[doc = "Reset a closed output stream. Returns state to<br>\\(broadly\\) that which it was in when opened. Not<br>all outputs can be reset, so this may throw an<br>exception."]
    pub fn fz_reset_output(arg1: *mut fz_context, arg2: *mut fz_output);
}
unsafe extern "C" {
    #[doc = "Free an output stream. Don't forget to close it first!"]
    pub fn fz_drop_output(arg1: *mut fz_context, arg2: *mut fz_output);
}
unsafe extern "C" {
    #[doc = "Query whether a given [`fz_output`] supports [`fz_stream_from_output`]."]
    pub fn fz_output_supports_stream(
        ctx: *mut fz_context,
        out: *mut fz_output,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Obtain the [`fz_output`] in the form of a [`fz_stream`].\n\nThis allows data to be read back from some forms of [`fz_output`]<br>object. When finished reading, the [`fz_stream`] should be released<br>by calling [`fz_drop_stream`]. Until the [`fz_stream`] is dropped, no<br>further operations should be performed on the [`fz_output`] object."]
    pub fn fz_stream_from_output(arg1: *mut fz_context, arg2: *mut fz_output) -> *mut fz_stream;
}
unsafe extern "C" {
    #[doc = "Truncate the output at the current position.\n\nThis allows output streams which have seeked back from the end<br>of their storage to be truncated at the current point."]
    pub fn fz_truncate_output(arg1: *mut fz_context, arg2: *mut fz_output);
}
unsafe extern "C" {
    #[doc = "Write data to output.\n\n`data`: Pointer to data to write.<br>`size`: Size of data to write in bytes."]
    pub fn fz_write_data(
        ctx: *mut fz_context,
        out: *mut fz_output,
        data: *const ::core::ffi::c_void,
        size: usize,
    );
}
unsafe extern "C" {
    pub fn fz_write_buffer(ctx: *mut fz_context, out: *mut fz_output, data: *mut fz_buffer);
}
unsafe extern "C" {
    #[doc = "Write a string. Does not write zero terminator."]
    pub fn fz_write_string(
        ctx: *mut fz_context,
        out: *mut fz_output,
        s: *const ::core::ffi::c_char,
    );
}
unsafe extern "C" {
    #[doc = "Write different sized data to an output stream."]
    pub fn fz_write_int32_be(ctx: *mut fz_context, out: *mut fz_output, x: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn fz_write_int32_le(ctx: *mut fz_context, out: *mut fz_output, x: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn fz_write_uint32_be(ctx: *mut fz_context, out: *mut fz_output, x: ::core::ffi::c_uint);
}
unsafe extern "C" {
    pub fn fz_write_uint32_le(ctx: *mut fz_context, out: *mut fz_output, x: ::core::ffi::c_uint);
}
unsafe extern "C" {
    pub fn fz_write_int16_be(ctx: *mut fz_context, out: *mut fz_output, x: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn fz_write_int16_le(ctx: *mut fz_context, out: *mut fz_output, x: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn fz_write_uint16_be(ctx: *mut fz_context, out: *mut fz_output, x: ::core::ffi::c_uint);
}
unsafe extern "C" {
    pub fn fz_write_uint16_le(ctx: *mut fz_context, out: *mut fz_output, x: ::core::ffi::c_uint);
}
unsafe extern "C" {
    pub fn fz_write_char(ctx: *mut fz_context, out: *mut fz_output, x: ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn fz_write_byte(ctx: *mut fz_context, out: *mut fz_output, x: ::core::ffi::c_uchar);
}
unsafe extern "C" {
    pub fn fz_write_float_be(ctx: *mut fz_context, out: *mut fz_output, f: f32);
}
unsafe extern "C" {
    pub fn fz_write_float_le(ctx: *mut fz_context, out: *mut fz_output, f: f32);
}
unsafe extern "C" {
    #[doc = "Write a UTF-8 encoded unicode character."]
    pub fn fz_write_rune(ctx: *mut fz_context, out: *mut fz_output, rune: ::core::ffi::c_int);
}
unsafe extern "C" {
    #[doc = "Write a base64 encoded data block, optionally with periodic<br>newlines."]
    pub fn fz_write_base64(
        ctx: *mut fz_context,
        out: *mut fz_output,
        data: *const ::core::ffi::c_uchar,
        size: usize,
        newline: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    #[doc = "Write a base64 encoded [`fz_buffer`], optionally with periodic<br>newlines."]
    pub fn fz_write_base64_buffer(
        ctx: *mut fz_context,
        out: *mut fz_output,
        data: *mut fz_buffer,
        newline: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    #[doc = "Write num_bits of data to the end of the output stream, assumed to be packed<br>most significant bits first."]
    pub fn fz_write_bits(
        ctx: *mut fz_context,
        out: *mut fz_output,
        data: ::core::ffi::c_uint,
        num_bits: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    #[doc = "Sync to byte boundary after writing bits."]
    pub fn fz_write_bits_sync(ctx: *mut fz_context, out: *mut fz_output);
}
unsafe extern "C" {
    #[doc = "Copy the stream contents to the output."]
    pub fn fz_write_stream(ctx: *mut fz_context, out: *mut fz_output, in_: *mut fz_stream);
}
unsafe extern "C" {
    #[doc = "The non va_list equivalent of [`fz_vsnprintf`]."]
    pub fn fz_snprintf(
        buffer: *mut ::core::ffi::c_char,
        space: usize,
        fmt: *const ::core::ffi::c_char,
        ...
    ) -> usize;
}
unsafe extern "C" {
    #[doc = "Allocated sprintf.\n\nReturns a null terminated allocated block containing the<br>formatted version of the format string/args."]
    pub fn fz_asprintf(
        ctx: *mut fz_context,
        fmt: *const ::core::ffi::c_char,
        ...
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Save the contents of a buffer to a file."]
    pub fn fz_save_buffer(
        ctx: *mut fz_context,
        buf: *mut fz_buffer,
        filename: *const ::core::ffi::c_char,
    );
}
unsafe extern "C" {
    #[doc = "Compression and other filtering outputs.\n\nThese outputs write encoded data to another output. Create a<br>filter output with the destination, write to the filter, then<br>close and drop it when you're done. These can also be chained<br>together, for example to write ASCII Hex encoded, Deflate<br>compressed, and RC4 encrypted data to a buffer output.\n\nOutput streams don't use reference counting, so make sure to<br>close all of the filters in the reverse order of creation so<br>that data is flushed properly.\n\nAccordingly, ownership of 'chain' is never passed into the<br>following functions, but remains with the caller, whose<br>responsibility it is to ensure they exist at least until<br>the returned [`fz_output`] is dropped."]
    pub fn fz_new_asciihex_output(ctx: *mut fz_context, chain: *mut fz_output) -> *mut fz_output;
}
unsafe extern "C" {
    pub fn fz_new_ascii85_output(ctx: *mut fz_context, chain: *mut fz_output) -> *mut fz_output;
}
unsafe extern "C" {
    pub fn fz_new_rle_output(ctx: *mut fz_context, chain: *mut fz_output) -> *mut fz_output;
}
unsafe extern "C" {
    pub fn fz_new_arc4_output(
        ctx: *mut fz_context,
        chain: *mut fz_output,
        key: *mut ::core::ffi::c_uchar,
        keylen: usize,
    ) -> *mut fz_output;
}
unsafe extern "C" {
    pub fn fz_new_deflate_output(
        ctx: *mut fz_context,
        chain: *mut fz_output,
        effort: ::core::ffi::c_int,
        raw: ::core::ffi::c_int,
    ) -> *mut fz_output;
}
unsafe extern "C" {
    pub fn fz_is_valid_xml_char(c: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_range_limit_xml_char(c: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_is_valid_xml_string(s: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Output a line to the log."]
    pub fn fz_log(ctx: *mut fz_context, fmt: *const ::core::ffi::c_char, ...);
}
unsafe extern "C" {
    #[doc = "Output a line to the log for a given module."]
    pub fn fz_log_module(
        ctx: *mut fz_context,
        module: *const ::core::ffi::c_char,
        fmt: *const ::core::ffi::c_char,
        ...
    );
}
unsafe extern "C" {
    #[doc = "Internal function to actually do the opening of the logfile.\n\nCaller should close/drop the output when finished with it."]
    pub fn fz_new_log_for_module(
        ctx: *mut fz_context,
        module: *const ::core::ffi::c_char,
    ) -> *mut fz_output;
}
#[doc = "Structure definition is public to enable stack<br>based allocation. Do not access the members directly."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_md5 {
    pub lo: u32,
    pub hi: u32,
    pub a: u32,
    pub b: u32,
    pub c: u32,
    pub d: u32,
    pub buffer: [::core::ffi::c_uchar; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_md5"][::core::mem::size_of::<fz_md5>() - 88usize];
    ["Alignment of fz_md5"][::core::mem::align_of::<fz_md5>() - 4usize];
    ["Offset of field: fz_md5::lo"][::core::mem::offset_of!(fz_md5, lo) - 0usize];
    ["Offset of field: fz_md5::hi"][::core::mem::offset_of!(fz_md5, hi) - 4usize];
    ["Offset of field: fz_md5::a"][::core::mem::offset_of!(fz_md5, a) - 8usize];
    ["Offset of field: fz_md5::b"][::core::mem::offset_of!(fz_md5, b) - 12usize];
    ["Offset of field: fz_md5::c"][::core::mem::offset_of!(fz_md5, c) - 16usize];
    ["Offset of field: fz_md5::d"][::core::mem::offset_of!(fz_md5, d) - 20usize];
    ["Offset of field: fz_md5::buffer"][::core::mem::offset_of!(fz_md5, buffer) - 24usize];
};
unsafe extern "C" {
    #[doc = "MD5 initialization. Begins an MD5 operation, writing a new<br>context.\n\nNever throws an exception."]
    pub fn fz_md5_init(state: *mut fz_md5);
}
unsafe extern "C" {
    #[doc = "MD5 block update operation. Continues an MD5 message-digest<br>operation, processing another message block, and updating the<br>context.\n\nNever throws an exception."]
    pub fn fz_md5_update(state: *mut fz_md5, input: *const ::core::ffi::c_uchar, inlen: usize);
}
unsafe extern "C" {
    #[doc = "MD5 block update operation. Continues an MD5 message-digest<br>operation, processing an int64, and updating the context.\n\nNever throws an exception."]
    pub fn fz_md5_update_int64(state: *mut fz_md5, i: i64);
}
unsafe extern "C" {
    #[doc = "MD5 finalization. Ends an MD5 message-digest operation, writing<br>the message digest and zeroizing the context.\n\nNever throws an exception."]
    pub fn fz_md5_final(state: *mut fz_md5, digest: *mut ::core::ffi::c_uchar);
}
#[doc = "Structure definition is public to enable stack<br>based allocation. Do not access the members directly."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct fz_sha256 {
    pub state: [::core::ffi::c_uint; 8usize],
    pub count: [::core::ffi::c_uint; 2usize],
    pub buffer: fz_sha256__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union fz_sha256__bindgen_ty_1 {
    pub u8_: [::core::ffi::c_uchar; 64usize],
    pub u32_: [::core::ffi::c_uint; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_sha256__bindgen_ty_1"]
        [::core::mem::size_of::<fz_sha256__bindgen_ty_1>() - 64usize];
    ["Alignment of fz_sha256__bindgen_ty_1"]
        [::core::mem::align_of::<fz_sha256__bindgen_ty_1>() - 4usize];
    ["Offset of field: fz_sha256__bindgen_ty_1::u8_"]
        [::core::mem::offset_of!(fz_sha256__bindgen_ty_1, u8_) - 0usize];
    ["Offset of field: fz_sha256__bindgen_ty_1::u32_"]
        [::core::mem::offset_of!(fz_sha256__bindgen_ty_1, u32_) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_sha256"][::core::mem::size_of::<fz_sha256>() - 104usize];
    ["Alignment of fz_sha256"][::core::mem::align_of::<fz_sha256>() - 4usize];
    ["Offset of field: fz_sha256::state"][::core::mem::offset_of!(fz_sha256, state) - 0usize];
    ["Offset of field: fz_sha256::count"][::core::mem::offset_of!(fz_sha256, count) - 32usize];
    ["Offset of field: fz_sha256::buffer"][::core::mem::offset_of!(fz_sha256, buffer) - 40usize];
};
unsafe extern "C" {
    #[doc = "SHA256 initialization. Begins an SHA256 operation, initialising<br>the supplied context.\n\nNever throws an exception."]
    pub fn fz_sha256_init(state: *mut fz_sha256);
}
unsafe extern "C" {
    #[doc = "SHA256 block update operation. Continues an SHA256 message-<br>digest operation, processing another message block, and updating<br>the context.\n\nNever throws an exception."]
    pub fn fz_sha256_update(
        state: *mut fz_sha256,
        input: *const ::core::ffi::c_uchar,
        inlen: usize,
    );
}
unsafe extern "C" {
    #[doc = "MD5 finalization. Ends an MD5 message-digest operation, writing<br>the message digest and zeroizing the context.\n\nNever throws an exception."]
    pub fn fz_sha256_final(state: *mut fz_sha256, digest: *mut ::core::ffi::c_uchar);
}
#[doc = "Structure definition is public to enable stack<br>based allocation. Do not access the members directly."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct fz_sha512 {
    pub state: [u64; 8usize],
    pub count: [::core::ffi::c_uint; 2usize],
    pub buffer: fz_sha512__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union fz_sha512__bindgen_ty_1 {
    pub u8_: [::core::ffi::c_uchar; 128usize],
    pub u64_: [u64; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_sha512__bindgen_ty_1"]
        [::core::mem::size_of::<fz_sha512__bindgen_ty_1>() - 128usize];
    ["Alignment of fz_sha512__bindgen_ty_1"]
        [::core::mem::align_of::<fz_sha512__bindgen_ty_1>() - 8usize];
    ["Offset of field: fz_sha512__bindgen_ty_1::u8_"]
        [::core::mem::offset_of!(fz_sha512__bindgen_ty_1, u8_) - 0usize];
    ["Offset of field: fz_sha512__bindgen_ty_1::u64_"]
        [::core::mem::offset_of!(fz_sha512__bindgen_ty_1, u64_) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_sha512"][::core::mem::size_of::<fz_sha512>() - 200usize];
    ["Alignment of fz_sha512"][::core::mem::align_of::<fz_sha512>() - 8usize];
    ["Offset of field: fz_sha512::state"][::core::mem::offset_of!(fz_sha512, state) - 0usize];
    ["Offset of field: fz_sha512::count"][::core::mem::offset_of!(fz_sha512, count) - 64usize];
    ["Offset of field: fz_sha512::buffer"][::core::mem::offset_of!(fz_sha512, buffer) - 72usize];
};
unsafe extern "C" {
    #[doc = "SHA512 initialization. Begins an SHA512 operation, initialising<br>the supplied context.\n\nNever throws an exception."]
    pub fn fz_sha512_init(state: *mut fz_sha512);
}
unsafe extern "C" {
    #[doc = "SHA512 block update operation. Continues an SHA512 message-<br>digest operation, processing another message block, and updating<br>the context.\n\nNever throws an exception."]
    pub fn fz_sha512_update(
        state: *mut fz_sha512,
        input: *const ::core::ffi::c_uchar,
        inlen: usize,
    );
}
unsafe extern "C" {
    #[doc = "SHA512 finalization. Ends an SHA512 message-digest operation,<br>writing the message digest and zeroizing the context.\n\nNever throws an exception."]
    pub fn fz_sha512_final(state: *mut fz_sha512, digest: *mut ::core::ffi::c_uchar);
}
#[doc = "Structure definition is public to enable stack<br>based allocation. Do not access the members directly."]
pub type fz_sha384 = fz_sha512;
unsafe extern "C" {
    #[doc = "SHA384 initialization. Begins an SHA384 operation, initialising<br>the supplied context.\n\nNever throws an exception."]
    pub fn fz_sha384_init(state: *mut fz_sha384);
}
unsafe extern "C" {
    #[doc = "SHA384 block update operation. Continues an SHA384 message-<br>digest operation, processing another message block, and updating<br>the context.\n\nNever throws an exception."]
    pub fn fz_sha384_update(
        state: *mut fz_sha384,
        input: *const ::core::ffi::c_uchar,
        inlen: usize,
    );
}
unsafe extern "C" {
    #[doc = "SHA384 finalization. Ends an SHA384 message-digest operation,<br>writing the message digest and zeroizing the context.\n\nNever throws an exception."]
    pub fn fz_sha384_final(state: *mut fz_sha384, digest: *mut ::core::ffi::c_uchar);
}
#[doc = "Structure definition is public to enable stack<br>based allocation. Do not access the members directly."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_arc4 {
    pub x: ::core::ffi::c_uint,
    pub y: ::core::ffi::c_uint,
    pub state: [::core::ffi::c_uchar; 256usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_arc4"][::core::mem::size_of::<fz_arc4>() - 264usize];
    ["Alignment of fz_arc4"][::core::mem::align_of::<fz_arc4>() - 4usize];
    ["Offset of field: fz_arc4::x"][::core::mem::offset_of!(fz_arc4, x) - 0usize];
    ["Offset of field: fz_arc4::y"][::core::mem::offset_of!(fz_arc4, y) - 4usize];
    ["Offset of field: fz_arc4::state"][::core::mem::offset_of!(fz_arc4, state) - 8usize];
};
unsafe extern "C" {
    #[doc = "RC4 initialization. Begins an RC4 operation, writing a new<br>context.\n\nNever throws an exception."]
    pub fn fz_arc4_init(state: *mut fz_arc4, key: *const ::core::ffi::c_uchar, len: usize);
}
unsafe extern "C" {
    #[doc = "RC4 block encrypt operation; encrypt src into dst \\(both of<br>length len\\) updating the RC4 state as we go.\n\nNever throws an exception."]
    pub fn fz_arc4_encrypt(
        state: *mut fz_arc4,
        dest: *mut ::core::ffi::c_uchar,
        src: *const ::core::ffi::c_uchar,
        len: usize,
    );
}
unsafe extern "C" {
    #[doc = "RC4 finalization. Zero the context.\n\nNever throws an exception."]
    pub fn fz_arc4_final(state: *mut fz_arc4);
}
#[doc = "Structure definitions are public to enable stack<br>based allocation. Do not access the members directly."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_aes {
    pub nr: ::core::ffi::c_int,
    pub rk: *mut u32,
    pub buf: [u32; 68usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_aes"][::core::mem::size_of::<fz_aes>() - 288usize];
    ["Alignment of fz_aes"][::core::mem::align_of::<fz_aes>() - 8usize];
    ["Offset of field: fz_aes::nr"][::core::mem::offset_of!(fz_aes, nr) - 0usize];
    ["Offset of field: fz_aes::rk"][::core::mem::offset_of!(fz_aes, rk) - 8usize];
    ["Offset of field: fz_aes::buf"][::core::mem::offset_of!(fz_aes, buf) - 16usize];
};
unsafe extern "C" {
    #[doc = "AES encryption initialization. Fills in the supplied context<br>and prepares for encryption using the given key.\n\nReturns non-zero for error \\(key size other than 128/192/256\\).\n\nNever throws an exception."]
    pub fn fz_aes_setkey_enc(
        ctx: *mut fz_aes,
        key: *const ::core::ffi::c_uchar,
        keysize: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "AES decryption initialization. Fills in the supplied context<br>and prepares for decryption using the given key.\n\nReturns non-zero for error \\(key size other than 128/192/256\\).\n\nNever throws an exception."]
    pub fn fz_aes_setkey_dec(
        ctx: *mut fz_aes,
        key: *const ::core::ffi::c_uchar,
        keysize: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "AES block processing. Encrypts or Decrypts \\(according to mode,<br>which must match what was initially set up\\) length bytes \\(which<br>must be a multiple of 16\\), using \\(and modifying\\) the insertion<br>vector iv, reading from input, and writing to output.\n\nNever throws an exception."]
    pub fn fz_aes_crypt_cbc(
        ctx: *mut fz_aes,
        mode: ::core::ffi::c_int,
        length: usize,
        iv: *mut ::core::ffi::c_uchar,
        input: *const ::core::ffi::c_uchar,
        output: *mut ::core::ffi::c_uchar,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_getopt_long_options {
    pub option: *mut ::core::ffi::c_char,
    pub flag: *mut ::core::ffi::c_int,
    pub opaque: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_getopt_long_options"][::core::mem::size_of::<fz_getopt_long_options>() - 24usize];
    ["Alignment of fz_getopt_long_options"]
        [::core::mem::align_of::<fz_getopt_long_options>() - 8usize];
    ["Offset of field: fz_getopt_long_options::option"]
        [::core::mem::offset_of!(fz_getopt_long_options, option) - 0usize];
    ["Offset of field: fz_getopt_long_options::flag"]
        [::core::mem::offset_of!(fz_getopt_long_options, flag) - 8usize];
    ["Offset of field: fz_getopt_long_options::opaque"]
        [::core::mem::offset_of!(fz_getopt_long_options, opaque) - 16usize];
};
unsafe extern "C" {
    #[doc = "Simple functions/variables for use in tools.\n\nostr = option string. Comprises single letter options, followed by : if there<br>is an argument to the option.\n\n`longopts`: `NULL` \\(indicating no long options\\), or a pointer to an array of<br>longoptions, terminated by an entry with option == `NULL`.\n\nIn the event of matching a single char option, this function will normally<br>return the char. The exception to this is when the option requires an<br>argument and none is supplied; in this case we return ':'.\n\nIn the event of matching a long option, this function returns 0, with [`fz_optlong`]<br>set to point to the matching option.\n\nA long option entry may be followed with : to indicate there is an argument to the<br>option. If the need for an argument is specified in this way, and no argument is<br>given, an error will be displayed and argument processing will stop. If an argument<br>is given, and the long option record contains a non-null flag pointer, then the code<br>will decode the argument and fill in that flag pointer. Specifically,<br>case-insensitive matches to 'yes', 'no', 'true' and 'false' will cause a value of 0<br>or 1 as appropriate to be written; failing this the arg will be interpreted as a<br>decimal integer using atoi.\n\nA long option entry may be followed by an list of options \\(e.g. myoption=foo|bar|baz\\)<br>and the option will be passed to [`fz_opt_from_list`]. The return value of that will be<br>placed in [`fz_optitem`]. If the return value of that function is -1, then an error will<br>be displayed and argument processing will stop.\n\nIn the event of reaching the end of the arg list or '--', this function returns EOF.\n\nIn the event of failing to match anything, an error is printed, and we return '?'.\n\nIf an argument is expected for the option, then [`fz_optarg`] will be returned pointing<br>at the start of the argument. Examples of supported argument formats: '-r500', '-r 500',<br>'--resolution 500', '--resolution=500'."]
    pub fn fz_getopt_long(
        nargc: ::core::ffi::c_int,
        nargv: *const *mut ::core::ffi::c_char,
        ostr: *const ::core::ffi::c_char,
        longopts: *const fz_getopt_long_options,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Identical to [`fz_getopt_long`], but with a `NULL` longopts field, signifying no long<br>options."]
    pub fn fz_getopt(
        nargc: ::core::ffi::c_int,
        nargv: *const *mut ::core::ffi::c_char,
        ostr: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "[`fz_optind`] is updated to point to the current index being read from the<br>arguments."]
    pub static mut fz_optind: ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "[`fz_optarg`] is a pointer to the argument data for the most recently<br>read option."]
    pub static mut fz_optarg: *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "[`fz_optlong`] is a pointer to the record for the most recently<br>read long option. \\(i.e. if a long option is detected, this<br>will be set to point to the record for that option, otherwise<br>it will be `NULL`\\)."]
    pub static mut fz_optlong: *const fz_getopt_long_options;
}
unsafe extern "C" {
    #[doc = "The item number for the most recently matched item list.\n\nFirst item in the list is numbered 0. No match is -1."]
    pub static mut fz_optitem: ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Return the index of a \\(case-insensitive\\) option within an optlist.\n\nFor instance for optlist = \"Foo|Bar|Baz\", and  opt = \"bar\",<br>this would return 1.\n\nIf the optlist ends with \"|*\" then that is a catch all case and<br>matches all options allowing the caller to process it itself.<br>[`fz_optarg`] will be set to point to the option, and the return<br>value will be the index of the '*' option within that list.\n\nIf an optlist entry ends with ':' \\(e.g. \"Foo:\"\\) then that option<br>may have suboptions appended to it \\(for example \"JPG:80\"\\) and<br>[`fz_optarg`] will be set to point at \"80\". Otherwise [`fz_optarg`] will<br>be set to `NULL`.\n\nIn the event of no-match found, prints an error and returns -1."]
    pub fn fz_opt_from_list(
        opt: *mut ::core::ffi::c_char,
        optlist: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Convert \"-\" to \"/dev/stdout\" for use with command lines.<br>Also converts \"nul\" and \"con\" on Windows."]
    pub fn fz_optpath(opt: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_hash_table {
    _unused: [u8; 0],
}
#[doc = "Function type called when a hash table entry is dropped.\n\nOnly used when the entire hash table is dropped."]
pub type fz_hash_table_drop_fn = ::core::option::Option<
    unsafe extern "C" fn(ctx: *mut fz_context, val: *mut ::core::ffi::c_void),
>;
unsafe extern "C" {
    #[doc = "Create a new hash table.\n\n`initialsize`: The initial size of the hashtable. The hashtable<br>may grow \\(double in size\\) if it starts to get crowded \\(80%<br>full\\).\n\n`keylen`: byte length for each key.\n\n`lock`: -1 for no lock, otherwise the [`FZ_LOCK`] to use to protect<br>this table.\n\n`drop_val`: Function to use to destroy values on table drop."]
    pub fn fz_new_hash_table(
        ctx: *mut fz_context,
        initialsize: ::core::ffi::c_int,
        keylen: ::core::ffi::c_int,
        lock: ::core::ffi::c_int,
        drop_val: fz_hash_table_drop_fn,
    ) -> *mut fz_hash_table;
}
unsafe extern "C" {
    #[doc = "Destroy the hash table.\n\nValues are dropped using the drop function."]
    pub fn fz_drop_hash_table(ctx: *mut fz_context, table: *mut fz_hash_table);
}
unsafe extern "C" {
    #[doc = "Search for a matching hash within the table, and return the<br>associated value."]
    pub fn fz_hash_find(
        ctx: *mut fz_context,
        table: *mut fz_hash_table,
        key: *const ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = "Insert a new key/value pair into the hash table.\n\nIf an existing entry with the same key is found, no change is<br>made to the hash table, and a pointer to the existing value is<br>returned.\n\nIf no existing entry with the same key is found, ownership of<br>val passes in, key is copied, and `NULL` is returned."]
    pub fn fz_hash_insert(
        ctx: *mut fz_context,
        table: *mut fz_hash_table,
        key: *const ::core::ffi::c_void,
        val: *mut ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = "Remove the entry for a given key.\n\nThe value is NOT freed, so the caller is expected to take care<br>of this."]
    pub fn fz_hash_remove(
        ctx: *mut fz_context,
        table: *mut fz_hash_table,
        key: *const ::core::ffi::c_void,
    );
}
#[doc = "Callback function called on each key/value pair in the hash<br>table, when [`fz_hash_for_each`] is run."]
pub type fz_hash_table_for_each_fn = ::core::option::Option<
    unsafe extern "C" fn(
        ctx: *mut fz_context,
        state: *mut ::core::ffi::c_void,
        key: *mut ::core::ffi::c_void,
        keylen: ::core::ffi::c_int,
        val: *mut ::core::ffi::c_void,
    ),
>;
unsafe extern "C" {
    #[doc = "Iterate over the entries in a hash table."]
    pub fn fz_hash_for_each(
        ctx: *mut fz_context,
        table: *mut fz_hash_table,
        state: *mut ::core::ffi::c_void,
        callback: fz_hash_table_for_each_fn,
    );
}
#[doc = "Callback function called on each key/value pair in the hash<br>table, when [`fz_hash_filter`] is run to remove entries where the<br>callback returns true."]
pub type fz_hash_table_filter_fn = ::core::option::Option<
    unsafe extern "C" fn(
        ctx: *mut fz_context,
        state: *mut ::core::ffi::c_void,
        key: *mut ::core::ffi::c_void,
        keylen: ::core::ffi::c_int,
        val: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int,
>;
unsafe extern "C" {
    #[doc = "Iterate over the entries in a hash table, removing all the ones where callback returns true.<br>Does NOT free the value of the entry, so the caller is expected to take care of this."]
    pub fn fz_hash_filter(
        ctx: *mut fz_context,
        table: *mut fz_hash_table,
        state: *mut ::core::ffi::c_void,
        callback: fz_hash_table_filter_fn,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_pool {
    _unused: [u8; 0],
}
unsafe extern "C" {
    #[doc = "Create a new pool to allocate from."]
    pub fn fz_new_pool(ctx: *mut fz_context) -> *mut fz_pool;
}
unsafe extern "C" {
    #[doc = "Allocate a block of size bytes from the pool."]
    pub fn fz_pool_alloc(
        ctx: *mut fz_context,
        pool: *mut fz_pool,
        size: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = "strdup equivalent allocating from the pool."]
    pub fn fz_pool_strdup(
        ctx: *mut fz_context,
        pool: *mut fz_pool,
        s: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "The current size of the pool.\n\nThe number of bytes of storage currently allocated to the pool.<br>This is the total of the storage used for the blocks making<br>up the pool, rather then total of the allocated blocks so far,<br>so it will increase in 'lumps'.<br>from the pool, then the pool size may still be X"]
    pub fn fz_pool_size(ctx: *mut fz_context, pool: *mut fz_pool) -> usize;
}
unsafe extern "C" {
    #[doc = "Drop a pool, freeing and invalidating all storage returned from<br>the pool."]
    pub fn fz_drop_pool(ctx: *mut fz_context, pool: *mut fz_pool);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_pool_array {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn fz_new_pool_array_imp(
        ctx: *mut fz_context,
        pool: *mut fz_pool,
        size: usize,
        initial: usize,
    ) -> *mut fz_pool_array;
}
unsafe extern "C" {
    #[doc = "Append an element to the end of the array.\n\nReturns a pointer to the new element \\(initially all 0's\\), and<br>\\(optionally\\) the index of that element."]
    pub fn fz_pool_array_append(
        ctx: *mut fz_context,
        arr: *mut fz_pool_array,
        idx: *mut usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = "Lookup an element in the array."]
    pub fn fz_pool_array_lookup(
        ctx: *mut fz_context,
        arr: *mut fz_pool_array,
        idx: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = "Get the length of the array."]
    pub fn fz_pool_array_len(ctx: *mut fz_context, arr: *mut fz_pool_array) -> usize;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_tree {
    _unused: [u8; 0],
}
unsafe extern "C" {
    #[doc = "Look for the value of a node in the tree with the given key.\n\nSimple pointer equivalence is used for key.\n\nReturns `NULL` for no match."]
    pub fn fz_tree_lookup(
        ctx: *mut fz_context,
        node: *mut fz_tree,
        key: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = "Insert a new key/value pair and rebalance the tree.<br>Return the new root of the tree after inserting and rebalancing.<br>May be called with a `NULL` root to create a new tree.\n\nNo data is copied into the tree structure; key and value are<br>merely kept as pointers."]
    pub fn fz_tree_insert(
        ctx: *mut fz_context,
        root: *mut fz_tree,
        key: *const ::core::ffi::c_char,
        value: *mut ::core::ffi::c_void,
    ) -> *mut fz_tree;
}
unsafe extern "C" {
    #[doc = "Drop the tree.\n\nThe storage used by the tree is freed, and each value has<br>dropfunc called on it."]
    pub fn fz_drop_tree(
        ctx: *mut fz_context,
        node: *mut fz_tree,
        dropfunc: ::core::option::Option<
            unsafe extern "C" fn(ctx: *mut fz_context, value: *mut ::core::ffi::c_void),
        >,
    );
}
pub const FZ_BIDI_LTR: fz_bidi_direction = 0;
pub const FZ_BIDI_RTL: fz_bidi_direction = 1;
pub const FZ_BIDI_NEUTRAL: fz_bidi_direction = 2;
pub const FZ_BIDI_UNSET: fz_bidi_direction = 3;
pub type fz_bidi_direction = ::core::ffi::c_int;
pub const FZ_BIDI_CLASSIFY_WHITE_SPACE: fz_bidi_flags = 1;
pub const FZ_BIDI_REPLACE_TAB: fz_bidi_flags = 2;
pub type fz_bidi_flags = ::core::ffi::c_int;
#[doc = "Prototype for callback function supplied to [`fz_bidi_fragment_text`].\n# Arguments\n* \tfragment\tfirst character in fragment\n* \tfragmentLen\tnumber of characters in fragment\n* \tbidiLevel\tThe bidirectional level for this text.<br>The bottom bit will be set iff block<br>should concatenate with other blocks as<br>right-to-left\n* \tscript\t\tthe script in use for this fragment \\(other<br>than common or inherited\\)\n* \targ\t\tdata from caller of Bidi_fragmentText"]
pub type fz_bidi_fragment_fn = ::core::option::Option<
    unsafe extern "C" fn(
        fragment: *const u32,
        fragmentLen: usize,
        bidiLevel: ::core::ffi::c_int,
        script: ::core::ffi::c_int,
        arg: *mut ::core::ffi::c_void,
    ),
>;
unsafe extern "C" {
    #[doc = "Partitions the given Unicode sequence into one or more<br>unidirectional fragments and invokes the given callback<br>function for each fragment.\n\nFor example, if directionality of text is:<br>0123456789<br>rrlllrrrrr,<br>we'll invoke callback with:<br>&text\\[0\\], length == 2<br>&text\\[2\\], length == 3<br>&text\\[5\\], length == 5\n# Arguments\n* \\[in\\] text\tstart of Unicode sequence\n* \\[in\\] textlen   number of Unicodes to analyse\n* \\[in\\] baseDir   direction of paragraph \\(specify [`FZ_BIDI_NEUTRAL`] to force auto-detection\\)\n* \\[in\\] callback  function to be called for each fragment\n* \\[in\\] arg\tdata to be passed to the callback function\n* \\[in\\] flags     flags to control operation \\(see [`fz_bidi_flags`] above\\)"]
    pub fn fz_bidi_fragment_text(
        ctx: *mut fz_context,
        text: *const u32,
        textlen: usize,
        baseDir: *mut fz_bidi_direction,
        callback: fz_bidi_fragment_fn,
        arg: *mut ::core::ffi::c_void,
        flags: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    #[doc = "Open a zip or tar archive\n\nOpen a file and identify its archive type based on the archive<br>signature contained inside.\n\n`filename`: a path to a file as it would be given to open\\(2\\)."]
    pub fn fz_open_archive(
        ctx: *mut fz_context,
        filename: *const ::core::ffi::c_char,
    ) -> *mut fz_archive;
}
unsafe extern "C" {
    #[doc = "Open zip or tar archive stream.\n\nOpen an archive using a seekable stream object rather than<br>opening a file or directory on disk."]
    pub fn fz_open_archive_with_stream(
        ctx: *mut fz_context,
        file: *mut fz_stream,
    ) -> *mut fz_archive;
}
unsafe extern "C" {
    #[doc = "Open zip or tar archive stream.\n\nDoes the same as [`fz_open_archive_with_stream`], but will not throw<br>an error in the event of failing to recognise the format. Will<br>still throw errors in other cases though!"]
    pub fn fz_try_open_archive_with_stream(
        ctx: *mut fz_context,
        file: *mut fz_stream,
    ) -> *mut fz_archive;
}
unsafe extern "C" {
    #[doc = "Open a directory as if it was an archive.\n\nA special case where a directory is opened as if it was an<br>archive.\n\nNote that for directories it is not possible to retrieve the<br>number of entries or list the entries. It is however possible<br>to check if the archive has a particular entry.\n\n`path`: a path to a directory as it would be given to opendir\\(3\\)."]
    pub fn fz_open_directory(
        ctx: *mut fz_context,
        path: *const ::core::ffi::c_char,
    ) -> *mut fz_archive;
}
unsafe extern "C" {
    #[doc = "Determine if a given path is a directory.\n\nIn the case of the path not existing, or having no access<br>we will return 0."]
    pub fn fz_is_directory(
        ctx: *mut fz_context,
        path: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Drop a reference to an archive.\n\nWhen the last reference is dropped, this closes and releases<br>any memory or filehandles associated with the archive."]
    pub fn fz_drop_archive(ctx: *mut fz_context, arch: *mut fz_archive);
}
unsafe extern "C" {
    #[doc = "Keep a reference to an archive."]
    pub fn fz_keep_archive(ctx: *mut fz_context, arch: *mut fz_archive) -> *mut fz_archive;
}
unsafe extern "C" {
    #[doc = "Return a pointer to a string describing the format of the<br>archive.\n\nThe lifetime of the string is unspecified \\(in current<br>implementations the string will persist until the archive<br>is closed, but this is not guaranteed\\)."]
    pub fn fz_archive_format(
        ctx: *mut fz_context,
        arch: *mut fz_archive,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Number of entries in archive.\n\nWill always return a value \\>= 0.\n\nMay throw an exception if this type of archive cannot count the<br>entries \\(such as a directory\\)."]
    pub fn fz_count_archive_entries(
        ctx: *mut fz_context,
        arch: *mut fz_archive,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Get listed name of entry position idx.\n\n`idx`: Must be a value \\>= 0 \\< return value from<br>[`fz_count_archive_entries`]. If not in range `NULL` will be<br>returned.\n\nMay throw an exception if this type of archive cannot list the<br>entries \\(such as a directory\\)."]
    pub fn fz_list_archive_entry(
        ctx: *mut fz_context,
        arch: *mut fz_archive,
        idx: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Check if entry by given name exists.\n\nIf named entry does not exist 0 will be returned, if it does<br>exist 1 is returned.\n\n`name`: Entry name to look for, this must be an exact match to<br>the entry name in the archive."]
    pub fn fz_has_archive_entry(
        ctx: *mut fz_context,
        arch: *mut fz_archive,
        name: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Opens an archive entry as a stream.\n\n`name`: Entry name to look for, this must be an exact match to<br>the entry name in the archive.\n\nThrows an exception if a matching entry cannot be found."]
    pub fn fz_open_archive_entry(
        ctx: *mut fz_context,
        arch: *mut fz_archive,
        name: *const ::core::ffi::c_char,
    ) -> *mut fz_stream;
}
unsafe extern "C" {
    #[doc = "Opens an archive entry as a stream.\n\nReturns `NULL` if a matching entry cannot be found, otherwise<br>behaves exactly as [`fz_open_archive_entry`]."]
    pub fn fz_try_open_archive_entry(
        ctx: *mut fz_context,
        arch: *mut fz_archive,
        name: *const ::core::ffi::c_char,
    ) -> *mut fz_stream;
}
unsafe extern "C" {
    #[doc = "Reads all bytes in an archive entry<br>into a buffer.\n\n`name`: Entry name to look for, this must be an exact match to<br>the entry name in the archive.\n\nThrows an exception if a matching entry cannot be found."]
    pub fn fz_read_archive_entry(
        ctx: *mut fz_context,
        arch: *mut fz_archive,
        name: *const ::core::ffi::c_char,
    ) -> *mut fz_buffer;
}
unsafe extern "C" {
    #[doc = "Reads all bytes in an archive entry<br>into a buffer.\n\n`name`: Entry name to look for, this must be an exact match to<br>the entry name in the archive.\n\nReturns `NULL` if a matching entry cannot be found. Otherwise behaves<br>the same as [`fz_read_archive_entry`]. Exceptions may be thrown."]
    pub fn fz_try_read_archive_entry(
        ctx: *mut fz_context,
        arch: *mut fz_archive,
        name: *const ::core::ffi::c_char,
    ) -> *mut fz_buffer;
}
unsafe extern "C" {
    #[doc = "Detect if stream object is a tar archive.\n\nAssumes that the stream object is seekable."]
    pub fn fz_is_tar_archive(ctx: *mut fz_context, file: *mut fz_stream) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Detect if stream object is an archive supported by libarchive.\n\nAssumes that the stream object is seekable."]
    pub fn fz_is_libarchive_archive(
        ctx: *mut fz_context,
        file: *mut fz_stream,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Detect if stream object is a cfb archive.\n\nAssumes that the stream object is seekable."]
    pub fn fz_is_cfb_archive(ctx: *mut fz_context, file: *mut fz_stream) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Open a tar archive file.\n\nAn exception is thrown if the file is not a tar archive as<br>indicated by the presence of a tar signature.\n\n`filename`: a path to a tar archive file as it would be given to<br>open\\(2\\)."]
    pub fn fz_open_tar_archive(
        ctx: *mut fz_context,
        filename: *const ::core::ffi::c_char,
    ) -> *mut fz_archive;
}
unsafe extern "C" {
    #[doc = "Open a tar archive stream.\n\nOpen an archive using a seekable stream object rather than<br>opening a file or directory on disk.\n\nAn exception is thrown if the stream is not a tar archive as<br>indicated by the presence of a tar signature."]
    pub fn fz_open_tar_archive_with_stream(
        ctx: *mut fz_context,
        file: *mut fz_stream,
    ) -> *mut fz_archive;
}
unsafe extern "C" {
    #[doc = "Open an archive using libarchive.\n\nAn exception is thrown if the file is not supported by libarchive.\n\n`filename`: a path to an archive file as it would be given to<br>open\\(2\\)."]
    pub fn fz_open_libarchive_archive(
        ctx: *mut fz_context,
        filename: *const ::core::ffi::c_char,
    ) -> *mut fz_archive;
}
unsafe extern "C" {
    #[doc = "Open an archive using libarchive.\n\nOpen an archive using a seekable stream object rather than<br>opening a file or directory on disk.\n\nAn exception is thrown if the stream is not supported by libarchive."]
    pub fn fz_open_libarchive_archive_with_stream(
        ctx: *mut fz_context,
        file: *mut fz_stream,
    ) -> *mut fz_archive;
}
unsafe extern "C" {
    #[doc = "Open a cfb file as an archive.\n\nAn exception is thrown if the file is not recognised as a cfb.\n\n`filename`: a path to an archive file as it would be given to<br>open\\(2\\)."]
    pub fn fz_open_cfb_archive(
        ctx: *mut fz_context,
        filename: *const ::core::ffi::c_char,
    ) -> *mut fz_archive;
}
unsafe extern "C" {
    #[doc = "Open a cfb file as an archive.\n\nOpen an archive using a seekable stream object rather than<br>opening a file or directory on disk.\n\nAn exception is thrown if the file is not recognised as a chm."]
    pub fn fz_open_cfb_archive_with_stream(
        ctx: *mut fz_context,
        file: *mut fz_stream,
    ) -> *mut fz_archive;
}
unsafe extern "C" {
    #[doc = "Detect if stream object is a zip archive.\n\nAssumes that the stream object is seekable."]
    pub fn fz_is_zip_archive(ctx: *mut fz_context, file: *mut fz_stream) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Open a zip archive file.\n\nAn exception is thrown if the file is not a zip archive as<br>indicated by the presence of a zip signature.\n\n`filename`: a path to a zip archive file as it would be given to<br>open\\(2\\)."]
    pub fn fz_open_zip_archive(
        ctx: *mut fz_context,
        path: *const ::core::ffi::c_char,
    ) -> *mut fz_archive;
}
unsafe extern "C" {
    #[doc = "Open a zip archive stream.\n\nOpen an archive using a seekable stream object rather than<br>opening a file or directory on disk.\n\nAn exception is thrown if the stream is not a zip archive as<br>indicated by the presence of a zip signature."]
    pub fn fz_open_zip_archive_with_stream(
        ctx: *mut fz_context,
        file: *mut fz_stream,
    ) -> *mut fz_archive;
}
unsafe extern "C" {
    #[doc = "Open a zip archive from static data."]
    pub fn fz_open_zip_archive_with_memory(
        ctx: *mut fz_context,
        data: *const ::core::ffi::c_uchar,
        size: usize,
    ) -> *mut fz_archive;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_zip_writer {
    _unused: [u8; 0],
}
unsafe extern "C" {
    #[doc = "Create a new zip writer that writes to a given file.\n\nOpen an archive using a seekable stream object rather than<br>opening a file or directory on disk."]
    pub fn fz_new_zip_writer(
        ctx: *mut fz_context,
        filename: *const ::core::ffi::c_char,
    ) -> *mut fz_zip_writer;
}
unsafe extern "C" {
    #[doc = "Create a new zip writer that writes to a given output stream.\n\nOwnership of out passes in immediately upon calling this function.<br>The caller should never drop the [`fz_output`], even if this function throws<br>an exception."]
    pub fn fz_new_zip_writer_with_output(
        ctx: *mut fz_context,
        out: *mut fz_output,
    ) -> *mut fz_zip_writer;
}
unsafe extern "C" {
    #[doc = "Given a buffer of data, \\(optionally\\) compress it, and add it to<br>the zip file with the given name."]
    pub fn fz_write_zip_entry(
        ctx: *mut fz_context,
        zip: *mut fz_zip_writer,
        name: *const ::core::ffi::c_char,
        buf: *mut fz_buffer,
        compress: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    #[doc = "Close the zip file for writing.\n\nThis flushes any pending data to the file. This can throw<br>exceptions."]
    pub fn fz_close_zip_writer(ctx: *mut fz_context, zip: *mut fz_zip_writer);
}
unsafe extern "C" {
    #[doc = "Drop the reference to the zipfile.\n\nIn common with other 'drop' methods, this will never throw an<br>exception."]
    pub fn fz_drop_zip_writer(ctx: *mut fz_context, zip: *mut fz_zip_writer);
}
unsafe extern "C" {
    #[doc = "Create an archive that holds named buffers.\n\ntree can either be a preformed tree with [`fz_buffer`](fz_buffer)s as values,<br>or it can be `NULL` for an empty tree."]
    pub fn fz_new_tree_archive(ctx: *mut fz_context, tree: *mut fz_tree) -> *mut fz_archive;
}
unsafe extern "C" {
    #[doc = "Add a named buffer to an existing tree archive.\n\nThe tree will take a new reference to the buffer. Ownership<br>is not transferred."]
    pub fn fz_tree_archive_add_buffer(
        ctx: *mut fz_context,
        arch_: *mut fz_archive,
        name: *const ::core::ffi::c_char,
        buf: *mut fz_buffer,
    );
}
unsafe extern "C" {
    #[doc = "Add a named block of data to an existing tree archive.\n\nThe data will be copied into a buffer, and so the caller<br>may free it as soon as this returns."]
    pub fn fz_tree_archive_add_data(
        ctx: *mut fz_context,
        arch_: *mut fz_archive,
        name: *const ::core::ffi::c_char,
        data: *const ::core::ffi::c_void,
        size: usize,
    );
}
unsafe extern "C" {
    #[doc = "Create a new multi archive \\(initially empty\\)."]
    pub fn fz_new_multi_archive(ctx: *mut fz_context) -> *mut fz_archive;
}
unsafe extern "C" {
    #[doc = "Add an archive to the set of archives handled by a multi<br>archive.\n\nIf path is `NULL`, then the archive contents will appear at the<br>top level, otherwise, the archives contents will appear prefixed<br>by path."]
    pub fn fz_mount_multi_archive(
        ctx: *mut fz_context,
        arch_: *mut fz_archive,
        sub: *mut fz_archive,
        path: *const ::core::ffi::c_char,
    );
}
pub type fz_recognize_archive_fn = ::core::option::Option<
    unsafe extern "C" fn(arg1: *mut fz_context, arg2: *mut fz_stream) -> ::core::ffi::c_int,
>;
pub type fz_open_archive_fn = ::core::option::Option<
    unsafe extern "C" fn(arg1: *mut fz_context, arg2: *mut fz_stream) -> *mut fz_archive,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_archive_handler {
    pub recognize: fz_recognize_archive_fn,
    pub open: fz_open_archive_fn,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_archive_handler"][::core::mem::size_of::<fz_archive_handler>() - 16usize];
    ["Alignment of fz_archive_handler"][::core::mem::align_of::<fz_archive_handler>() - 8usize];
    ["Offset of field: fz_archive_handler::recognize"]
        [::core::mem::offset_of!(fz_archive_handler, recognize) - 0usize];
    ["Offset of field: fz_archive_handler::open"]
        [::core::mem::offset_of!(fz_archive_handler, open) - 8usize];
};
unsafe extern "C" {
    pub static fz_libarchive_archive_handler: fz_archive_handler;
}
unsafe extern "C" {
    pub fn fz_register_archive_handler(ctx: *mut fz_context, handler: *const fz_archive_handler);
}
#[doc = "Implementation details: Subject to change."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_archive {
    pub refs: ::core::ffi::c_int,
    pub file: *mut fz_stream,
    pub format: *const ::core::ffi::c_char,
    pub drop_archive:
        ::core::option::Option<unsafe extern "C" fn(ctx: *mut fz_context, arch: *mut fz_archive)>,
    pub count_entries: ::core::option::Option<
        unsafe extern "C" fn(ctx: *mut fz_context, arch: *mut fz_archive) -> ::core::ffi::c_int,
    >,
    pub list_entry: ::core::option::Option<
        unsafe extern "C" fn(
            ctx: *mut fz_context,
            arch: *mut fz_archive,
            idx: ::core::ffi::c_int,
        ) -> *const ::core::ffi::c_char,
    >,
    pub has_entry: ::core::option::Option<
        unsafe extern "C" fn(
            ctx: *mut fz_context,
            arch: *mut fz_archive,
            name: *const ::core::ffi::c_char,
        ) -> ::core::ffi::c_int,
    >,
    pub read_entry: ::core::option::Option<
        unsafe extern "C" fn(
            ctx: *mut fz_context,
            arch: *mut fz_archive,
            name: *const ::core::ffi::c_char,
        ) -> *mut fz_buffer,
    >,
    pub open_entry: ::core::option::Option<
        unsafe extern "C" fn(
            ctx: *mut fz_context,
            arch: *mut fz_archive,
            name: *const ::core::ffi::c_char,
        ) -> *mut fz_stream,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_archive"][::core::mem::size_of::<fz_archive>() - 72usize];
    ["Alignment of fz_archive"][::core::mem::align_of::<fz_archive>() - 8usize];
    ["Offset of field: fz_archive::refs"][::core::mem::offset_of!(fz_archive, refs) - 0usize];
    ["Offset of field: fz_archive::file"][::core::mem::offset_of!(fz_archive, file) - 8usize];
    ["Offset of field: fz_archive::format"][::core::mem::offset_of!(fz_archive, format) - 16usize];
    ["Offset of field: fz_archive::drop_archive"]
        [::core::mem::offset_of!(fz_archive, drop_archive) - 24usize];
    ["Offset of field: fz_archive::count_entries"]
        [::core::mem::offset_of!(fz_archive, count_entries) - 32usize];
    ["Offset of field: fz_archive::list_entry"]
        [::core::mem::offset_of!(fz_archive, list_entry) - 40usize];
    ["Offset of field: fz_archive::has_entry"]
        [::core::mem::offset_of!(fz_archive, has_entry) - 48usize];
    ["Offset of field: fz_archive::read_entry"]
        [::core::mem::offset_of!(fz_archive, read_entry) - 56usize];
    ["Offset of field: fz_archive::open_entry"]
        [::core::mem::offset_of!(fz_archive, open_entry) - 64usize];
};
unsafe extern "C" {
    pub fn fz_new_archive_of_size(
        ctx: *mut fz_context,
        file: *mut fz_stream,
        size: ::core::ffi::c_int,
    ) -> *mut fz_archive;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_xml {
    _unused: [u8; 0],
}
pub type fz_xml_doc = fz_xml;
unsafe extern "C" {
    #[doc = "Parse the contents of buffer into a tree of xml nodes.\n\n`preserve_white`: whether to keep or delete all-whitespace nodes."]
    pub fn fz_parse_xml(
        ctx: *mut fz_context,
        buf: *mut fz_buffer,
        preserve_white: ::core::ffi::c_int,
    ) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Parse the contents of buffer into a tree of xml nodes.\n\n`preserve_white`: whether to keep or delete all-whitespace nodes."]
    pub fn fz_parse_xml_stream(
        ctx: *mut fz_context,
        stream: *mut fz_stream,
        preserve_white: ::core::ffi::c_int,
    ) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Parse the contents of an archive entry into a tree of xml nodes.\n\n`preserve_white`: whether to keep or delete all-whitespace nodes."]
    pub fn fz_parse_xml_archive_entry(
        ctx: *mut fz_context,
        dir: *mut fz_archive,
        filename: *const ::core::ffi::c_char,
        preserve_white: ::core::ffi::c_int,
    ) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Try and parse the contents of an archive entry into a tree of xml nodes.\n\n`preserve_white`: whether to keep or delete all-whitespace nodes.\n\nWill return `NULL` if the archive entry can't be found. Otherwise behaves<br>the same as [`fz_parse_xml_archive_entry`]. May throw exceptions."]
    pub fn fz_try_parse_xml_archive_entry(
        ctx: *mut fz_context,
        dir: *mut fz_archive,
        filename: *const ::core::ffi::c_char,
        preserve_white: ::core::ffi::c_int,
    ) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Parse the contents of a buffer into a tree of XML nodes,<br>using the HTML5 parsing algorithm."]
    pub fn fz_parse_xml_from_html5(ctx: *mut fz_context, buf: *mut fz_buffer) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Add a reference to the XML."]
    pub fn fz_keep_xml(ctx: *mut fz_context, xml: *mut fz_xml) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Drop a reference to the XML. When the last reference is<br>dropped, the node and all its children and siblings will<br>be freed."]
    pub fn fz_drop_xml(ctx: *mut fz_context, xml: *mut fz_xml);
}
unsafe extern "C" {
    #[doc = "Detach a node from the tree, unlinking it from its parent,<br>and setting the document root to the node."]
    pub fn fz_detach_xml(ctx: *mut fz_context, node: *mut fz_xml);
}
unsafe extern "C" {
    #[doc = "Return the topmost XML node of a document."]
    pub fn fz_xml_root(xml: *mut fz_xml_doc) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Return previous sibling of XML node."]
    pub fn fz_xml_prev(item: *mut fz_xml) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Return next sibling of XML node."]
    pub fn fz_xml_next(item: *mut fz_xml) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Return parent of XML node."]
    pub fn fz_xml_up(item: *mut fz_xml) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Return first child of XML node."]
    pub fn fz_xml_down(item: *mut fz_xml) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Return true if the tag name matches."]
    pub fn fz_xml_is_tag(item: *mut fz_xml, name: *const ::core::ffi::c_char)
    -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Return tag of XML node. Return `NULL` for text nodes."]
    pub fn fz_xml_tag(item: *mut fz_xml) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Return the value of an attribute of an XML node.<br>`NULL` if the attribute doesn't exist."]
    pub fn fz_xml_att(
        item: *mut fz_xml,
        att: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Return the value of an attribute of an XML node.<br>If the first attribute doesn't exist, try the second.<br>`NULL` if neither attribute exists."]
    pub fn fz_xml_att_alt(
        item: *mut fz_xml,
        one: *const ::core::ffi::c_char,
        two: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Check for a matching attribute on an XML node.\n\nIf the node has the requested attribute \\(name\\), and the value<br>matches \\(match\\) then return 1. Otherwise, 0."]
    pub fn fz_xml_att_eq(
        item: *mut fz_xml,
        name: *const ::core::ffi::c_char,
        match_: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Add an attribute to an XML node."]
    pub fn fz_xml_add_att(
        ctx: *mut fz_context,
        pool: *mut fz_pool,
        node: *mut fz_xml,
        key: *const ::core::ffi::c_char,
        val: *const ::core::ffi::c_char,
    );
}
unsafe extern "C" {
    #[doc = "Return the text content of an XML node.<br>Return `NULL` if the node is a tag."]
    pub fn fz_xml_text(item: *mut fz_xml) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Pretty-print an XML tree to given output."]
    pub fn fz_output_xml(
        ctx: *mut fz_context,
        out: *mut fz_output,
        item: *mut fz_xml,
        level: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    #[doc = "Pretty-print an XML tree to stdout. \\(Deprecated, use<br>[`fz_output_xml`] in preference\\)."]
    pub fn fz_debug_xml(item: *mut fz_xml, level: ::core::ffi::c_int);
}
unsafe extern "C" {
    #[doc = "Search the siblings of XML nodes starting with item looking for<br>the first with the given tag.\n\nReturn `NULL` if none found."]
    pub fn fz_xml_find(item: *mut fz_xml, tag: *const ::core::ffi::c_char) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Search the siblings of XML nodes starting with the first sibling<br>of item looking for the first with the given tag.\n\nReturn `NULL` if none found."]
    pub fn fz_xml_find_next(item: *mut fz_xml, tag: *const ::core::ffi::c_char) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Search the siblings of XML nodes starting with the first child<br>of item looking for the first with the given tag.\n\nReturn `NULL` if none found."]
    pub fn fz_xml_find_down(item: *mut fz_xml, tag: *const ::core::ffi::c_char) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Search the siblings of XML nodes starting with item looking for<br>the first with the given tag \\(or any tag if tag is `NULL`\\), and<br>with a matching attribute.\n\nReturn `NULL` if none found."]
    pub fn fz_xml_find_match(
        item: *mut fz_xml,
        tag: *const ::core::ffi::c_char,
        att: *const ::core::ffi::c_char,
        match_: *const ::core::ffi::c_char,
    ) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Search the siblings of XML nodes starting with the first sibling<br>of item looking for the first with the given tag \\(or any tag if tag<br>is `NULL`\\), and with a matching attribute.\n\nReturn `NULL` if none found."]
    pub fn fz_xml_find_next_match(
        item: *mut fz_xml,
        tag: *const ::core::ffi::c_char,
        att: *const ::core::ffi::c_char,
        match_: *const ::core::ffi::c_char,
    ) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Search the siblings of XML nodes starting with the first child<br>of item looking for the first with the given tag \\(or any tag if<br>tag is `NULL`\\), and with a matching attribute.\n\nReturn `NULL` if none found."]
    pub fn fz_xml_find_down_match(
        item: *mut fz_xml,
        tag: *const ::core::ffi::c_char,
        att: *const ::core::ffi::c_char,
        match_: *const ::core::ffi::c_char,
    ) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Perform a depth first search from item, returning the first<br>child that matches the given tag \\(or any tag if tag is `NULL`\\),<br>with the given attribute \\(if att is non `NULL`\\), that matches<br>match \\(if match is non `NULL`\\)."]
    pub fn fz_xml_find_dfs(
        item: *mut fz_xml,
        tag: *const ::core::ffi::c_char,
        att: *const ::core::ffi::c_char,
        match_: *const ::core::ffi::c_char,
    ) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Perform a depth first search from item, returning the first<br>child that matches the given tag \\(or any tag if tag is `NULL`\\),<br>with the given attribute \\(if att is non `NULL`\\), that matches<br>match \\(if match is non `NULL`\\). The search stops if it ever<br>reaches the top of the tree, or the declared 'top' item."]
    pub fn fz_xml_find_dfs_top(
        item: *mut fz_xml,
        tag: *const ::core::ffi::c_char,
        att: *const ::core::ffi::c_char,
        match_: *const ::core::ffi::c_char,
        top: *mut fz_xml,
    ) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Perform a depth first search onwards from item, returning the first<br>child that matches the given tag \\(or any tag if tag is `NULL`\\),<br>with the given attribute \\(if att is non `NULL`\\), that matches<br>match \\(if match is non `NULL`\\)."]
    pub fn fz_xml_find_next_dfs(
        item: *mut fz_xml,
        tag: *const ::core::ffi::c_char,
        att: *const ::core::ffi::c_char,
        match_: *const ::core::ffi::c_char,
    ) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Perform a depth first search onwards from item, returning the first<br>child that matches the given tag \\(or any tag if tag is `NULL`\\),<br>with the given attribute \\(if att is non `NULL`\\), that matches<br>match \\(if match is non `NULL`\\). The search stops if it ever reaches<br>the top of the tree, or the declared 'top' item."]
    pub fn fz_xml_find_next_dfs_top(
        item: *mut fz_xml,
        tag: *const ::core::ffi::c_char,
        att: *const ::core::ffi::c_char,
        match_: *const ::core::ffi::c_char,
        top: *mut fz_xml,
    ) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Extract and concatenate all plain text data from XML tree into a new string."]
    pub fn fz_new_text_from_xml(
        ctx: *mut fz_context,
        root: *mut fz_xml,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Return a borrowed reference for the 'body' element of<br>the given DOM."]
    pub fn fz_dom_body(ctx: *mut fz_context, dom: *mut fz_xml) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Return a borrowed reference for the document \\(the top<br>level element\\) of the DOM."]
    pub fn fz_dom_document_element(ctx: *mut fz_context, dom: *mut fz_xml) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Create an element of a given tag type for the given DOM.\n\nThe element is not linked into the DOM yet."]
    pub fn fz_dom_create_element(
        ctx: *mut fz_context,
        dom: *mut fz_xml,
        tag: *const ::core::ffi::c_char,
    ) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Create a text node for the given DOM.\n\nThe element is not linked into the DOM yet."]
    pub fn fz_dom_create_text_node(
        ctx: *mut fz_context,
        dom: *mut fz_xml,
        text: *const ::core::ffi::c_char,
    ) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Find the first element matching the requirements in a depth first traversal from elt.\n\nThe tagname must match tag, unless tag is `NULL`, when all tag names are considered to match.\n\nIf att is `NULL`, then all tags match.<br>Otherwise:<br>If match is `NULL`, then only nodes that have an att attribute match.<br>If match is non-`NULL`, then only nodes that have an att attribute that matches match match.\n\nReturns `NULL` \\(if no match found\\), or a borrowed reference to the first matching element."]
    pub fn fz_dom_find(
        ctx: *mut fz_context,
        elt: *mut fz_xml,
        tag: *const ::core::ffi::c_char,
        att: *const ::core::ffi::c_char,
        match_: *const ::core::ffi::c_char,
    ) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Find the next element matching the requirements."]
    pub fn fz_dom_find_next(
        ctx: *mut fz_context,
        elt: *mut fz_xml,
        tag: *const ::core::ffi::c_char,
        att: *const ::core::ffi::c_char,
        match_: *const ::core::ffi::c_char,
    ) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Insert an element as the last child of a parent, unlinking the<br>child from its current position if required."]
    pub fn fz_dom_append_child(ctx: *mut fz_context, parent: *mut fz_xml, child: *mut fz_xml);
}
unsafe extern "C" {
    #[doc = "Insert an element \\(new_elt\\), before another element \\(node\\),<br>unlinking the new_elt from its current position if required."]
    pub fn fz_dom_insert_before(ctx: *mut fz_context, node: *mut fz_xml, new_elt: *mut fz_xml);
}
unsafe extern "C" {
    #[doc = "Insert an element \\(new_elt\\), after another element \\(node\\),<br>unlinking the new_elt from its current position if required."]
    pub fn fz_dom_insert_after(ctx: *mut fz_context, node: *mut fz_xml, new_elt: *mut fz_xml);
}
unsafe extern "C" {
    #[doc = "Remove an element from the DOM. The element can be added back elsewhere<br>if required.\n\nNo reference counting changes for the element."]
    pub fn fz_dom_remove(ctx: *mut fz_context, elt: *mut fz_xml);
}
unsafe extern "C" {
    #[doc = "Clone an element \\(and its children\\).\n\nA borrowed reference to the clone is returned. The clone is not<br>yet linked into the DOM."]
    pub fn fz_dom_clone(ctx: *mut fz_context, elt: *mut fz_xml) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Return a borrowed reference to the first child of a node,<br>or `NULL` if there isn't one."]
    pub fn fz_dom_first_child(ctx: *mut fz_context, elt: *mut fz_xml) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Return a borrowed reference to the parent of a node,<br>or `NULL` if there isn't one."]
    pub fn fz_dom_parent(ctx: *mut fz_context, elt: *mut fz_xml) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Return a borrowed reference to the next sibling of a node,<br>or `NULL` if there isn't one."]
    pub fn fz_dom_next(ctx: *mut fz_context, elt: *mut fz_xml) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Return a borrowed reference to the previous sibling of a node,<br>or `NULL` if there isn't one."]
    pub fn fz_dom_previous(ctx: *mut fz_context, elt: *mut fz_xml) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Add an attribute to an element.\n\nOwnership of att and value remain with the caller."]
    pub fn fz_dom_add_attribute(
        ctx: *mut fz_context,
        elt: *mut fz_xml,
        att: *const ::core::ffi::c_char,
        value: *const ::core::ffi::c_char,
    );
}
unsafe extern "C" {
    #[doc = "Remove an attribute from an element."]
    pub fn fz_dom_remove_attribute(
        ctx: *mut fz_context,
        elt: *mut fz_xml,
        att: *const ::core::ffi::c_char,
    );
}
unsafe extern "C" {
    #[doc = "Retrieve the value of a given attribute from a given element.\n\nReturns a borrowed pointer to the value or `NULL` if not found."]
    pub fn fz_dom_attribute(
        ctx: *mut fz_context,
        elt: *mut fz_xml,
        att: *const ::core::ffi::c_char,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Enumerate through the attributes of an element.\n\nCall with i=0,1,2,3... to enumerate attributes.\n\nOn return *att and the return value will be `NULL` if there are not<br>that many attributes to read. Otherwise, *att will be filled in<br>with a borrowed pointer to the attribute name, and the return<br>value will be a borrowed pointer to the value."]
    pub fn fz_dom_get_attribute(
        ctx: *mut fz_context,
        elt: *mut fz_xml,
        i: ::core::ffi::c_int,
        att: *mut *const ::core::ffi::c_char,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Make new xml dom root element."]
    pub fn fz_new_dom(ctx: *mut fz_context, tag: *const ::core::ffi::c_char) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Create a new dom node.\n\nThis will NOT be linked in yet."]
    pub fn fz_new_dom_node(
        ctx: *mut fz_context,
        dom: *mut fz_xml,
        tag: *const ::core::ffi::c_char,
    ) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Create a new dom text node.\n\nThis will NOT be linked in yet."]
    pub fn fz_new_dom_text_node(
        ctx: *mut fz_context,
        dom: *mut fz_xml,
        text: *const ::core::ffi::c_char,
    ) -> *mut fz_xml;
}
unsafe extern "C" {
    #[doc = "Write our xml structure out to an xml stream.\n\nProperly formatted XML is only allowed to have a single top-level node<br>under which everything must sit. Our structures allow for multiple<br>top level nodes. If required, we will output an extra 'ROOT' node<br>at the top so that the xml is well-formed.\n\nIf 'indented' is non-zero then additional whitespace will be added to<br>make the XML easier to read in a text editor. It will NOT be properly<br>compliant."]
    pub fn fz_write_xml(
        ctx: *mut fz_context,
        root: *mut fz_xml,
        out: *mut fz_output,
        indented: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    #[doc = "As for [`fz_write_xml`], but direct to a file."]
    pub fn fz_save_xml(
        ctx: *mut fz_context,
        root: *mut fz_xml,
        path: *const ::core::ffi::c_char,
        indented: ::core::ffi::c_int,
    );
}
pub const FZ_JSON_NULL: _bindgen_ty_4 = 0;
pub const FZ_JSON_TRUE: _bindgen_ty_4 = 1;
pub const FZ_JSON_FALSE: _bindgen_ty_4 = 2;
pub const FZ_JSON_NUMBER: _bindgen_ty_4 = 3;
pub const FZ_JSON_STRING: _bindgen_ty_4 = 4;
pub const FZ_JSON_ARRAY: _bindgen_ty_4 = 5;
pub const FZ_JSON_OBJECT: _bindgen_ty_4 = 6;
pub type _bindgen_ty_4 = ::core::ffi::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct fz_json {
    pub type_: ::core::ffi::c_int,
    pub u: fz_json__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union fz_json__bindgen_ty_1 {
    pub number: f64,
    pub string: *const ::core::ffi::c_char,
    pub array: *mut fz_json_array,
    pub object: *mut fz_json_object,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_json__bindgen_ty_1"][::core::mem::size_of::<fz_json__bindgen_ty_1>() - 8usize];
    ["Alignment of fz_json__bindgen_ty_1"]
        [::core::mem::align_of::<fz_json__bindgen_ty_1>() - 8usize];
    ["Offset of field: fz_json__bindgen_ty_1::number"]
        [::core::mem::offset_of!(fz_json__bindgen_ty_1, number) - 0usize];
    ["Offset of field: fz_json__bindgen_ty_1::string"]
        [::core::mem::offset_of!(fz_json__bindgen_ty_1, string) - 0usize];
    ["Offset of field: fz_json__bindgen_ty_1::array"]
        [::core::mem::offset_of!(fz_json__bindgen_ty_1, array) - 0usize];
    ["Offset of field: fz_json__bindgen_ty_1::object"]
        [::core::mem::offset_of!(fz_json__bindgen_ty_1, object) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_json"][::core::mem::size_of::<fz_json>() - 16usize];
    ["Alignment of fz_json"][::core::mem::align_of::<fz_json>() - 8usize];
    ["Offset of field: fz_json::type_"][::core::mem::offset_of!(fz_json, type_) - 0usize];
    ["Offset of field: fz_json::u"][::core::mem::offset_of!(fz_json, u) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_json_array {
    pub value: *mut fz_json,
    pub next: *mut fz_json_array,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_json_array"][::core::mem::size_of::<fz_json_array>() - 16usize];
    ["Alignment of fz_json_array"][::core::mem::align_of::<fz_json_array>() - 8usize];
    ["Offset of field: fz_json_array::value"]
        [::core::mem::offset_of!(fz_json_array, value) - 0usize];
    ["Offset of field: fz_json_array::next"][::core::mem::offset_of!(fz_json_array, next) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_json_object {
    pub key: *const ::core::ffi::c_char,
    pub value: *mut fz_json,
    pub next: *mut fz_json_object,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_json_object"][::core::mem::size_of::<fz_json_object>() - 24usize];
    ["Alignment of fz_json_object"][::core::mem::align_of::<fz_json_object>() - 8usize];
    ["Offset of field: fz_json_object::key"][::core::mem::offset_of!(fz_json_object, key) - 0usize];
    ["Offset of field: fz_json_object::value"]
        [::core::mem::offset_of!(fz_json_object, value) - 8usize];
    ["Offset of field: fz_json_object::next"]
        [::core::mem::offset_of!(fz_json_object, next) - 16usize];
};
unsafe extern "C" {
    pub fn fz_parse_json(
        ctx: *mut fz_context,
        pool: *mut fz_pool,
        s: *const ::core::ffi::c_char,
    ) -> *mut fz_json;
}
unsafe extern "C" {
    pub fn fz_append_json(ctx: *mut fz_context, buf: *mut fz_buffer, value: *mut fz_json);
}
unsafe extern "C" {
    pub fn fz_write_json(ctx: *mut fz_context, out: *mut fz_output, value: *mut fz_json);
}
unsafe extern "C" {
    pub fn fz_json_new_null(ctx: *mut fz_context, pool: *mut fz_pool) -> *mut fz_json;
}
unsafe extern "C" {
    pub fn fz_json_new_boolean(
        ctx: *mut fz_context,
        pool: *mut fz_pool,
        x: ::core::ffi::c_int,
    ) -> *mut fz_json;
}
unsafe extern "C" {
    pub fn fz_json_new_number(
        ctx: *mut fz_context,
        pool: *mut fz_pool,
        number: f64,
    ) -> *mut fz_json;
}
unsafe extern "C" {
    pub fn fz_json_new_string(
        ctx: *mut fz_context,
        pool: *mut fz_pool,
        string: *const ::core::ffi::c_char,
    ) -> *mut fz_json;
}
unsafe extern "C" {
    pub fn fz_json_new_array(ctx: *mut fz_context, pool: *mut fz_pool) -> *mut fz_json;
}
unsafe extern "C" {
    pub fn fz_json_new_object(ctx: *mut fz_context, pool: *mut fz_pool) -> *mut fz_json;
}
unsafe extern "C" {
    pub fn fz_json_array_push(
        ctx: *mut fz_context,
        pool: *mut fz_pool,
        array: *mut fz_json,
        item: *mut fz_json,
    );
}
unsafe extern "C" {
    pub fn fz_json_object_set(
        ctx: *mut fz_context,
        pool: *mut fz_pool,
        object: *mut fz_json,
        key: *const ::core::ffi::c_char,
        item: *mut fz_json,
    );
}
unsafe extern "C" {
    pub fn fz_json_is_null(ctx: *mut fz_context, json: *mut fz_json) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_json_is_boolean(ctx: *mut fz_context, json: *mut fz_json) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_json_is_number(ctx: *mut fz_context, json: *mut fz_json) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_json_is_string(ctx: *mut fz_context, json: *mut fz_json) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_json_is_array(ctx: *mut fz_context, json: *mut fz_json) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_json_is_object(ctx: *mut fz_context, json: *mut fz_json) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_json_to_boolean(ctx: *mut fz_context, json: *mut fz_json) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_json_to_number(ctx: *mut fz_context, json: *mut fz_json) -> f64;
}
unsafe extern "C" {
    pub fn fz_json_to_string(
        ctx: *mut fz_context,
        json: *mut fz_json,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn fz_json_array_length(ctx: *mut fz_context, array: *mut fz_json) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_json_array_get(
        ctx: *mut fz_context,
        array: *mut fz_json,
        ix: ::core::ffi::c_int,
    ) -> *mut fz_json;
}
unsafe extern "C" {
    pub fn fz_json_object_get(
        ctx: *mut fz_context,
        object: *mut fz_json,
        key: *const ::core::ffi::c_char,
    ) -> *mut fz_json;
}
#[doc = "Locations within the document are referred to in terms of<br>chapter and page, rather than just a page number. For some<br>documents \\(such as epub documents with large numbers of pages<br>broken into many chapters\\) this can make navigation much faster<br>as only the required chapter needs to be decoded at a time."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_location {
    pub chapter: ::core::ffi::c_int,
    pub page: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_location"][::core::mem::size_of::<fz_location>() - 8usize];
    ["Alignment of fz_location"][::core::mem::align_of::<fz_location>() - 4usize];
    ["Offset of field: fz_location::chapter"]
        [::core::mem::offset_of!(fz_location, chapter) - 0usize];
    ["Offset of field: fz_location::page"][::core::mem::offset_of!(fz_location, page) - 4usize];
};
#[doc = "Function type for a function to drop a storable object.\n\nObjects within the store are identified by type by comparing<br>their drop_fn pointers."]
pub type fz_store_drop_fn =
    ::core::option::Option<unsafe extern "C" fn(arg1: *mut fz_context, arg2: *mut fz_storable)>;
#[doc = "Function type for a function to check whether a storable<br>object can be dropped at the moment.\n\nReturn 0 for 'cannot be dropped', 1 otherwise."]
pub type fz_store_droppable_fn = ::core::option::Option<
    unsafe extern "C" fn(arg1: *mut fz_context, arg2: *mut fz_storable) -> ::core::ffi::c_int,
>;
#[doc = "Any storable object should include an [`fz_storable`] structure<br>at the start \\(by convention at least\\) of their structure.<br>\\(Unless it starts with an [`fz_key_storable`], see below\\)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_storable {
    pub refs: ::core::ffi::c_int,
    pub drop: fz_store_drop_fn,
    pub droppable: fz_store_droppable_fn,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_storable"][::core::mem::size_of::<fz_storable>() - 24usize];
    ["Alignment of fz_storable"][::core::mem::align_of::<fz_storable>() - 8usize];
    ["Offset of field: fz_storable::refs"][::core::mem::offset_of!(fz_storable, refs) - 0usize];
    ["Offset of field: fz_storable::drop"][::core::mem::offset_of!(fz_storable, drop) - 8usize];
    ["Offset of field: fz_storable::droppable"]
        [::core::mem::offset_of!(fz_storable, droppable) - 16usize];
};
#[doc = "Any storable object that can appear in the key of another<br>storable object should include an [`fz_key_storable`] structure<br>at the start \\(by convention at least\\) of their structure."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_key_storable {
    pub storable: fz_storable,
    pub store_key_refs: ::core::ffi::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_key_storable"][::core::mem::size_of::<fz_key_storable>() - 32usize];
    ["Alignment of fz_key_storable"][::core::mem::align_of::<fz_key_storable>() - 8usize];
    ["Offset of field: fz_key_storable::storable"]
        [::core::mem::offset_of!(fz_key_storable, storable) - 0usize];
    ["Offset of field: fz_key_storable::store_key_refs"]
        [::core::mem::offset_of!(fz_key_storable, store_key_refs) - 24usize];
};
unsafe extern "C" {
    #[doc = "Increment the reference count for a storable object.<br>Returns the same pointer.\n\nNever throws exceptions."]
    pub fn fz_keep_storable(
        arg1: *mut fz_context,
        arg2: *const fz_storable,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = "Decrement the reference count for a storable object. When the<br>reference count hits zero, the drop function for that object<br>is called to free the object.\n\nNever throws exceptions."]
    pub fn fz_drop_storable(arg1: *mut fz_context, arg2: *const fz_storable);
}
unsafe extern "C" {
    #[doc = "Increment the \\(normal\\) reference count for a key storable<br>object. Returns the same pointer.\n\nNever throws exceptions."]
    pub fn fz_keep_key_storable(
        arg1: *mut fz_context,
        arg2: *const fz_key_storable,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = "Decrement the \\(normal\\) reference count for a storable object.<br>When the total reference count hits zero, the drop function for<br>that object is called to free the object.\n\nNever throws exceptions."]
    pub fn fz_drop_key_storable(arg1: *mut fz_context, arg2: *const fz_key_storable);
}
unsafe extern "C" {
    #[doc = "Increment the \\(key\\) reference count for a key storable<br>object. Returns the same pointer.\n\nNever throws exceptions."]
    pub fn fz_keep_key_storable_key(
        arg1: *mut fz_context,
        arg2: *const fz_key_storable,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = "Decrement the \\(key\\) reference count for a storable object.<br>When the total reference count hits zero, the drop function for<br>that object is called to free the object.\n\nNever throws exceptions."]
    pub fn fz_drop_key_storable_key(arg1: *mut fz_context, arg2: *const fz_key_storable);
}
#[doc = "The store can be seen as a dictionary that maps keys to<br>[`fz_storable`] values. In order to allow keys of different types to<br>be stored, we have a structure full of functions for each key<br>'type'; this [`fz_store_type`] pointer is stored with each key, and<br>tells the store how to perform certain operations \\(like taking/<br>dropping a reference, comparing two keys, outputting details for<br>debugging etc\\).\n\nThe store uses a hash table internally for speed where possible.<br>In order for this to work, we need a mechanism for turning a<br>generic 'key' into 'a hashable string'. For this purpose the<br>type structure contains a make_hash_key function pointer that<br>maps from a void * to a [`fz_store_hash`] structure. If<br>make_hash_key function returns 0, then the key is determined not<br>to be hashable, and the value is not stored in the hash table.\n\nSome objects can be used both as values within the store, and as<br>a component of keys within the store. We refer to these objects<br>as \"key storable\" objects. In this case, we need to take<br>additional care to ensure that we do not end up keeping an item<br>within the store, purely because its value is referred to by<br>another key in the store.\n\nAn example of this are [`fz_image`](fz_image)s in PDF files. Each [`fz_image`] is<br>placed into the\tstore to enable it to be easily reused. When the<br>image is rendered, a pixmap is generated from the image, and the<br>pixmap is placed into the store so it can be reused on<br>subsequent renders. The image forms part of the key for the<br>pixmap.\n\nWhen we close the pdf document \\(and any associated pages/display<br>lists etc\\), we drop the images from the store. This may leave us<br>in the position of the images having non-zero reference counts<br>purely because they are used as part of the keys for the<br>pixmaps.\n\nWe therefore use special reference counting functions to keep<br>track of these \"key storable\" items, and hence store the number<br>of references to these items that are used in keys.\n\nWhen the number of references to an object == the number of<br>references to an object from keys in the store, we know that we<br>can remove all the items which have that object as part of the<br>key. This is done by running a pass over the store, 'reaping'<br>those items.\n\nReap passes are slower than we would like as they touch every<br>item in the store. We therefore provide a way to 'batch' such<br>reap passes together, using [`fz_defer_reap_start`]/<br>[`fz_defer_reap_end`] to bracket a region in which many may be<br>triggered."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct fz_store_hash {
    pub drop: fz_store_drop_fn,
    pub u: fz_store_hash__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union fz_store_hash__bindgen_ty_1 {
    pub pi: fz_store_hash__bindgen_ty_1__bindgen_ty_1,
    pub pir: fz_store_hash__bindgen_ty_1__bindgen_ty_2,
    pub im: fz_store_hash__bindgen_ty_1__bindgen_ty_3,
    pub link: fz_store_hash__bindgen_ty_1__bindgen_ty_4,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_store_hash__bindgen_ty_1__bindgen_ty_1 {
    pub ptr: *const ::core::ffi::c_void,
    pub i: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_store_hash__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<fz_store_hash__bindgen_ty_1__bindgen_ty_1>() - 16usize];
    ["Alignment of fz_store_hash__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<fz_store_hash__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: fz_store_hash__bindgen_ty_1__bindgen_ty_1::ptr"]
        [::core::mem::offset_of!(fz_store_hash__bindgen_ty_1__bindgen_ty_1, ptr) - 0usize];
    ["Offset of field: fz_store_hash__bindgen_ty_1__bindgen_ty_1::i"]
        [::core::mem::offset_of!(fz_store_hash__bindgen_ty_1__bindgen_ty_1, i) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_store_hash__bindgen_ty_1__bindgen_ty_2 {
    pub ptr: *const ::core::ffi::c_void,
    pub i: ::core::ffi::c_int,
    pub r: fz_irect,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_store_hash__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::size_of::<fz_store_hash__bindgen_ty_1__bindgen_ty_2>() - 32usize];
    ["Alignment of fz_store_hash__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::align_of::<fz_store_hash__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: fz_store_hash__bindgen_ty_1__bindgen_ty_2::ptr"]
        [::core::mem::offset_of!(fz_store_hash__bindgen_ty_1__bindgen_ty_2, ptr) - 0usize];
    ["Offset of field: fz_store_hash__bindgen_ty_1__bindgen_ty_2::i"]
        [::core::mem::offset_of!(fz_store_hash__bindgen_ty_1__bindgen_ty_2, i) - 8usize];
    ["Offset of field: fz_store_hash__bindgen_ty_1__bindgen_ty_2::r"]
        [::core::mem::offset_of!(fz_store_hash__bindgen_ty_1__bindgen_ty_2, r) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_store_hash__bindgen_ty_1__bindgen_ty_3 {
    pub id: ::core::ffi::c_int,
    pub has_shape: ::core::ffi::c_char,
    pub has_group_alpha: ::core::ffi::c_char,
    pub m: [f32; 4usize],
    pub ptr: *mut ::core::ffi::c_void,
    pub doc_id: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_store_hash__bindgen_ty_1__bindgen_ty_3"]
        [::core::mem::size_of::<fz_store_hash__bindgen_ty_1__bindgen_ty_3>() - 40usize];
    ["Alignment of fz_store_hash__bindgen_ty_1__bindgen_ty_3"]
        [::core::mem::align_of::<fz_store_hash__bindgen_ty_1__bindgen_ty_3>() - 8usize];
    ["Offset of field: fz_store_hash__bindgen_ty_1__bindgen_ty_3::id"]
        [::core::mem::offset_of!(fz_store_hash__bindgen_ty_1__bindgen_ty_3, id) - 0usize];
    ["Offset of field: fz_store_hash__bindgen_ty_1__bindgen_ty_3::has_shape"]
        [::core::mem::offset_of!(fz_store_hash__bindgen_ty_1__bindgen_ty_3, has_shape) - 4usize];
    ["Offset of field: fz_store_hash__bindgen_ty_1__bindgen_ty_3::has_group_alpha"][::core::mem::offset_of!(
        fz_store_hash__bindgen_ty_1__bindgen_ty_3,
        has_group_alpha
    ) - 5usize];
    ["Offset of field: fz_store_hash__bindgen_ty_1__bindgen_ty_3::m"]
        [::core::mem::offset_of!(fz_store_hash__bindgen_ty_1__bindgen_ty_3, m) - 8usize];
    ["Offset of field: fz_store_hash__bindgen_ty_1__bindgen_ty_3::ptr"]
        [::core::mem::offset_of!(fz_store_hash__bindgen_ty_1__bindgen_ty_3, ptr) - 24usize];
    ["Offset of field: fz_store_hash__bindgen_ty_1__bindgen_ty_3::doc_id"]
        [::core::mem::offset_of!(fz_store_hash__bindgen_ty_1__bindgen_ty_3, doc_id) - 32usize];
};
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct fz_store_hash__bindgen_ty_1__bindgen_ty_4 {
    pub src_md5: [::core::ffi::c_uchar; 16usize],
    pub dst_md5: [::core::ffi::c_uchar; 16usize],
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 3usize]>,
    pub __bindgen_padding_0: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_store_hash__bindgen_ty_1__bindgen_ty_4"]
        [::core::mem::size_of::<fz_store_hash__bindgen_ty_1__bindgen_ty_4>() - 36usize];
    ["Alignment of fz_store_hash__bindgen_ty_1__bindgen_ty_4"]
        [::core::mem::align_of::<fz_store_hash__bindgen_ty_1__bindgen_ty_4>() - 4usize];
    ["Offset of field: fz_store_hash__bindgen_ty_1__bindgen_ty_4::src_md5"]
        [::core::mem::offset_of!(fz_store_hash__bindgen_ty_1__bindgen_ty_4, src_md5) - 0usize];
    ["Offset of field: fz_store_hash__bindgen_ty_1__bindgen_ty_4::dst_md5"]
        [::core::mem::offset_of!(fz_store_hash__bindgen_ty_1__bindgen_ty_4, dst_md5) - 16usize];
};
impl fz_store_hash__bindgen_ty_1__bindgen_ty_4 {
    #[inline]
    pub fn ri(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_ri(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ri_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                2u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_ri_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn bp(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bp(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn bp_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_bp_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn format(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_format(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn format_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_format_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn proof(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_proof(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn proof_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_proof_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn src_extras(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_src_extras(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn src_extras_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                5u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_src_extras_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn dst_extras(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_dst_extras(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn dst_extras_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                10usize,
                5u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_dst_extras_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                10usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn copy_spots(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_copy_spots(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn copy_spots_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                15usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_copy_spots_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                15usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn bgr(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bgr(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(16usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn bgr_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                16usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_bgr_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                16usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        ri: ::core::ffi::c_uint,
        bp: ::core::ffi::c_uint,
        format: ::core::ffi::c_uint,
        proof: ::core::ffi::c_uint,
        src_extras: ::core::ffi::c_uint,
        dst_extras: ::core::ffi::c_uint,
        copy_spots: ::core::ffi::c_uint,
        bgr: ::core::ffi::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 3usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 3usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let ri: u32 = unsafe { ::core::mem::transmute(ri) };
            ri as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bp: u32 = unsafe { ::core::mem::transmute(bp) };
            bp as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let format: u32 = unsafe { ::core::mem::transmute(format) };
            format as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let proof: u32 = unsafe { ::core::mem::transmute(proof) };
            proof as u64
        });
        __bindgen_bitfield_unit.set(5usize, 5u8, {
            let src_extras: u32 = unsafe { ::core::mem::transmute(src_extras) };
            src_extras as u64
        });
        __bindgen_bitfield_unit.set(10usize, 5u8, {
            let dst_extras: u32 = unsafe { ::core::mem::transmute(dst_extras) };
            dst_extras as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let copy_spots: u32 = unsafe { ::core::mem::transmute(copy_spots) };
            copy_spots as u64
        });
        __bindgen_bitfield_unit.set(16usize, 1u8, {
            let bgr: u32 = unsafe { ::core::mem::transmute(bgr) };
            bgr as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_store_hash__bindgen_ty_1"]
        [::core::mem::size_of::<fz_store_hash__bindgen_ty_1>() - 40usize];
    ["Alignment of fz_store_hash__bindgen_ty_1"]
        [::core::mem::align_of::<fz_store_hash__bindgen_ty_1>() - 8usize];
    ["Offset of field: fz_store_hash__bindgen_ty_1::pi"]
        [::core::mem::offset_of!(fz_store_hash__bindgen_ty_1, pi) - 0usize];
    ["Offset of field: fz_store_hash__bindgen_ty_1::pir"]
        [::core::mem::offset_of!(fz_store_hash__bindgen_ty_1, pir) - 0usize];
    ["Offset of field: fz_store_hash__bindgen_ty_1::im"]
        [::core::mem::offset_of!(fz_store_hash__bindgen_ty_1, im) - 0usize];
    ["Offset of field: fz_store_hash__bindgen_ty_1::link"]
        [::core::mem::offset_of!(fz_store_hash__bindgen_ty_1, link) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_store_hash"][::core::mem::size_of::<fz_store_hash>() - 48usize];
    ["Alignment of fz_store_hash"][::core::mem::align_of::<fz_store_hash>() - 8usize];
    ["Offset of field: fz_store_hash::drop"][::core::mem::offset_of!(fz_store_hash, drop) - 0usize];
    ["Offset of field: fz_store_hash::u"][::core::mem::offset_of!(fz_store_hash, u) - 8usize];
};
#[doc = "Every type of object to be placed into the store defines an<br>[`fz_store_type`]. This contains the pointers to functions to<br>make hashes, manipulate keys, and check for needing reaping."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_store_type {
    pub name: *const ::core::ffi::c_char,
    pub make_hash_key: ::core::option::Option<
        unsafe extern "C" fn(
            ctx: *mut fz_context,
            hash: *mut fz_store_hash,
            key: *mut ::core::ffi::c_void,
        ) -> ::core::ffi::c_int,
    >,
    pub keep_key: ::core::option::Option<
        unsafe extern "C" fn(
            ctx: *mut fz_context,
            key: *mut ::core::ffi::c_void,
        ) -> *mut ::core::ffi::c_void,
    >,
    pub drop_key: ::core::option::Option<
        unsafe extern "C" fn(ctx: *mut fz_context, key: *mut ::core::ffi::c_void),
    >,
    pub cmp_key: ::core::option::Option<
        unsafe extern "C" fn(
            ctx: *mut fz_context,
            a: *mut ::core::ffi::c_void,
            b: *mut ::core::ffi::c_void,
        ) -> ::core::ffi::c_int,
    >,
    pub format_key: ::core::option::Option<
        unsafe extern "C" fn(
            ctx: *mut fz_context,
            buf: *mut ::core::ffi::c_char,
            size: usize,
            key: *mut ::core::ffi::c_void,
        ),
    >,
    pub needs_reap: ::core::option::Option<
        unsafe extern "C" fn(
            ctx: *mut fz_context,
            key: *mut ::core::ffi::c_void,
        ) -> ::core::ffi::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_store_type"][::core::mem::size_of::<fz_store_type>() - 56usize];
    ["Alignment of fz_store_type"][::core::mem::align_of::<fz_store_type>() - 8usize];
    ["Offset of field: fz_store_type::name"][::core::mem::offset_of!(fz_store_type, name) - 0usize];
    ["Offset of field: fz_store_type::make_hash_key"]
        [::core::mem::offset_of!(fz_store_type, make_hash_key) - 8usize];
    ["Offset of field: fz_store_type::keep_key"]
        [::core::mem::offset_of!(fz_store_type, keep_key) - 16usize];
    ["Offset of field: fz_store_type::drop_key"]
        [::core::mem::offset_of!(fz_store_type, drop_key) - 24usize];
    ["Offset of field: fz_store_type::cmp_key"]
        [::core::mem::offset_of!(fz_store_type, cmp_key) - 32usize];
    ["Offset of field: fz_store_type::format_key"]
        [::core::mem::offset_of!(fz_store_type, format_key) - 40usize];
    ["Offset of field: fz_store_type::needs_reap"]
        [::core::mem::offset_of!(fz_store_type, needs_reap) - 48usize];
};
unsafe extern "C" {
    #[doc = "Create a new store inside the context\n\n`max`: The maximum size \\(in bytes\\) that the store is allowed to<br>grow to. [`FZ_STORE_UNLIMITED`] means no limit."]
    pub fn fz_new_store_context(ctx: *mut fz_context, max: usize);
}
unsafe extern "C" {
    #[doc = "Increment the reference count for the store context. Returns<br>the same pointer.\n\nNever throws exceptions."]
    pub fn fz_keep_store_context(ctx: *mut fz_context) -> *mut fz_store;
}
unsafe extern "C" {
    #[doc = "Decrement the reference count for the store context. When the<br>reference count hits zero, the store context is freed.\n\nNever throws exceptions."]
    pub fn fz_drop_store_context(ctx: *mut fz_context);
}
unsafe extern "C" {
    #[doc = "Add an item to the store.\n\nAdd an item into the store, returning `NULL` for success. If an<br>item with the same key is found in the store, then our item will<br>not be inserted, and the function will return a pointer to that<br>value instead. This function takes its own reference to val, as<br>required \\(i.e. the caller maintains ownership of its own<br>reference\\).\n\n`key`: The key used to index the item.\n\n`val`: The value to store.\n\n`itemsize`: The size in bytes of the value \\(as counted towards the<br>store size\\).\n\n`type`: Functions used to manipulate the key."]
    pub fn fz_store_item(
        ctx: *mut fz_context,
        key: *mut ::core::ffi::c_void,
        val: *mut ::core::ffi::c_void,
        itemsize: usize,
        type_: *const fz_store_type,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = "Find an item within the store.\n\n`drop`: The function used to free the value \\(to ensure we get a<br>value of the correct type\\).\n\n`key`: The key used to index the item.\n\n`type`: Functions used to manipulate the key.\n\nReturns `NULL` for not found, otherwise returns a pointer to the<br>value indexed by key to which a reference has been taken."]
    pub fn fz_find_item(
        ctx: *mut fz_context,
        drop: fz_store_drop_fn,
        key: *mut ::core::ffi::c_void,
        type_: *const fz_store_type,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = "Remove an item from the store.\n\nIf an item indexed by the given key exists in the store, remove<br>it.\n\n`drop`: The function used to free the value \\(to ensure we get a<br>value of the correct type\\).\n\n`key`: The key used to find the item to remove.\n\n`type`: Functions used to manipulate the key."]
    pub fn fz_remove_item(
        ctx: *mut fz_context,
        drop: fz_store_drop_fn,
        key: *mut ::core::ffi::c_void,
        type_: *const fz_store_type,
    );
}
unsafe extern "C" {
    #[doc = "Evict every item from the store."]
    pub fn fz_empty_store(ctx: *mut fz_context);
}
unsafe extern "C" {
    #[doc = "Internal function used as part of the scavenging<br>allocator; when we fail to allocate memory, before returning a<br>failure to the caller, we try to scavenge space within the store<br>by evicting at least 'size' bytes. The allocator then retries.\n\n`size`: The number of bytes we are trying to have free.\n\n`phase`: What phase of the scavenge we are in. Updated on exit.\n\nReturns non zero if we managed to free any memory."]
    pub fn fz_store_scavenge(
        ctx: *mut fz_context,
        size: usize,
        phase: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "External function for callers to use<br>to scavenge while trying allocations.\n\n`size`: The number of bytes we are trying to have free.\n\n`phase`: What phase of the scavenge we are in. Updated on exit.\n\nReturns non zero if we managed to free any memory."]
    pub fn fz_store_scavenge_external(
        ctx: *mut fz_context,
        size: usize,
        phase: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Evict items from the store until the total size of<br>the objects in the store is reduced to a given percentage of its<br>current size.\n\n`percent`: %age of current size to reduce the store to.\n\nReturns non zero if we managed to free enough memory, zero<br>otherwise."]
    pub fn fz_shrink_store(
        ctx: *mut fz_context,
        percent: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
#[doc = "Callback function called by [`fz_filter_store`] on every item within<br>the store.\n\nReturn 1 to drop the item from the store, 0 to retain."]
pub type fz_store_filter_fn = ::core::option::Option<
    unsafe extern "C" fn(
        ctx: *mut fz_context,
        arg: *mut ::core::ffi::c_void,
        key: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int,
>;
unsafe extern "C" {
    #[doc = "Filter every element in the store with a matching type with the<br>given function.\n\nIf the function returns 1 for an element, drop the element."]
    pub fn fz_filter_store(
        ctx: *mut fz_context,
        fn_: fz_store_filter_fn,
        arg: *mut ::core::ffi::c_void,
        type_: *const fz_store_type,
    );
}
unsafe extern "C" {
    #[doc = "Filter the store and throw away any stored tiles drawn for a<br>given document."]
    pub fn fz_drop_drawn_tiles_for_document(ctx: *mut fz_context, doc: *mut fz_document);
}
unsafe extern "C" {
    #[doc = "Output debugging information for the current state of the store<br>to the given output channel."]
    pub fn fz_debug_store(ctx: *mut fz_context, out: *mut fz_output);
}
unsafe extern "C" {
    #[doc = "Increment the defer reap count.\n\nNo reap operations will take place \\(except for those<br>triggered by an immediate failed malloc\\) until the<br>defer reap count returns to 0.\n\nCall this at the start of a process during which you<br>potentially might drop many reapable objects.\n\nIt is vital that every [`fz_defer_reap_start`] is matched<br>by a [`fz_defer_reap_end`] call."]
    pub fn fz_defer_reap_start(ctx: *mut fz_context);
}
unsafe extern "C" {
    #[doc = "Decrement the defer reap count.\n\nIf the defer reap count returns to 0, and the store<br>has reapable objects in, a reap pass will begin.\n\nCall this at the end of a process during which you<br>potentially might drop many reapable objects.\n\nIt is vital that every [`fz_defer_reap_start`] is matched<br>by a [`fz_defer_reap_end`] call."]
    pub fn fz_defer_reap_end(ctx: *mut fz_context);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_icc_profile {
    _unused: [u8; 0],
}
pub const FZ_RI_PERCEPTUAL: _bindgen_ty_5 = 0;
pub const FZ_RI_RELATIVE_COLORIMETRIC: _bindgen_ty_5 = 1;
pub const FZ_RI_SATURATION: _bindgen_ty_5 = 2;
pub const FZ_RI_ABSOLUTE_COLORIMETRIC: _bindgen_ty_5 = 3;
pub type _bindgen_ty_5 = ::core::ffi::c_int;
pub const FZ_RI_IN_SOFTMASK: _bindgen_ty_6 = 128;
pub type _bindgen_ty_6 = ::core::ffi::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_color_params {
    pub ri: u8,
    pub bp: u8,
    pub op: u8,
    pub opm: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_color_params"][::core::mem::size_of::<fz_color_params>() - 4usize];
    ["Alignment of fz_color_params"][::core::mem::align_of::<fz_color_params>() - 1usize];
    ["Offset of field: fz_color_params::ri"][::core::mem::offset_of!(fz_color_params, ri) - 0usize];
    ["Offset of field: fz_color_params::bp"][::core::mem::offset_of!(fz_color_params, bp) - 1usize];
    ["Offset of field: fz_color_params::op"][::core::mem::offset_of!(fz_color_params, op) - 2usize];
    ["Offset of field: fz_color_params::opm"]
        [::core::mem::offset_of!(fz_color_params, opm) - 3usize];
};
unsafe extern "C" {
    pub static fz_default_color_params: fz_color_params;
}
unsafe extern "C" {
    #[doc = "Map from \\(case sensitive\\) rendering intent string to enumeration<br>value."]
    pub fn fz_lookup_rendering_intent(name: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Map from enumerated rendering intent to string.\n\nThe returned string is static and therefore must not be freed."]
    pub fn fz_rendering_intent_name(ri: ::core::ffi::c_int) -> *const ::core::ffi::c_char;
}
pub const FZ_MAX_COLORS: _bindgen_ty_7 = 32;
#[doc = "The maximum number of colorants available in any given<br>color/colorspace \\(not including alpha\\).\n\nChanging this value will alter the amount of memory being used<br>\\(both stack and heap space\\), but not hugely. Speed should<br>\\(largely\\) be determined by the number of colors actually used."]
pub type _bindgen_ty_7 = ::core::ffi::c_int;
pub const FZ_COLORSPACE_NONE: fz_colorspace_type = 0;
pub const FZ_COLORSPACE_GRAY: fz_colorspace_type = 1;
pub const FZ_COLORSPACE_RGB: fz_colorspace_type = 2;
pub const FZ_COLORSPACE_BGR: fz_colorspace_type = 3;
pub const FZ_COLORSPACE_CMYK: fz_colorspace_type = 4;
pub const FZ_COLORSPACE_LAB: fz_colorspace_type = 5;
pub const FZ_COLORSPACE_INDEXED: fz_colorspace_type = 6;
pub const FZ_COLORSPACE_SEPARATION: fz_colorspace_type = 7;
pub type fz_colorspace_type = ::core::ffi::c_int;
pub const FZ_COLORSPACE_IS_DEVICE: _bindgen_ty_8 = 1;
pub const FZ_COLORSPACE_IS_ICC: _bindgen_ty_8 = 2;
pub const FZ_COLORSPACE_HAS_CMYK: _bindgen_ty_8 = 4;
pub const FZ_COLORSPACE_HAS_SPOTS: _bindgen_ty_8 = 8;
pub const FZ_COLORSPACE_HAS_CMYK_AND_SPOTS: _bindgen_ty_8 = 12;
pub type _bindgen_ty_8 = ::core::ffi::c_int;
unsafe extern "C" {
    #[doc = "Creates a new colorspace instance and returns a reference.\n\nNo internal checking is done that the colorspace type \\(e.g.<br>CMYK\\) matches with the flags \\(e.g. [`FZ_COLORSPACE_HAS_CMYK`]\\) or<br>colorant count \\(n\\) or name.\n\nThe reference should be dropped when it is finished with.\n\nColorspaces are immutable once created \\(with the exception of<br>setting up colorant names for separation spaces\\)."]
    pub fn fz_new_colorspace(
        ctx: *mut fz_context,
        type_: fz_colorspace_type,
        flags: ::core::ffi::c_int,
        n: ::core::ffi::c_int,
        name: *const ::core::ffi::c_char,
    ) -> *mut fz_colorspace;
}
unsafe extern "C" {
    #[doc = "Increment the reference count for the colorspace.\n\nReturns the same pointer. Never throws an exception."]
    pub fn fz_keep_colorspace(
        ctx: *mut fz_context,
        colorspace: *mut fz_colorspace,
    ) -> *mut fz_colorspace;
}
unsafe extern "C" {
    #[doc = "Drops a reference to the colorspace.\n\nWhen the reference count reaches zero, the colorspace is<br>destroyed."]
    pub fn fz_drop_colorspace(ctx: *mut fz_context, colorspace: *mut fz_colorspace);
}
unsafe extern "C" {
    #[doc = "Create an indexed colorspace.\n\nThe supplied lookup table is high palette entries long. Each<br>entry is n bytes long, where n is given by the number of<br>colorants in the base colorspace, one byte per colorant.\n\nOwnership of lookup is passed it; it will be freed on<br>destruction, so must be heap allocated.\n\nThe colorspace will keep an additional reference to the base<br>colorspace that will be dropped on destruction.\n\nThe returned reference should be dropped when it is finished<br>with.\n\nColorspaces are immutable once created."]
    pub fn fz_new_indexed_colorspace(
        ctx: *mut fz_context,
        base: *mut fz_colorspace,
        high: ::core::ffi::c_int,
        lookup: *mut ::core::ffi::c_uchar,
    ) -> *mut fz_colorspace;
}
unsafe extern "C" {
    #[doc = "Create a colorspace from an ICC profile supplied in buf.\n\nLimited checking is done to ensure that the colorspace type is<br>appropriate for the supplied ICC profile.\n\nAn additional reference is taken to buf, which will be dropped<br>on destruction. Ownership is NOT passed in.\n\nThe returned reference should be dropped when it is finished<br>with.\n\nColorspaces are immutable once created."]
    pub fn fz_new_icc_colorspace(
        ctx: *mut fz_context,
        type_: fz_colorspace_type,
        flags: ::core::ffi::c_int,
        name: *const ::core::ffi::c_char,
        buf: *mut fz_buffer,
    ) -> *mut fz_colorspace;
}
unsafe extern "C" {
    #[doc = "Create a calibrated gray colorspace.\n\nThe returned reference should be dropped when it is finished<br>with.\n\nColorspaces are immutable once created."]
    pub fn fz_new_cal_gray_colorspace(
        ctx: *mut fz_context,
        wp: *mut f32,
        bp: *mut f32,
        gamma: f32,
    ) -> *mut fz_colorspace;
}
unsafe extern "C" {
    #[doc = "Create a calibrated rgb colorspace.\n\nThe returned reference should be dropped when it is finished<br>with.\n\nColorspaces are immutable once created."]
    pub fn fz_new_cal_rgb_colorspace(
        ctx: *mut fz_context,
        wp: *mut f32,
        bp: *mut f32,
        gamma: *mut f32,
        matrix: *mut f32,
    ) -> *mut fz_colorspace;
}
unsafe extern "C" {
    #[doc = "Query the type of colorspace."]
    pub fn fz_colorspace_type(ctx: *mut fz_context, cs: *mut fz_colorspace) -> fz_colorspace_type;
}
unsafe extern "C" {
    #[doc = "Query the name of a colorspace.\n\nThe returned string has the same lifespan as the colorspace<br>does. Caller should not free it."]
    pub fn fz_colorspace_name(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Query the number of colorants in a colorspace."]
    pub fn fz_colorspace_n(ctx: *mut fz_context, cs: *mut fz_colorspace) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "True for CMYK, Separation and DeviceN colorspaces."]
    pub fn fz_colorspace_is_subtractive(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "True if DeviceN color space has only colorants from the CMYK set."]
    pub fn fz_colorspace_device_n_has_only_cmyk(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "True if DeviceN color space has cyan magenta yellow or black as<br>one of its colorants."]
    pub fn fz_colorspace_device_n_has_cmyk(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Tests for particular types of colorspaces"]
    pub fn fz_colorspace_is_gray(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_colorspace_is_rgb(ctx: *mut fz_context, cs: *mut fz_colorspace)
    -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_colorspace_is_cmyk(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_colorspace_is_lab(ctx: *mut fz_context, cs: *mut fz_colorspace)
    -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_colorspace_is_indexed(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_colorspace_is_icc(ctx: *mut fz_context, cs: *mut fz_colorspace)
    -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_colorspace_is_device_n(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_colorspace_is_device(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_colorspace_is_device_gray(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_colorspace_is_device_cmyk(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_colorspace_is_lab_icc(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Get checksum of underlying ICC profile."]
    pub fn fz_colorspace_digest(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
        digest: *mut ::core::ffi::c_uchar,
    );
}
unsafe extern "C" {
    #[doc = "Check to see that a colorspace is appropriate to be used as<br>a blending space \\(i.e. only grey, rgb or cmyk\\)."]
    pub fn fz_is_valid_blend_colorspace(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Get the 'base' colorspace for a colorspace.\n\nFor indexed colorspaces, this is the colorspace the index<br>decodes into. For all other colorspaces, it is the colorspace<br>itself.\n\nThe returned colorspace is 'borrowed' \\(i.e. no additional<br>references are taken or dropped\\)."]
    pub fn fz_base_colorspace(ctx: *mut fz_context, cs: *mut fz_colorspace) -> *mut fz_colorspace;
}
unsafe extern "C" {
    #[doc = "Retrieve global default colorspaces.\n\nThese return borrowed references that should not be dropped,<br>unless they are kept first."]
    pub fn fz_device_gray(ctx: *mut fz_context) -> *mut fz_colorspace;
}
unsafe extern "C" {
    pub fn fz_device_rgb(ctx: *mut fz_context) -> *mut fz_colorspace;
}
unsafe extern "C" {
    pub fn fz_device_bgr(ctx: *mut fz_context) -> *mut fz_colorspace;
}
unsafe extern "C" {
    pub fn fz_device_cmyk(ctx: *mut fz_context) -> *mut fz_colorspace;
}
unsafe extern "C" {
    pub fn fz_device_lab(ctx: *mut fz_context) -> *mut fz_colorspace;
}
unsafe extern "C" {
    #[doc = "Assign a name for a given colorant in a colorspace.\n\nUsed while initially setting up a colorspace. The string is<br>copied into local storage, so need not be retained by the<br>caller."]
    pub fn fz_colorspace_name_colorant(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
        n: ::core::ffi::c_int,
        name: *const ::core::ffi::c_char,
    );
}
unsafe extern "C" {
    #[doc = "Retrieve a the name for a colorant.\n\nReturns a pointer with the same lifespan as the colorspace."]
    pub fn fz_colorspace_colorant(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
        n: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Clamp the samples in a color to the correct ranges for a<br>given colorspace."]
    pub fn fz_clamp_color(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
        in_: *const f32,
        out: *mut f32,
    );
}
unsafe extern "C" {
    #[doc = "Convert color values sv from colorspace ss into colorvalues dv<br>for colorspace ds, via an optional intervening space is,<br>respecting the given color_params."]
    pub fn fz_convert_color(
        ctx: *mut fz_context,
        ss: *mut fz_colorspace,
        sv: *const f32,
        ds: *mut fz_colorspace,
        dv: *mut f32,
        is: *mut fz_colorspace,
        params: fz_color_params,
    );
}
#[doc = "Structure to hold default colorspaces."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_default_colorspaces {
    pub refs: ::core::ffi::c_int,
    pub gray: *mut fz_colorspace,
    pub rgb: *mut fz_colorspace,
    pub cmyk: *mut fz_colorspace,
    pub oi: *mut fz_colorspace,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_default_colorspaces"][::core::mem::size_of::<fz_default_colorspaces>() - 40usize];
    ["Alignment of fz_default_colorspaces"]
        [::core::mem::align_of::<fz_default_colorspaces>() - 8usize];
    ["Offset of field: fz_default_colorspaces::refs"]
        [::core::mem::offset_of!(fz_default_colorspaces, refs) - 0usize];
    ["Offset of field: fz_default_colorspaces::gray"]
        [::core::mem::offset_of!(fz_default_colorspaces, gray) - 8usize];
    ["Offset of field: fz_default_colorspaces::rgb"]
        [::core::mem::offset_of!(fz_default_colorspaces, rgb) - 16usize];
    ["Offset of field: fz_default_colorspaces::cmyk"]
        [::core::mem::offset_of!(fz_default_colorspaces, cmyk) - 24usize];
    ["Offset of field: fz_default_colorspaces::oi"]
        [::core::mem::offset_of!(fz_default_colorspaces, oi) - 32usize];
};
unsafe extern "C" {
    #[doc = "Create a new default colorspace structure with values inherited<br>from the context, and return a reference to it.\n\nThese can be overridden using [`fz_set_default_xxxx`].\n\nThese should not be overridden while more than one caller has<br>the reference for fear of race conditions.\n\nThe caller should drop this reference once finished with it."]
    pub fn fz_new_default_colorspaces(ctx: *mut fz_context) -> *mut fz_default_colorspaces;
}
unsafe extern "C" {
    #[doc = "Keep an additional reference to the default colorspaces<br>structure.\n\nNever throws exceptions."]
    pub fn fz_keep_default_colorspaces(
        ctx: *mut fz_context,
        default_cs: *mut fz_default_colorspaces,
    ) -> *mut fz_default_colorspaces;
}
unsafe extern "C" {
    #[doc = "Drop a reference to the default colorspaces structure. When the<br>reference count reaches 0, the references it holds internally<br>to the underlying colorspaces will be dropped, and the structure<br>will be destroyed.\n\nNever throws exceptions."]
    pub fn fz_drop_default_colorspaces(
        ctx: *mut fz_context,
        default_cs: *mut fz_default_colorspaces,
    );
}
unsafe extern "C" {
    #[doc = "Returns a reference to a newly cloned default colorspaces<br>structure.\n\nThe new clone may safely be altered without fear of race<br>conditions as the caller is the only reference holder."]
    pub fn fz_clone_default_colorspaces(
        ctx: *mut fz_context,
        base: *mut fz_default_colorspaces,
    ) -> *mut fz_default_colorspaces;
}
unsafe extern "C" {
    #[doc = "Retrieve default colorspaces \\(typically page local\\).\n\nIf default_cs is non `NULL`, the default is retrieved from there,<br>otherwise the global default is retrieved.\n\nThese return borrowed references that should not be dropped,<br>unless they are kept first."]
    pub fn fz_default_gray(
        ctx: *mut fz_context,
        default_cs: *const fz_default_colorspaces,
    ) -> *mut fz_colorspace;
}
unsafe extern "C" {
    pub fn fz_default_rgb(
        ctx: *mut fz_context,
        default_cs: *const fz_default_colorspaces,
    ) -> *mut fz_colorspace;
}
unsafe extern "C" {
    pub fn fz_default_cmyk(
        ctx: *mut fz_context,
        default_cs: *const fz_default_colorspaces,
    ) -> *mut fz_colorspace;
}
unsafe extern "C" {
    pub fn fz_default_output_intent(
        ctx: *mut fz_context,
        default_cs: *const fz_default_colorspaces,
    ) -> *mut fz_colorspace;
}
unsafe extern "C" {
    #[doc = "Set new defaults within the default colorspace structure.\n\nNew references are taken to the new default, and references to<br>the old defaults dropped.\n\nNever throws exceptions."]
    pub fn fz_set_default_gray(
        ctx: *mut fz_context,
        default_cs: *mut fz_default_colorspaces,
        cs: *mut fz_colorspace,
    );
}
unsafe extern "C" {
    pub fn fz_set_default_rgb(
        ctx: *mut fz_context,
        default_cs: *mut fz_default_colorspaces,
        cs: *mut fz_colorspace,
    );
}
unsafe extern "C" {
    pub fn fz_set_default_cmyk(
        ctx: *mut fz_context,
        default_cs: *mut fz_default_colorspaces,
        cs: *mut fz_colorspace,
    );
}
unsafe extern "C" {
    pub fn fz_set_default_output_intent(
        ctx: *mut fz_context,
        default_cs: *mut fz_default_colorspaces,
        cs: *mut fz_colorspace,
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct fz_colorspace {
    pub key_storable: fz_key_storable,
    pub type_: fz_colorspace_type,
    pub flags: ::core::ffi::c_int,
    pub n: ::core::ffi::c_int,
    pub name: *mut ::core::ffi::c_char,
    pub u: fz_colorspace__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union fz_colorspace__bindgen_ty_1 {
    pub icc: fz_colorspace__bindgen_ty_1__bindgen_ty_1,
    pub indexed: fz_colorspace__bindgen_ty_1__bindgen_ty_2,
    pub separation: fz_colorspace__bindgen_ty_1__bindgen_ty_3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_colorspace__bindgen_ty_1__bindgen_ty_1 {
    pub buffer: *mut fz_buffer,
    pub md5: [::core::ffi::c_uchar; 16usize],
    pub profile: *mut fz_icc_profile,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_colorspace__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<fz_colorspace__bindgen_ty_1__bindgen_ty_1>() - 32usize];
    ["Alignment of fz_colorspace__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<fz_colorspace__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: fz_colorspace__bindgen_ty_1__bindgen_ty_1::buffer"]
        [::core::mem::offset_of!(fz_colorspace__bindgen_ty_1__bindgen_ty_1, buffer) - 0usize];
    ["Offset of field: fz_colorspace__bindgen_ty_1__bindgen_ty_1::md5"]
        [::core::mem::offset_of!(fz_colorspace__bindgen_ty_1__bindgen_ty_1, md5) - 8usize];
    ["Offset of field: fz_colorspace__bindgen_ty_1__bindgen_ty_1::profile"]
        [::core::mem::offset_of!(fz_colorspace__bindgen_ty_1__bindgen_ty_1, profile) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_colorspace__bindgen_ty_1__bindgen_ty_2 {
    pub base: *mut fz_colorspace,
    pub high: ::core::ffi::c_int,
    pub lookup: *mut ::core::ffi::c_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_colorspace__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::size_of::<fz_colorspace__bindgen_ty_1__bindgen_ty_2>() - 24usize];
    ["Alignment of fz_colorspace__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::align_of::<fz_colorspace__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: fz_colorspace__bindgen_ty_1__bindgen_ty_2::base"]
        [::core::mem::offset_of!(fz_colorspace__bindgen_ty_1__bindgen_ty_2, base) - 0usize];
    ["Offset of field: fz_colorspace__bindgen_ty_1__bindgen_ty_2::high"]
        [::core::mem::offset_of!(fz_colorspace__bindgen_ty_1__bindgen_ty_2, high) - 8usize];
    ["Offset of field: fz_colorspace__bindgen_ty_1__bindgen_ty_2::lookup"]
        [::core::mem::offset_of!(fz_colorspace__bindgen_ty_1__bindgen_ty_2, lookup) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_colorspace__bindgen_ty_1__bindgen_ty_3 {
    pub base: *mut fz_colorspace,
    pub eval: ::core::option::Option<
        unsafe extern "C" fn(
            ctx: *mut fz_context,
            tint: *mut ::core::ffi::c_void,
            s: *const f32,
            sn: ::core::ffi::c_int,
            d: *mut f32,
            dn: ::core::ffi::c_int,
        ),
    >,
    pub drop: ::core::option::Option<
        unsafe extern "C" fn(ctx: *mut fz_context, tint: *mut ::core::ffi::c_void),
    >,
    pub tint: *mut ::core::ffi::c_void,
    pub colorant: [*mut ::core::ffi::c_char; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_colorspace__bindgen_ty_1__bindgen_ty_3"]
        [::core::mem::size_of::<fz_colorspace__bindgen_ty_1__bindgen_ty_3>() - 288usize];
    ["Alignment of fz_colorspace__bindgen_ty_1__bindgen_ty_3"]
        [::core::mem::align_of::<fz_colorspace__bindgen_ty_1__bindgen_ty_3>() - 8usize];
    ["Offset of field: fz_colorspace__bindgen_ty_1__bindgen_ty_3::base"]
        [::core::mem::offset_of!(fz_colorspace__bindgen_ty_1__bindgen_ty_3, base) - 0usize];
    ["Offset of field: fz_colorspace__bindgen_ty_1__bindgen_ty_3::eval"]
        [::core::mem::offset_of!(fz_colorspace__bindgen_ty_1__bindgen_ty_3, eval) - 8usize];
    ["Offset of field: fz_colorspace__bindgen_ty_1__bindgen_ty_3::drop"]
        [::core::mem::offset_of!(fz_colorspace__bindgen_ty_1__bindgen_ty_3, drop) - 16usize];
    ["Offset of field: fz_colorspace__bindgen_ty_1__bindgen_ty_3::tint"]
        [::core::mem::offset_of!(fz_colorspace__bindgen_ty_1__bindgen_ty_3, tint) - 24usize];
    ["Offset of field: fz_colorspace__bindgen_ty_1__bindgen_ty_3::colorant"]
        [::core::mem::offset_of!(fz_colorspace__bindgen_ty_1__bindgen_ty_3, colorant) - 32usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_colorspace__bindgen_ty_1"]
        [::core::mem::size_of::<fz_colorspace__bindgen_ty_1>() - 288usize];
    ["Alignment of fz_colorspace__bindgen_ty_1"]
        [::core::mem::align_of::<fz_colorspace__bindgen_ty_1>() - 8usize];
    ["Offset of field: fz_colorspace__bindgen_ty_1::icc"]
        [::core::mem::offset_of!(fz_colorspace__bindgen_ty_1, icc) - 0usize];
    ["Offset of field: fz_colorspace__bindgen_ty_1::indexed"]
        [::core::mem::offset_of!(fz_colorspace__bindgen_ty_1, indexed) - 0usize];
    ["Offset of field: fz_colorspace__bindgen_ty_1::separation"]
        [::core::mem::offset_of!(fz_colorspace__bindgen_ty_1, separation) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_colorspace"][::core::mem::size_of::<fz_colorspace>() - 344usize];
    ["Alignment of fz_colorspace"][::core::mem::align_of::<fz_colorspace>() - 8usize];
    ["Offset of field: fz_colorspace::key_storable"]
        [::core::mem::offset_of!(fz_colorspace, key_storable) - 0usize];
    ["Offset of field: fz_colorspace::type_"]
        [::core::mem::offset_of!(fz_colorspace, type_) - 32usize];
    ["Offset of field: fz_colorspace::flags"]
        [::core::mem::offset_of!(fz_colorspace, flags) - 36usize];
    ["Offset of field: fz_colorspace::n"][::core::mem::offset_of!(fz_colorspace, n) - 40usize];
    ["Offset of field: fz_colorspace::name"]
        [::core::mem::offset_of!(fz_colorspace, name) - 48usize];
    ["Offset of field: fz_colorspace::u"][::core::mem::offset_of!(fz_colorspace, u) - 56usize];
};
unsafe extern "C" {
    pub fn fz_drop_colorspace_imp(ctx: *mut fz_context, cs_: *mut fz_storable);
}
unsafe extern "C" {
    pub static mut fz_glyph_name_from_adobe_standard: [*const ::core::ffi::c_char; 256usize];
}
unsafe extern "C" {
    pub static mut fz_glyph_name_from_iso8859_7: [*const ::core::ffi::c_char; 256usize];
}
unsafe extern "C" {
    pub static mut fz_glyph_name_from_koi8u: [*const ::core::ffi::c_char; 256usize];
}
unsafe extern "C" {
    pub static mut fz_glyph_name_from_mac_expert: [*const ::core::ffi::c_char; 256usize];
}
unsafe extern "C" {
    pub static mut fz_glyph_name_from_mac_roman: [*const ::core::ffi::c_char; 256usize];
}
unsafe extern "C" {
    pub static mut fz_glyph_name_from_win_ansi: [*const ::core::ffi::c_char; 256usize];
}
unsafe extern "C" {
    pub static mut fz_glyph_name_from_windows_1252: [*const ::core::ffi::c_char; 256usize];
}
unsafe extern "C" {
    pub static fz_unicode_from_iso8859_1: [::core::ffi::c_ushort; 256usize];
}
unsafe extern "C" {
    pub static fz_unicode_from_iso8859_7: [::core::ffi::c_ushort; 256usize];
}
unsafe extern "C" {
    pub static fz_unicode_from_koi8u: [::core::ffi::c_ushort; 256usize];
}
unsafe extern "C" {
    pub static fz_unicode_from_pdf_doc_encoding: [::core::ffi::c_ushort; 256usize];
}
unsafe extern "C" {
    pub static fz_unicode_from_windows_1250: [::core::ffi::c_ushort; 256usize];
}
unsafe extern "C" {
    pub static fz_unicode_from_windows_1251: [::core::ffi::c_ushort; 256usize];
}
unsafe extern "C" {
    pub static fz_unicode_from_windows_1252: [::core::ffi::c_ushort; 256usize];
}
unsafe extern "C" {
    pub fn fz_iso8859_1_from_unicode(u: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_iso8859_7_from_unicode(u: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_koi8u_from_unicode(u: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_windows_1250_from_unicode(u: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_windows_1251_from_unicode(u: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_windows_1252_from_unicode(u: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_unicode_from_glyph_name(name: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_unicode_from_glyph_name_strict(
        name: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_duplicate_glyph_names_from_unicode(
        unicode: ::core::ffi::c_int,
    ) -> *mut *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn fz_glyph_name_from_unicode_sc(unicode: ::core::ffi::c_int)
    -> *const ::core::ffi::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_text_decoder {
    pub decode_bound: ::core::option::Option<
        unsafe extern "C" fn(
            dec: *mut fz_text_decoder,
            input: *mut ::core::ffi::c_uchar,
            n: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub decode_size: ::core::option::Option<
        unsafe extern "C" fn(
            dec: *mut fz_text_decoder,
            input: *mut ::core::ffi::c_uchar,
            n: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub decode: ::core::option::Option<
        unsafe extern "C" fn(
            dec: *mut fz_text_decoder,
            output: *mut ::core::ffi::c_char,
            input: *mut ::core::ffi::c_uchar,
            n: ::core::ffi::c_int,
        ),
    >,
    pub table1: *mut ::core::ffi::c_void,
    pub table2: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_text_decoder"][::core::mem::size_of::<fz_text_decoder>() - 40usize];
    ["Alignment of fz_text_decoder"][::core::mem::align_of::<fz_text_decoder>() - 8usize];
    ["Offset of field: fz_text_decoder::decode_bound"]
        [::core::mem::offset_of!(fz_text_decoder, decode_bound) - 0usize];
    ["Offset of field: fz_text_decoder::decode_size"]
        [::core::mem::offset_of!(fz_text_decoder, decode_size) - 8usize];
    ["Offset of field: fz_text_decoder::decode"]
        [::core::mem::offset_of!(fz_text_decoder, decode) - 16usize];
    ["Offset of field: fz_text_decoder::table1"]
        [::core::mem::offset_of!(fz_text_decoder, table1) - 24usize];
    ["Offset of field: fz_text_decoder::table2"]
        [::core::mem::offset_of!(fz_text_decoder, table2) - 32usize];
};
unsafe extern "C" {
    pub fn fz_init_text_decoder(
        ctx: *mut fz_context,
        dec: *mut fz_text_decoder,
        encoding: *const ::core::ffi::c_char,
    );
}
unsafe extern "C" {
    #[doc = "Retrieve the FT_Face handle<br>for the font.\n\n`font`: The font to query\n\nReturns the FT_Face handle for the font, or `NULL`<br>if not a freetype handled font. \\(Cast to void *<br>to avoid nasty header exposure\\)."]
    pub fn fz_font_ft_face(ctx: *mut fz_context, font: *mut fz_font) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = "Retrieve the Type3 procs<br>for a font.\n\n`font`: The font to query\n\nReturns the t3_procs pointer. Will be `NULL` for a<br>non type-3 font."]
    pub fn fz_font_t3_procs(ctx: *mut fz_context, font: *mut fz_font) -> *mut *mut fz_buffer;
}
pub const FZ_ADOBE_CNS: _bindgen_ty_9 = 0;
pub const FZ_ADOBE_GB: _bindgen_ty_9 = 1;
pub const FZ_ADOBE_JAPAN: _bindgen_ty_9 = 2;
pub const FZ_ADOBE_KOREA: _bindgen_ty_9 = 3;
pub type _bindgen_ty_9 = ::core::ffi::c_int;
#[doc = "Every [`fz_font`] carries a set of flags<br>within it, in a [`fz_font_flags_t`] structure."]
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct fz_font_flags_t {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub __bindgen_padding_0: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_font_flags_t"][::core::mem::size_of::<fz_font_flags_t>() - 4usize];
    ["Alignment of fz_font_flags_t"][::core::mem::align_of::<fz_font_flags_t>() - 4usize];
};
impl fz_font_flags_t {
    #[inline]
    pub fn is_mono(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_is_mono(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn is_mono_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_is_mono_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn is_serif(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_is_serif(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn is_serif_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_is_serif_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn is_bold(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_is_bold(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn is_bold_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_is_bold_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn is_italic(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_is_italic(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn is_italic_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_is_italic_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ft_substitute(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_ft_substitute(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ft_substitute_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_ft_substitute_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ft_stretch(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_ft_stretch(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ft_stretch_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_ft_stretch_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn fake_bold(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_fake_bold(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn fake_bold_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                6usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_fake_bold_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                6usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn fake_italic(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_fake_italic(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn fake_italic_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                7usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_fake_italic_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn has_opentype(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_has_opentype(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn has_opentype_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_has_opentype_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn invalid_bbox(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_invalid_bbox(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn invalid_bbox_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                9usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_invalid_bbox_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                9usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn cjk(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_cjk(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn cjk_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                10usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_cjk_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                10usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn cjk_lang(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(11usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_cjk_lang(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(11usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn cjk_lang_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                11usize,
                2u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_cjk_lang_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                11usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn embed(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_embed(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn embed_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                13usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_embed_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                13usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn never_embed(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_never_embed(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn never_embed_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                14usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_never_embed_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                14usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        is_mono: ::core::ffi::c_uint,
        is_serif: ::core::ffi::c_uint,
        is_bold: ::core::ffi::c_uint,
        is_italic: ::core::ffi::c_uint,
        ft_substitute: ::core::ffi::c_uint,
        ft_stretch: ::core::ffi::c_uint,
        fake_bold: ::core::ffi::c_uint,
        fake_italic: ::core::ffi::c_uint,
        has_opentype: ::core::ffi::c_uint,
        invalid_bbox: ::core::ffi::c_uint,
        cjk: ::core::ffi::c_uint,
        cjk_lang: ::core::ffi::c_uint,
        embed: ::core::ffi::c_uint,
        never_embed: ::core::ffi::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let is_mono: u32 = unsafe { ::core::mem::transmute(is_mono) };
            is_mono as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let is_serif: u32 = unsafe { ::core::mem::transmute(is_serif) };
            is_serif as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let is_bold: u32 = unsafe { ::core::mem::transmute(is_bold) };
            is_bold as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let is_italic: u32 = unsafe { ::core::mem::transmute(is_italic) };
            is_italic as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let ft_substitute: u32 = unsafe { ::core::mem::transmute(ft_substitute) };
            ft_substitute as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let ft_stretch: u32 = unsafe { ::core::mem::transmute(ft_stretch) };
            ft_stretch as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let fake_bold: u32 = unsafe { ::core::mem::transmute(fake_bold) };
            fake_bold as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let fake_italic: u32 = unsafe { ::core::mem::transmute(fake_italic) };
            fake_italic as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let has_opentype: u32 = unsafe { ::core::mem::transmute(has_opentype) };
            has_opentype as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let invalid_bbox: u32 = unsafe { ::core::mem::transmute(invalid_bbox) };
            invalid_bbox as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let cjk: u32 = unsafe { ::core::mem::transmute(cjk) };
            cjk as u64
        });
        __bindgen_bitfield_unit.set(11usize, 2u8, {
            let cjk_lang: u32 = unsafe { ::core::mem::transmute(cjk_lang) };
            cjk_lang as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let embed: u32 = unsafe { ::core::mem::transmute(embed) };
            embed as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let never_embed: u32 = unsafe { ::core::mem::transmute(never_embed) };
            never_embed as u64
        });
        __bindgen_bitfield_unit
    }
}
unsafe extern "C" {
    #[doc = "Retrieve a pointer to the font flags<br>for a given font. These can then be updated as required.\n\n`font`: The font to query\n\nReturns a pointer to the flags structure \\(or `NULL`, if<br>the font is `NULL`\\)."]
    pub fn fz_font_flags(font: *mut fz_font) -> *mut fz_font_flags_t;
}
#[doc = "In order to shape a given font, we need to<br>declare it to a shaper library \\(harfbuzz, by default, but others<br>are possible\\). To avoid redeclaring it every time we need to<br>shape, we hold a shaper handle and the destructor for it within<br>the font itself. The handle is initialised by the caller when<br>first required and the destructor is called when the [`fz_font`] is<br>destroyed."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_shaper_data_t {
    pub shaper_handle: *mut ::core::ffi::c_void,
    pub destroy: ::core::option::Option<
        unsafe extern "C" fn(ctx: *mut fz_context, arg1: *mut ::core::ffi::c_void),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_shaper_data_t"][::core::mem::size_of::<fz_shaper_data_t>() - 16usize];
    ["Alignment of fz_shaper_data_t"][::core::mem::align_of::<fz_shaper_data_t>() - 8usize];
    ["Offset of field: fz_shaper_data_t::shaper_handle"]
        [::core::mem::offset_of!(fz_shaper_data_t, shaper_handle) - 0usize];
    ["Offset of field: fz_shaper_data_t::destroy"]
        [::core::mem::offset_of!(fz_shaper_data_t, destroy) - 8usize];
};
unsafe extern "C" {
    #[doc = "Retrieve a pointer to the shaper data<br>structure for the given font.\n\n`font`: The font to query.\n\nReturns a pointer to the shaper data structure \\(or `NULL` if<br>font is `NULL`\\)."]
    pub fn fz_font_shaper_data(ctx: *mut fz_context, font: *mut fz_font) -> *mut fz_shaper_data_t;
}
unsafe extern "C" {
    #[doc = "Retrieve a pointer to the name of the font.\n\n`font`: The font to query.\n\nReturns a pointer to an internal copy of the font name.<br>Will never be `NULL`, but may be the empty string."]
    pub fn fz_font_name(ctx: *mut fz_context, font: *mut fz_font) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Query whether the font flags say that this font is bold."]
    pub fn fz_font_is_bold(ctx: *mut fz_context, font: *mut fz_font) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Query whether the font flags say that this font is italic."]
    pub fn fz_font_is_italic(ctx: *mut fz_context, font: *mut fz_font) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Query whether the font flags say that this font is serif."]
    pub fn fz_font_is_serif(ctx: *mut fz_context, font: *mut fz_font) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Query whether the font flags say that this font is monospaced."]
    pub fn fz_font_is_monospaced(ctx: *mut fz_context, font: *mut fz_font) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Retrieve the font bbox.\n\n`font`: The font to query.\n\nReturns the font bbox by value; it is valid only if<br>[`fz_font_flags`]\\(font\\)-\\>invalid_bbox is zero."]
    pub fn fz_font_bbox(ctx: *mut fz_context, font: *mut fz_font) -> fz_rect;
}
#[doc = "Type for user supplied system font loading hook.\n\n`name`: The name of the font to load.\n\n`bold`: 1 if a bold font desired, 0 otherwise.\n\n`italic`: 1 if an italic font desired, 0 otherwise.<br>`needs_exact_metrics`: 1 if an exact metric match is required for<br>the font requested.\n\nReturns a new font handle, or `NULL` if no font found \\(or on error\\)."]
pub type fz_load_system_font_fn = ::core::option::Option<
    unsafe extern "C" fn(
        ctx: *mut fz_context,
        name: *const ::core::ffi::c_char,
        bold: ::core::ffi::c_int,
        italic: ::core::ffi::c_int,
        needs_exact_metrics: ::core::ffi::c_int,
    ) -> *mut fz_font,
>;
#[doc = "Type for user supplied cjk font loading hook.\n\n`name`: The name of the font to load.\n\n`ordering`: The ordering for which to load the font \\(e.g.<br>[`FZ_ADOBE_KOREA`]\\)\n\n`serif`: 1 if a serif font is desired, 0 otherwise.\n\nReturns a new font handle, or `NULL` if no font found \\(or on error\\)."]
pub type fz_load_system_cjk_font_fn = ::core::option::Option<
    unsafe extern "C" fn(
        ctx: *mut fz_context,
        name: *const ::core::ffi::c_char,
        ordering: ::core::ffi::c_int,
        serif: ::core::ffi::c_int,
    ) -> *mut fz_font,
>;
#[doc = "Type for user supplied fallback font loading hook.\n\n`name`: The name of the font to load.\n\n`script`: UCDN script enum.\n\n`language`: [`FZ_LANG`] enum.\n\n`serif`, `bold`, `italic`: boolean style flags.\n\nReturns a new font handle, or `NULL` if no font found \\(or on error\\)."]
pub type fz_load_system_fallback_font_fn = ::core::option::Option<
    unsafe extern "C" fn(
        ctx: *mut fz_context,
        script: ::core::ffi::c_int,
        language: ::core::ffi::c_int,
        serif: ::core::ffi::c_int,
        bold: ::core::ffi::c_int,
        italic: ::core::ffi::c_int,
    ) -> *mut fz_font,
>;
unsafe extern "C" {
    #[doc = "Install functions to allow MuPDF to request fonts from the<br>system.\n\nOnly one set of hooks can be in use at a time."]
    pub fn fz_install_load_system_font_funcs(
        ctx: *mut fz_context,
        f: fz_load_system_font_fn,
        f_cjk: fz_load_system_cjk_font_fn,
        f_fallback: fz_load_system_fallback_font_fn,
    );
}
unsafe extern "C" {
    #[doc = "Attempt to load a given font from the system.\n\n`name`: The name of the desired font.\n\n`bold`: 1 if bold desired, 0 otherwise.\n\n`italic`: 1 if italic desired, 0 otherwise.\n\n`needs_exact_metrics`: 1 if an exact metrical match is required,<br>0 otherwise.\n\nReturns a new font handle, or `NULL` if no matching font was found<br>\\(or on error\\)."]
    pub fn fz_load_system_font(
        ctx: *mut fz_context,
        name: *const ::core::ffi::c_char,
        bold: ::core::ffi::c_int,
        italic: ::core::ffi::c_int,
        needs_exact_metrics: ::core::ffi::c_int,
    ) -> *mut fz_font;
}
unsafe extern "C" {
    #[doc = "Attempt to load a given font from<br>the system.\n\n`name`: The name of the desired font.\n\n`ordering`: The ordering to load the font from \\(e.g. [`FZ_ADOBE_KOREA`]\\)\n\n`serif`: 1 if serif desired, 0 otherwise.\n\nReturns a new font handle, or `NULL` if no matching font was found<br>\\(or on error\\)."]
    pub fn fz_load_system_cjk_font(
        ctx: *mut fz_context,
        name: *const ::core::ffi::c_char,
        ordering: ::core::ffi::c_int,
        serif: ::core::ffi::c_int,
    ) -> *mut fz_font;
}
unsafe extern "C" {
    #[doc = "Search the builtin fonts for a match.<br>Whether a given font is present or not will depend on the<br>configuration in which MuPDF is built.\n\n`name`: The name of the font desired.\n\n`bold`: 1 if bold desired, 0 otherwise.\n\n`italic`: 1 if italic desired, 0 otherwise.\n\n`len`: Pointer to a place to receive the length of the discovered<br>font buffer.\n\nReturns a pointer to the font file data, or `NULL` if not present."]
    pub fn fz_lookup_builtin_font(
        ctx: *mut fz_context,
        name: *const ::core::ffi::c_char,
        bold: ::core::ffi::c_int,
        italic: ::core::ffi::c_int,
        len: *mut ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_uchar;
}
unsafe extern "C" {
    #[doc = "Search the builtin base14 fonts for a match.<br>Whether a given font is present or not will depend on the<br>configuration in which MuPDF is built.\n\n`name`: The name of the font desired.\n\n`len`: Pointer to a place to receive the length of the discovered<br>font buffer.\n\nReturns a pointer to the font file data, or `NULL` if not present."]
    pub fn fz_lookup_base14_font(
        ctx: *mut fz_context,
        name: *const ::core::ffi::c_char,
        len: *mut ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_uchar;
}
unsafe extern "C" {
    #[doc = "Search the builtin cjk fonts for a match.<br>Whether a font is present or not will depend on the<br>configuration in which MuPDF is built.\n\n`ordering`: The desired ordering of the font \\(e.g. [`FZ_ADOBE_KOREA`]\\).\n\n`len`: Pointer to a place to receive the length of the discovered<br>font buffer.\n\nReturns a pointer to the font file data, or `NULL` if not present."]
    pub fn fz_lookup_cjk_font(
        ctx: *mut fz_context,
        ordering: ::core::ffi::c_int,
        len: *mut ::core::ffi::c_int,
        index: *mut ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_uchar;
}
unsafe extern "C" {
    #[doc = "Search the builtin cjk fonts for a match for a given language.<br>Whether a font is present or not will depend on the<br>configuration in which MuPDF is built.\n\n`lang`: Pointer to a \\(case sensitive\\) language string \\(e.g.<br>\"ja\", \"ko\", \"zh-Hant\" etc\\).\n\n`len`: Pointer to a place to receive the length of the discovered<br>font buffer.\n\n`subfont`: Pointer to a place to store the subfont index of the<br>discovered font.\n\nReturns a pointer to the font file data, or `NULL` if not present."]
    pub fn fz_lookup_cjk_font_by_language(
        ctx: *mut fz_context,
        lang: *const ::core::ffi::c_char,
        len: *mut ::core::ffi::c_int,
        subfont: *mut ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_uchar;
}
unsafe extern "C" {
    #[doc = "Return the matching `FZ_ADOBE_*` ordering<br>for the given language tag, such as \"zh-Hant\", \"zh-Hans\", \"ja\", or \"ko\"."]
    pub fn fz_lookup_cjk_ordering_by_language(
        name: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Search the builtin noto fonts for a match.<br>Whether a font is present or not will depend on the<br>configuration in which MuPDF is built.\n\n`script`: The script desired \\(e.g. UCDN_SCRIPT_KATAKANA\\).\n\n`lang`: The language desired \\(e.g. [`FZ_LANG_ja`]\\).\n\n`len`: Pointer to a place to receive the length of the discovered<br>font buffer.\n\nReturns a pointer to the font file data, or `NULL` if not present."]
    pub fn fz_lookup_noto_font(
        ctx: *mut fz_context,
        script: ::core::ffi::c_int,
        lang: ::core::ffi::c_int,
        len: *mut ::core::ffi::c_int,
        subfont: *mut ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_uchar;
}
unsafe extern "C" {
    #[doc = "Search the builtin noto fonts specific symbol fonts.<br>Whether a font is present or not will depend on the<br>configuration in which MuPDF is built."]
    pub fn fz_lookup_noto_math_font(
        ctx: *mut fz_context,
        len: *mut ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_uchar;
}
unsafe extern "C" {
    pub fn fz_lookup_noto_music_font(
        ctx: *mut fz_context,
        len: *mut ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_uchar;
}
unsafe extern "C" {
    pub fn fz_lookup_noto_symbol1_font(
        ctx: *mut fz_context,
        len: *mut ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_uchar;
}
unsafe extern "C" {
    pub fn fz_lookup_noto_symbol2_font(
        ctx: *mut fz_context,
        len: *mut ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_uchar;
}
unsafe extern "C" {
    pub fn fz_lookup_noto_emoji_font(
        ctx: *mut fz_context,
        len: *mut ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_uchar;
}
unsafe extern "C" {
    pub fn fz_lookup_noto_boxes_font(
        ctx: *mut fz_context,
        len: *mut ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_uchar;
}
unsafe extern "C" {
    #[doc = "Look up the Noto font file name for a given script.<br>From the returned font stem, you can look for Noto fonts on the system in the form:<br>Noto\\(Sans|Serif\\)${STEM}-Regular.\\(otf|ttf\\)"]
    pub fn fz_lookup_noto_stem_from_script(
        ctx: *mut fz_context,
        script: ::core::ffi::c_int,
        language: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn fz_lookup_script_name(
        ctx: *mut fz_context,
        script: ::core::ffi::c_int,
        language: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Try to load a fallback font for the<br>given combination of font attributes. Whether a font is<br>present or not will depend on the configuration in which<br>MuPDF is built.\n\n`script`: The script desired \\(e.g. UCDN_SCRIPT_KATAKANA\\).\n\n`language`: The language desired \\(e.g. [`FZ_LANG_ja`]\\).\n\n`serif`: 1 if serif desired, 0 otherwise.\n\n`bold`: 1 if bold desired, 0 otherwise.\n\n`italic`: 1 if italic desired, 0 otherwise.\n\nReturns a new font handle, or `NULL` if not available."]
    pub fn fz_load_fallback_font(
        ctx: *mut fz_context,
        script: ::core::ffi::c_int,
        language: ::core::ffi::c_int,
        serif: ::core::ffi::c_int,
        bold: ::core::ffi::c_int,
        italic: ::core::ffi::c_int,
    ) -> *mut fz_font;
}
unsafe extern "C" {
    #[doc = "Create a new \\(empty\\) type3 font.\n\n`name`: Name of font \\(or `NULL`\\).\n\n`matrix`: Font matrix.\n\nReturns a new font handle, or throws exception on<br>allocation failure."]
    pub fn fz_new_type3_font(
        ctx: *mut fz_context,
        name: *const ::core::ffi::c_char,
        matrix: fz_matrix,
    ) -> *mut fz_font;
}
unsafe extern "C" {
    #[doc = "Create a new font from a font file in memory.\n\nFonts created in this way, will be eligible for embedding by default.\n\n`name`: Name of font \\(leave `NULL` to use name from font\\).\n\n`data`: Pointer to the font file data.\n\n`len`: Length of the font file data.\n\n`index`: Which font from the file to load \\(0 for default\\).\n\n`use_glyph_box`: 1 if we should use the glyph bbox, 0 otherwise.\n\nReturns new font handle, or throws exception on error."]
    pub fn fz_new_font_from_memory(
        ctx: *mut fz_context,
        name: *const ::core::ffi::c_char,
        data: *const ::core::ffi::c_uchar,
        len: ::core::ffi::c_int,
        index: ::core::ffi::c_int,
        use_glyph_bbox: ::core::ffi::c_int,
    ) -> *mut fz_font;
}
unsafe extern "C" {
    #[doc = "Create a new font from a font file in a [`fz_buffer`].\n\nFonts created in this way, will be eligible for embedding by default.\n\n`name`: Name of font \\(leave `NULL` to use name from font\\).\n\n`buffer`: Buffer to load from.\n\n`index`: Which font from the file to load \\(0 for default\\).\n\n`use_glyph_box`: 1 if we should use the glyph bbox, 0 otherwise.\n\nReturns new font handle, or throws exception on error."]
    pub fn fz_new_font_from_buffer(
        ctx: *mut fz_context,
        name: *const ::core::ffi::c_char,
        buffer: *mut fz_buffer,
        index: ::core::ffi::c_int,
        use_glyph_bbox: ::core::ffi::c_int,
    ) -> *mut fz_font;
}
unsafe extern "C" {
    #[doc = "Create a new font from a font file.\n\nFonts created in this way, will be eligible for embedding by default.\n\n`name`: Name of font \\(leave `NULL` to use name from font\\).\n\n`path`: File path to load from.\n\n`index`: Which font from the file to load \\(0 for default\\).\n\n`use_glyph_box`: 1 if we should use the glyph bbox, 0 otherwise.\n\nReturns new font handle, or throws exception on error."]
    pub fn fz_new_font_from_file(
        ctx: *mut fz_context,
        name: *const ::core::ffi::c_char,
        path: *const ::core::ffi::c_char,
        index: ::core::ffi::c_int,
        use_glyph_bbox: ::core::ffi::c_int,
    ) -> *mut fz_font;
}
unsafe extern "C" {
    #[doc = "Create a new font from one of the built-in fonts."]
    pub fn fz_new_base14_font(
        ctx: *mut fz_context,
        name: *const ::core::ffi::c_char,
    ) -> *mut fz_font;
}
unsafe extern "C" {
    pub fn fz_new_cjk_font(ctx: *mut fz_context, ordering: ::core::ffi::c_int) -> *mut fz_font;
}
unsafe extern "C" {
    pub fn fz_new_builtin_font(
        ctx: *mut fz_context,
        name: *const ::core::ffi::c_char,
        is_bold: ::core::ffi::c_int,
        is_italic: ::core::ffi::c_int,
    ) -> *mut fz_font;
}
unsafe extern "C" {
    #[doc = "Control whether a given font should be embedded or not when writing."]
    pub fn fz_set_font_embedding(
        ctx: *mut fz_context,
        font: *mut fz_font,
        embed: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    #[doc = "Add a reference to an existing [`fz_font`].\n\n`font`: The font to add a reference to.\n\nReturns the same font."]
    pub fn fz_keep_font(ctx: *mut fz_context, font: *mut fz_font) -> *mut fz_font;
}
unsafe extern "C" {
    #[doc = "Drop a reference to a [`fz_font`], destroying the<br>font when the last reference is dropped.\n\n`font`: The font to drop a reference to."]
    pub fn fz_drop_font(ctx: *mut fz_context, font: *mut fz_font);
}
unsafe extern "C" {
    #[doc = "Set the font bbox.\n\n`font`: The font to set the bbox for.\n\n`xmin`, `ymin`, `xmax`, `ymax`: The bounding box."]
    pub fn fz_set_font_bbox(
        ctx: *mut fz_context,
        font: *mut fz_font,
        xmin: f32,
        ymin: f32,
        xmax: f32,
        ymax: f32,
    );
}
unsafe extern "C" {
    #[doc = "Return a bbox for a given glyph in a font.\n\n`font`: The font to look for the glyph in.\n\n`gid`: The glyph to bound.\n\n`trm`: The matrix to apply to the glyph before bounding.\n\nReturns rectangle by value containing the bounds of the given<br>glyph."]
    pub fn fz_bound_glyph(
        ctx: *mut fz_context,
        font: *mut fz_font,
        gid: ::core::ffi::c_int,
        trm: fz_matrix,
    ) -> fz_rect;
}
unsafe extern "C" {
    #[doc = "Determine if a given glyph in a font<br>is cacheable. Certain glyphs in a type 3 font cannot safely<br>be cached, as their appearance depends on the enclosing<br>graphic state.\n\n`font`: The font to look for the glyph in.\n\n`gif`: The glyph to query.\n\nReturns non-zero if cacheable, 0 if not."]
    pub fn fz_glyph_cacheable(
        ctx: *mut fz_context,
        font: *mut fz_font,
        gid: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Run a glyph from a Type3 font to<br>a given device.\n\n`font`: The font to find the glyph in.\n\n`gid`: The glyph to run.\n\n`trm`: The transform to apply.\n\n`dev`: The device to render onto."]
    pub fn fz_run_t3_glyph(
        ctx: *mut fz_context,
        font: *mut fz_font,
        gid: ::core::ffi::c_int,
        trm: fz_matrix,
        dev: *mut fz_device,
    );
}
unsafe extern "C" {
    #[doc = "Return the advance for a given glyph.\n\n`font`: The font to look for the glyph in.\n\n`glyph`: The glyph to find the advance for.\n\n`wmode`: 1 for vertical mode, 0 for horizontal.\n\nReturns the advance for the glyph."]
    pub fn fz_advance_glyph(
        ctx: *mut fz_context,
        font: *mut fz_font,
        glyph: ::core::ffi::c_int,
        wmode: ::core::ffi::c_int,
    ) -> f32;
}
unsafe extern "C" {
    #[doc = "Find the glyph id for a given unicode<br>character within a font.\n\n`font`: The font to look for the unicode character in.\n\n`unicode`: The unicode character to encode.\n\nReturns the glyph id for the given unicode value, or 0 if<br>unknown."]
    pub fn fz_encode_character(
        ctx: *mut fz_context,
        font: *mut fz_font,
        unicode: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Encode character, preferring small-caps variant if available.\n\n`font`: The font to look for the unicode character in.\n\n`unicode`: The unicode character to encode.\n\nReturns the glyph id for the given unicode value, or 0 if<br>unknown."]
    pub fn fz_encode_character_sc(
        ctx: *mut fz_context,
        font: *mut fz_font,
        unicode: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Encode character.\n\nEither by direct lookup of glyphname within a font, or, failing<br>that, by mapping glyphname to unicode and thence to the glyph<br>index within the given font.\n\nReturns zero for type3 fonts."]
    pub fn fz_encode_character_by_glyph_name(
        ctx: *mut fz_context,
        font: *mut fz_font,
        glyphname: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Find the glyph id for<br>a given unicode character within a font, falling back to<br>an alternative if not found.\n\n`font`: The font to look for the unicode character in.\n\n`unicode`: The unicode character to encode.\n\n`script`: The script in use.\n\n`language`: The language in use.\n\n`out_font`: The font handle in which the given glyph represents<br>the requested unicode character. The caller does not own the<br>reference it is passed, so should call [`fz_keep_font`] if it is<br>not simply to be used immediately.\n\nReturns the glyph id for the given unicode value in the supplied<br>font \\(and sets *out_font to font\\) if it is present. Otherwise<br>an alternative fallback font \\(based on script/language\\) is<br>searched for. If the glyph is found therein, *out_font is set<br>to this reference, and the glyph reference is returned. If it<br>cannot be found anywhere, the function returns 0."]
    pub fn fz_encode_character_with_fallback(
        ctx: *mut fz_context,
        font: *mut fz_font,
        unicode: ::core::ffi::c_int,
        script: ::core::ffi::c_int,
        language: ::core::ffi::c_int,
        out_font: *mut *mut fz_font,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Find the name of a glyph\n\n`font`: The font to look for the glyph in.\n\n`glyph`: The glyph id to look for.\n\n`buf`: Pointer to a buffer for the name to be inserted into.\n\n`size`: The size of the buffer.\n\nIf a font contains a name table, then the name of the glyph<br>will be returned in the supplied buffer. Otherwise a name<br>is synthesised. The name will be truncated to fit in<br>the buffer."]
    pub fn fz_get_glyph_name(
        ctx: *mut fz_context,
        font: *mut fz_font,
        glyph: ::core::ffi::c_int,
        buf: *mut ::core::ffi::c_char,
        size: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    #[doc = "Retrieve font ascender in ems."]
    pub fn fz_font_ascender(ctx: *mut fz_context, font: *mut fz_font) -> f32;
}
unsafe extern "C" {
    #[doc = "Retrieve font descender in ems."]
    pub fn fz_font_descender(ctx: *mut fz_context, font: *mut fz_font) -> f32;
}
unsafe extern "C" {
    #[doc = "Retrieve the MD5 digest for the font's data."]
    pub fn fz_font_digest(
        ctx: *mut fz_context,
        font: *mut fz_font,
        digest: *mut ::core::ffi::c_uchar,
    );
}
unsafe extern "C" {
    pub fn fz_decouple_type3_font(
        ctx: *mut fz_context,
        font: *mut fz_font,
        t3doc: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    #[doc = "Lock against Harfbuzz being called<br>simultaneously in several threads. This reuses<br>[`FZ_LOCK_FREETYPE`]."]
    pub fn fz_hb_lock(ctx: *mut fz_context);
}
unsafe extern "C" {
    #[doc = "Unlock after a Harfbuzz call. This reuses<br>[`FZ_LOCK_FREETYPE`]."]
    pub fn fz_hb_unlock(ctx: *mut fz_context);
}
#[doc = "Callback for use in font cmap enumeration."]
pub type fz_cmap_callback = ::core::option::Option<
    unsafe extern "C" fn(
        ctx: *mut fz_context,
        opaque: *mut ::core::ffi::c_void,
        ucs: ::core::ffi::c_ulong,
        gid: ::core::ffi::c_uint,
    ),
>;
unsafe extern "C" {
    #[doc = "Enumerate a cmap using a callback."]
    pub fn fz_enumerate_font_cmap(
        ctx: *mut fz_context,
        font: *mut fz_font,
        cb: fz_cmap_callback,
        opaque: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    #[doc = "Ensure that a font has its ascender/descender values calculated<br>from the actual bbox of the glyphs.\n\nNote, that we combine the declared values from the font \\(or the<br>default values if those are not present\\) with the actual bbox to<br>get the final result. So this can only cause ascender/descender<br>to move further apart!"]
    pub fn fz_calculate_font_ascender_descender(ctx: *mut fz_context, font: *mut fz_font);
}
pub const FZ_ASCDESC_FROM_FONT: fz_ascdesc_source = 0;
pub const FZ_ASCDESC_DEFAULT: fz_ascdesc_source = 1;
pub const FZ_ASCDESC_FROM_BOUNDS: fz_ascdesc_source = 2;
pub type fz_ascdesc_source = ::core::ffi::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_font {
    pub refs: ::core::ffi::c_int,
    pub name: [::core::ffi::c_char; 32usize],
    pub family: [::core::ffi::c_char; 32usize],
    pub buffer: *mut fz_buffer,
    pub flags: fz_font_flags_t,
    pub ft_face: *mut ::core::ffi::c_void,
    pub shaper_data: fz_shaper_data_t,
    pub t3matrix: fz_matrix,
    pub t3resources: *mut ::core::ffi::c_void,
    pub t3procs: *mut *mut fz_buffer,
    pub t3lists: *mut *mut fz_display_list,
    pub t3widths: *mut f32,
    pub t3flags: *mut ::core::ffi::c_ushort,
    pub t3doc: *mut ::core::ffi::c_void,
    pub t3run: ::core::option::Option<
        unsafe extern "C" fn(
            ctx: *mut fz_context,
            doc: *mut ::core::ffi::c_void,
            resources: *mut ::core::ffi::c_void,
            contents: *mut fz_buffer,
            dev: *mut fz_device,
            ctm: fz_matrix,
            gstate: *mut ::core::ffi::c_void,
            default_cs: *mut fz_default_colorspaces,
            fill_gstate: *mut ::core::ffi::c_void,
            stroke_gstate: *mut ::core::ffi::c_void,
        ),
    >,
    pub t3freeres: ::core::option::Option<
        unsafe extern "C" fn(
            ctx: *mut fz_context,
            doc: *mut ::core::ffi::c_void,
            resources: *mut ::core::ffi::c_void,
        ),
    >,
    pub bbox: fz_rect,
    pub ascender: f32,
    pub descender: f32,
    pub ascdesc_src: fz_ascdesc_source,
    pub glyph_count: ::core::ffi::c_int,
    pub bbox_table: *mut *mut fz_rect,
    pub use_glyph_bbox: ::core::ffi::c_int,
    pub width_count: ::core::ffi::c_int,
    pub width_default: ::core::ffi::c_short,
    pub width_table: *mut ::core::ffi::c_short,
    pub advance_cache: *mut *mut f32,
    pub encoding_cache: [*mut u16; 256usize],
    pub has_digest: ::core::ffi::c_int,
    pub digest: [::core::ffi::c_uchar; 16usize],
    pub subfont: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_font"][::core::mem::size_of::<fz_font>() - 2344usize];
    ["Alignment of fz_font"][::core::mem::align_of::<fz_font>() - 8usize];
    ["Offset of field: fz_font::refs"][::core::mem::offset_of!(fz_font, refs) - 0usize];
    ["Offset of field: fz_font::name"][::core::mem::offset_of!(fz_font, name) - 4usize];
    ["Offset of field: fz_font::family"][::core::mem::offset_of!(fz_font, family) - 36usize];
    ["Offset of field: fz_font::buffer"][::core::mem::offset_of!(fz_font, buffer) - 72usize];
    ["Offset of field: fz_font::flags"][::core::mem::offset_of!(fz_font, flags) - 80usize];
    ["Offset of field: fz_font::ft_face"][::core::mem::offset_of!(fz_font, ft_face) - 88usize];
    ["Offset of field: fz_font::shaper_data"]
        [::core::mem::offset_of!(fz_font, shaper_data) - 96usize];
    ["Offset of field: fz_font::t3matrix"][::core::mem::offset_of!(fz_font, t3matrix) - 112usize];
    ["Offset of field: fz_font::t3resources"]
        [::core::mem::offset_of!(fz_font, t3resources) - 136usize];
    ["Offset of field: fz_font::t3procs"][::core::mem::offset_of!(fz_font, t3procs) - 144usize];
    ["Offset of field: fz_font::t3lists"][::core::mem::offset_of!(fz_font, t3lists) - 152usize];
    ["Offset of field: fz_font::t3widths"][::core::mem::offset_of!(fz_font, t3widths) - 160usize];
    ["Offset of field: fz_font::t3flags"][::core::mem::offset_of!(fz_font, t3flags) - 168usize];
    ["Offset of field: fz_font::t3doc"][::core::mem::offset_of!(fz_font, t3doc) - 176usize];
    ["Offset of field: fz_font::t3run"][::core::mem::offset_of!(fz_font, t3run) - 184usize];
    ["Offset of field: fz_font::t3freeres"][::core::mem::offset_of!(fz_font, t3freeres) - 192usize];
    ["Offset of field: fz_font::bbox"][::core::mem::offset_of!(fz_font, bbox) - 200usize];
    ["Offset of field: fz_font::ascender"][::core::mem::offset_of!(fz_font, ascender) - 216usize];
    ["Offset of field: fz_font::descender"][::core::mem::offset_of!(fz_font, descender) - 220usize];
    ["Offset of field: fz_font::ascdesc_src"]
        [::core::mem::offset_of!(fz_font, ascdesc_src) - 224usize];
    ["Offset of field: fz_font::glyph_count"]
        [::core::mem::offset_of!(fz_font, glyph_count) - 228usize];
    ["Offset of field: fz_font::bbox_table"]
        [::core::mem::offset_of!(fz_font, bbox_table) - 232usize];
    ["Offset of field: fz_font::use_glyph_bbox"]
        [::core::mem::offset_of!(fz_font, use_glyph_bbox) - 240usize];
    ["Offset of field: fz_font::width_count"]
        [::core::mem::offset_of!(fz_font, width_count) - 244usize];
    ["Offset of field: fz_font::width_default"]
        [::core::mem::offset_of!(fz_font, width_default) - 248usize];
    ["Offset of field: fz_font::width_table"]
        [::core::mem::offset_of!(fz_font, width_table) - 256usize];
    ["Offset of field: fz_font::advance_cache"]
        [::core::mem::offset_of!(fz_font, advance_cache) - 264usize];
    ["Offset of field: fz_font::encoding_cache"]
        [::core::mem::offset_of!(fz_font, encoding_cache) - 272usize];
    ["Offset of field: fz_font::has_digest"]
        [::core::mem::offset_of!(fz_font, has_digest) - 2320usize];
    ["Offset of field: fz_font::digest"][::core::mem::offset_of!(fz_font, digest) - 2324usize];
    ["Offset of field: fz_font::subfont"][::core::mem::offset_of!(fz_font, subfont) - 2340usize];
};
unsafe extern "C" {
    pub fn fz_ft_lock(ctx: *mut fz_context);
}
unsafe extern "C" {
    pub fn fz_ft_unlock(ctx: *mut fz_context);
}
unsafe extern "C" {
    pub fn fz_ft_lock_held(ctx: *mut fz_context) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fz_extract_ttf_from_ttc(ctx: *mut fz_context, font: *mut fz_font) -> *mut fz_buffer;
}
unsafe extern "C" {
    pub fn fz_subset_ttf_for_gids(
        ctx: *mut fz_context,
        orig: *mut fz_buffer,
        gids: *mut ::core::ffi::c_int,
        num_gids: ::core::ffi::c_int,
        symbolic: ::core::ffi::c_int,
        cidfont: ::core::ffi::c_int,
    ) -> *mut fz_buffer;
}
unsafe extern "C" {
    pub fn fz_subset_cff_for_gids(
        ctx: *mut fz_context,
        orig: *mut fz_buffer,
        gids: *mut ::core::ffi::c_int,
        num_gids: ::core::ffi::c_int,
        symbolic: ::core::ffi::c_int,
        cidfont: ::core::ffi::c_int,
    ) -> *mut fz_buffer;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_path {
    _unused: [u8; 0],
}
pub const FZ_LINECAP_BUTT: fz_linecap = 0;
pub const FZ_LINECAP_ROUND: fz_linecap = 1;
pub const FZ_LINECAP_SQUARE: fz_linecap = 2;
pub const FZ_LINECAP_TRIANGLE: fz_linecap = 3;
pub type fz_linecap = ::core::ffi::c_int;
pub const FZ_LINEJOIN_MITER: fz_linejoin = 0;
pub const FZ_LINEJOIN_ROUND: fz_linejoin = 1;
pub const FZ_LINEJOIN_BEVEL: fz_linejoin = 2;
pub const FZ_LINEJOIN_MITER_XPS: fz_linejoin = 3;
pub type fz_linejoin = ::core::ffi::c_int;
#[repr(C)]
#[derive(Debug)]
pub struct fz_stroke_state {
    pub refs: ::core::ffi::c_int,
    pub start_cap: fz_linecap,
    pub dash_cap: fz_linecap,
    pub end_cap: fz_linecap,
    pub linejoin: fz_linejoin,
    pub linewidth: f32,
    pub miterlimit: f32,
    pub dash_phase: f32,
    pub dash_len: ::core::ffi::c_int,
    pub dash_list: __IncompleteArrayField<f32>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_stroke_state"][::core::mem::size_of::<fz_stroke_state>() - 36usize];
    ["Alignment of fz_stroke_state"][::core::mem::align_of::<fz_stroke_state>() - 4usize];
    ["Offset of field: fz_stroke_state::refs"]
        [::core::mem::offset_of!(fz_stroke_state, refs) - 0usize];
    ["Offset of field: fz_stroke_state::start_cap"]
        [::core::mem::offset_of!(fz_stroke_state, start_cap) - 4usize];
    ["Offset of field: fz_stroke_state::dash_cap"]
        [::core::mem::offset_of!(fz_stroke_state, dash_cap) - 8usize];
    ["Offset of field: fz_stroke_state::end_cap"]
        [::core::mem::offset_of!(fz_stroke_state, end_cap) - 12usize];
    ["Offset of field: fz_stroke_state::linejoin"]
        [::core::mem::offset_of!(fz_stroke_state, linejoin) - 16usize];
    ["Offset of field: fz_stroke_state::linewidth"]
        [::core::mem::offset_of!(fz_stroke_state, linewidth) - 20usize];
    ["Offset of field: fz_stroke_state::miterlimit"]
        [::core::mem::offset_of!(fz_stroke_state, miterlimit) - 24usize];
    ["Offset of field: fz_stroke_state::dash_phase"]
        [::core::mem::offset_of!(fz_stroke_state, dash_phase) - 28usize];
    ["Offset of field: fz_stroke_state::dash_len"]
        [::core::mem::offset_of!(fz_stroke_state, dash_len) - 32usize];
    ["Offset of field: fz_stroke_state::dash_list"]
        [::core::mem::offset_of!(fz_stroke_state, dash_list) - 36usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_path_walker {
    pub moveto: ::core::option::Option<
        unsafe extern "C" fn(ctx: *mut fz_context, arg: *mut ::core::ffi::c_void, x: f32, y: f32),
    >,
    pub lineto: ::core::option::Option<
        unsafe extern "C" fn(ctx: *mut fz_context, arg: *mut ::core::ffi::c_void, x: f32, y: f32),
    >,
    pub curveto: ::core::option::Option<
        unsafe extern "C" fn(
            ctx: *mut fz_context,
            arg: *mut ::core::ffi::c_void,
            x1: f32,
            y1: f32,
            x2: f32,
            y2: f32,
            x3: f32,
            y3: f32,
        ),
    >,
    pub closepath: ::core::option::Option<
        unsafe extern "C" fn(ctx: *mut fz_context, arg: *mut ::core::ffi::c_void),
    >,
    pub quadto: ::core::option::Option<
        unsafe extern "C" fn(
            ctx: *mut fz_context,
            arg: *mut ::core::ffi::c_void,
            x1: f32,
            y1: f32,
            x2: f32,
            y2: f32,
        ),
    >,
    pub curvetov: ::core::option::Option<
        unsafe extern "C" fn(
            ctx: *mut fz_context,
            arg: *mut ::core::ffi::c_void,
            x2: f32,
            y2: f32,
            x3: f32,
            y3: f32,
        ),
    >,
    pub curvetoy: ::core::option::Option<
        unsafe extern "C" fn(
            ctx: *mut fz_context,
            arg: *mut ::core::ffi::c_void,
            x1: f32,
            y1: f32,
            x3: f32,
            y3: f32,
        ),
    >,
    pub rectto: ::core::option::Option<
        unsafe extern "C" fn(
            ctx: *mut fz_context,
            arg: *mut ::core::ffi::c_void,
            x1: f32,
            y1: f32,
            x2: f32,
            y2: f32,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fz_path_walker"][::core::mem::size_of::<fz_path_walker>() - 64usize];
    ["Alignment of fz_path_walker"][::core::mem::align_of::<fz_path_walker>() - 8usize];
    ["Offset of field: fz_path_walker::moveto"]
        [::core::mem::offset_of!(fz_path_walker, moveto) - 0usize];
    ["Offset of field: fz_path_walker::lineto"]
        [::core::mem::offset_of!(fz_path_walker, lineto) - 8usize];
    ["Offset of field: fz_path_walker::curveto"]
        [::core::mem::offset_of!(fz_path_walker, curveto) - 16usize];
    ["Offset of field: fz_path_walker::closepath"]
        [::core::mem::offset_of!(fz_path_walker, closepath) - 24usize];
    ["Offset of field: fz_path_walker::quadto"]
        [::core::mem::offset_of!(fz_path_walker, quadto) - 32usize];
    ["Offset of field: fz_path_walker::curvetov"]
        [::core::mem::offset_of!(fz_path_walker, curvetov) - 40usize];
    ["Offset of field: fz_path_walker::curvetoy"]
        [::core::mem::offset_of!(fz_path_walker, curvetoy) - 48usize];
    ["Offset of field: fz_path_walker::rectto"]
        [::core::mem::offset_of!(fz_path_walker, rectto) - 56usize];
};
unsafe extern "C" {
    #[doc = "Walk the segments of a path, calling the<br>appropriate callback function from a given set for each<br>segment of the path.\n\n`path`: The path to walk.\n\n`walker`: The set of callback functions to use. The first<br>4 callback pointers in the set must be non-`NULL`. The<br>subsequent ones can either be supplied, or can be left<br>as `NULL`, in which case the top 4 functions will be<br>called as appropriate to simulate them.\n\n`arg`: An opaque argument passed in to each callback.\n\nExceptions will only be thrown if the underlying callback<br>functions throw them."]
    pub fn fz_walk_path(
        ctx: *mut fz_context,
        path: *const fz_path,
        walker: *const fz_path_walker,
        arg: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    #[doc = "Create a new \\(empty\\) path structure."]
    pub fn fz_new_path(ctx: *mut fz_context) -> *mut fz_path;
}
unsafe extern "C" {
    #[doc = "Increment the reference count. Returns the same pointer.\n\nAll paths can be kept, regardless of their packing type.\n\nNever throws exceptions."]
    pub fn fz_keep_path(ctx: *mut fz_context, path: *const fz_path) -> *mut fz_path;
}
unsafe extern "C" {
    #[doc = "Decrement the reference count. When the reference count hits<br>zero, free the path.\n\nAll paths can be dropped, regardless of their packing type.<br>Packed paths do not own the blocks into which they are packed<br>so dropping them does not free those blocks.\n\nNever throws exceptions."]
    pub fn fz_drop_path(ctx: *mut fz_context, path: *const fz_path);
}
unsafe extern "C" {
    #[doc = "Minimise the internal storage used by a path.\n\nAs paths are constructed, the internal buffers<br>grow. To avoid repeated reallocations they<br>grow with some spare space. Once a path has<br>been fully constructed, this call allows the<br>excess space to be trimmed."]
    pub fn fz_trim_path(ctx: *mut fz_context, path: *mut fz_path);
}
unsafe extern "C" {
    #[doc = "Return the number of bytes required to pack a path."]
    pub fn fz_packed_path_size(path: *const fz_path) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Pack a path into the given block.<br>To minimise the size of paths, this function allows them to be<br>packed into a buffer with other information. Paths can be used<br>interchangeably regardless of how they are packed.\n\n`pack`: Pointer to a block of data to pack the path into. Should<br>be aligned by the caller to the same alignment as required for<br>a [`fz_path`] pointer.\n\n`path`: The path to pack.\n\nReturns the number of bytes within the block used. Callers can<br>access the packed path data by casting the value of pack on<br>entry to be a [`fz_path`] *.\n\nThrows exceptions on failure to allocate.\n\nImplementation details: Paths can be 'unpacked', 'flat', or<br>'open'. Standard paths, as created are 'unpacked'. Paths<br>will be packed as 'flat', unless they are too large<br>\\(where large indicates that they exceed some private<br>implementation defined limits, currently including having<br>more than 256 coordinates or commands\\).\n\nLarge paths are 'open' packed as a header into the given block,<br>plus pointers to other data blocks.\n\nUsers should not have to care about whether paths are 'open'<br>or 'flat' packed. Simply pack a path \\(if required\\), and then<br>forget about the details."]
    pub fn fz_pack_path(ctx: *mut fz_context, pack: *mut u8, path: *const fz_path) -> usize;
}
unsafe extern "C" {
    #[doc = "Clone the data for a path.\n\nThis is used in preference to [`fz_keep_path`] when a whole<br>new copy of a path is required, rather than just a shared<br>pointer. This probably indicates that the path is about to<br>be modified.\n\n`path`: path to clone.\n\nThrows exceptions on failure to allocate."]
    pub fn fz_clone_path(ctx: *mut fz_context, path: *mut fz_path) -> *mut fz_path;
}
unsafe extern "C" {
    #[doc = "Find out if a path is completely empty."]
    pub fn fz_path_is_empty(ctx: *mut fz_context, path: *const fz_path) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Return the current point that a path has<br>reached or \\(0,0\\) if empty.\n\n`path`: path to return the current point of."]
    pub fn fz_currentpoint(ctx: *mut fz_context, path: *mut fz_path) -> fz_point;
}
unsafe extern "C" {
    #[doc = "Append a 'moveto' command to a path.<br>This 'opens' a path.\n\n`path`: The path to modify.\n\n`x`, `y`: The coordinate to move to.\n\nThrows exceptions on failure to allocate, or attempting to<br>modify a packed path."]
    pub fn fz_moveto(ctx: *mut fz_context, path: *mut fz_path, x: f32, y: f32);
}
unsafe extern "C" {
    #[doc = "Append a 'lineto' command to an open path.\n\n`path`: The path to modify.\n\n`x`, `y`: The coordinate to line to.\n\nThrows exceptions on failure to allocate, or attempting to<br>modify a packed path."]
    pub fn fz_lineto(ctx: *mut fz_context, path: *mut fz_path, x: f32, y: f32);
}
unsafe extern "C" {
    #[doc = "Append a 'rectto' command to an open path.\n\nThe rectangle is equivalent to:<br>moveto x0 y0<br>lineto x1 y0<br>lineto x1 y1<br>lineto x0 y1<br>closepath\n\n`path`: The path to modify.\n\n`x0`, `y0`: First corner of the rectangle.\n\n`x1`, `y1`: Second corner of the rectangle.\n\nThrows exceptions on failure to allocate, or attempting to<br>modify a packed path."]
    pub fn fz_rectto(ctx: *mut fz_context, path: *mut fz_path, x0: f32, y0: f32, x1: f32, y1: f32);
}
unsafe extern "C" {
    #[doc = "Append a 'quadto' command to an open path. \\(For a<br>quadratic bezier\\).\n\n`path`: The path to modify.\n\n`x0`, `y0`: The control coordinates for the quadratic curve.\n\n`x1`, `y1`: The end coordinates for the quadratic curve.\n\nThrows exceptions on failure to allocate, or attempting to<br>modify a packed path."]
    pub fn fz_quadto(ctx: *mut fz_context, path: *mut fz_path, x0: f32, y0: f32, x1: f32, y1: f32);
}
unsafe extern "C" {
    #[doc = "Append a 'curveto' command to an open path. \\(For a<br>cubic bezier\\).\n\n`path`: The path to modify.\n\n`x0`, `y0`: The coordinates of the first control point for the<br>curve.\n\n`x1`, `y1`: The coordinates of the second control point for the<br>curve.\n\n`x2`, `y2`: The end coordinates for the curve.\n\nThrows exceptions on failure to allocate, or attempting to<br>modify a packed path."]
    pub fn fz_curveto(
        ctx: *mut fz_context,
        path: *mut fz_path,
        x0: f32,
        y0: f32,
        x1: f32,
        y1: f32,
        x2: f32,
        y2: f32,
    );
}
unsafe extern "C" {
    #[doc = "Append a 'curvetov' command to an open path. \\(For a<br>cubic bezier with the first control coordinate equal to<br>the start point\\).\n\n`path`: The path to modify.\n\n`x1`, `y1`: The coordinates of the second control point for the<br>curve.\n\n`x2`, `y2`: The end coordinates for the curve.\n\nThrows exceptions on failure to allocate, or attempting to<br>modify a packed path."]
    pub fn fz_curvetov(
        ctx: *mut fz_context,
        path: *mut fz_path,
        x1: f32,
        y1: f32,
        x2: f32,
        y2: f32,
    );
}
unsafe extern "C" {
    #[doc = "Append a 'curvetoy' command to an open path. \\(For a<br>cubic bezier with the second control coordinate equal to<br>the end point\\).\n\n`path`: The path to modify.\n\n`x0`, `y0`: The coordinates of the first control point for the<br>curve.\n\n`x2`, `y2`: The end coordinates for the curve \\(and the second<br>control coordinate\\).\n\nThrows exceptions on failure to allocate, or attempting to<br>modify a packed path."]
    pub fn fz_curvetoy(
        ctx: *mut fz_context,
        path: *mut fz_path,
        x0: f32,
        y0: f32,
        x2: f32,
        y2: f32,
    );
}
unsafe extern "C" {
    #[doc = "Close the current subpath.\n\n`path`: The path to modify.\n\nThrows exceptions on failure to allocate, attempting to modify<br>a packed path, and illegal path closes \\(i.e. closing a non open<br>path\\)."]
    pub fn fz_closepath(ctx: *mut fz_context, path: *mut fz_path);
}
unsafe extern "C" {
    #[doc = "Transform a path by a given<br>matrix.\n\n`path`: The path to modify \\(must not be a packed path\\).\n\n`transform`: The transform to apply.\n\nThrows exceptions if the path is packed, or on failure<br>to allocate."]
    pub fn fz_transform_path(ctx: *mut fz_context, path: *mut fz_path, transform: fz_matrix);
}
unsafe extern "C" {
    #[doc = "Return a bounding rectangle for a path.\n\n`path`: The path to bound.\n\n`stroke`: If `NULL`, the bounding rectangle given is for<br>the filled path. If non-`NULL` the bounding rectangle<br>given is for the path stroked with the given attributes.\n\n`ctm`: The matrix to apply to the path during stroking.\n\n`r`: Pointer to a [`fz_rect`] which will be used to hold<br>the result.\n\nReturns r, updated to contain the bounding rectangle."]
    pub fn fz_bound_path(
        ctx: *mut fz_context,
        path: *const fz_path,
        stroke: *const fz_stroke_state,
        ctm: fz_matrix,
    ) -> fz_rect;
}
unsafe extern "C" {
    #[doc = "Given a rectangle \\(assumed to be the bounding box for a path\\),<br>expand it to allow for the expansion of the bbox that would be<br>seen by stroking the path with the given stroke state and<br>transform."]
    pub fn fz_adjust_rect_for_stroke(
        ctx: *mut fz_context,
        rect: fz_rect,
        stroke: *const fz_stroke_state,
        ctm: fz_matrix,
    ) -> fz_rect;
}
unsafe extern "C" {
    #[doc = "A sane 'default' stroke state."]
    pub static fz_default_stroke_state: fz_stroke_state;
}
unsafe extern "C" {
    #[doc = "Create a new \\(empty\\) stroke state structure \\(with no dash<br>data\\) and return a reference to it.\n\nThrows exception on failure to allocate."]
    pub fn fz_new_stroke_state(ctx: *mut fz_context) -> *mut fz_stroke_state;
}
unsafe extern "C" {
    #[doc = "Create a new \\(empty\\) stroke state structure, with room for<br>dash data of the given length, and return a reference to it.\n\n`len`: The number of dash elements to allow room for.\n\nThrows exception on failure to allocate."]
    pub fn fz_new_stroke_state_with_dash_len(
        ctx: *mut fz_context,
        len: ::core::ffi::c_int,
    ) -> *mut fz_stroke_state;
}
unsafe extern "C" {
    #[doc = "Take an additional reference to a stroke state structure.\n\nNo modifications should be carried out on a stroke<br>state to which more than one reference is held, as<br>this can cause race conditions."]
    pub fn fz_keep_stroke_state(
        ctx: *mut fz_context,
        stroke: *const fz_stroke_state,
    ) -> *mut fz_stroke_state;
}
unsafe extern "C" {
    pub fn fz_stroke_state_eq(
        ctx: *mut fz_context,
        a: *const fz_stroke_state,
        b: *const fz_stroke_state,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Drop a reference to a stroke state structure, destroying the<br>structure if it is the last reference."]
    pub fn fz_drop_stroke_state(ctx: *mut fz_context, stroke: *const fz_stroke_state);
}
unsafe extern "C" {
    #[doc = "Given a reference to a \\(possibly\\) shared stroke_state structure,<br>return a reference to an equivalent stroke_state structure<br>that is guaranteed to be unshared \\(i.e. one that can<br>safely be modified\\).\n\n`shared`: The reference to a \\(possibly\\) shared structure<br>to unshare. Ownership of this reference is passed in<br>to this function, even in the case of exceptions being<br>thrown.\n\nExceptions may be thrown in the event of failure to<br>allocate if required."]
    pub fn fz_unshare_stroke_state(
        ctx: *mut fz_context,
        shared: *mut fz_stroke_state,
    ) -> *mut fz_stroke_state;
}
unsafe extern "C" {
    #[doc = "Given a reference to a \\(possibly\\) shared stroke_state structure,<br>return a reference to a stroke_state structure \\(with room for a<br>given amount of dash data\\) that is guaranteed to be unshared<br>\\(i.e. one that can safely be modified\\).\n\n`shared`: The reference to a \\(possibly\\) shared structure<br>to unshare. Ownership of this reference is passed in<br>to this function, even in the case of exceptions being<br>thrown.\n\nExceptions may be thrown in the event of failure to<br>allocate if required."]
    pub fn fz_unshare_stroke_state_with_dash_len(
        ctx: *mut fz_context,
        shared: *mut fz_stroke_state,
        len: ::core::ffi::c_int,
    ) -> *mut fz_stroke_state;
}
unsafe extern "C" {
    #[doc = "Create an identical stroke_state structure and return a<br>reference to it.\n\n`stroke`: The stroke state reference to clone.\n\nExceptions may be thrown in the event of a failure to<br>allocate."]
    pub fn fz_clone_stroke_state(
        ctx: *mut fz_context,
        stroke: *const fz_stroke_state,
